#!/usr/bin/perl 
#version : 1.0
# xiaofangxu@vivo.com.cn, 2014.5.30
#------------------------------------------------------------------------
#Target:                                                               
#   auto analysis tool of user feedback.    
#------------------------------------------------------------------------

use Cwd;
use Time::HiRes qw(gettimeofday);
use Win32::OLE qw(in with);
use Win32::OLE::Const 'Microsoft Excel';
$Win32::OLE::Warn = 3;  

$Excel = Win32::OLE->GetActiveObject('Excel.Application')|| Win32::OLE->new('Excel.Application', 'Quit');   

#my @PHONEMODELS = qw(X3tDetail X3VDetail X5LDetail XplayDetail Xplay3sDetail XshotDetail Y22LDetail Y22iLDetail Y27Detail Y13LDetail X5VDetail Y28LDetail Y23LDetail X5SLDetail);# X5MaxLDetail);  # 机型
#my @PHONEMODELS = qw(XplayDetail Xplay3sDetail XshotDetail X5MaxLDetail);  # 机型
#my @PHONEMODELS = qw(Y13LDetail X5VDetail Y28LDetail Y23LDetail X5SDetail);  # 机型
#my @PHONEMODELS = qw(XplayDetail Xplay3sDetail X5LDetail XshotDetail X5MaxLDetail X5Max+Detail Y29LDetail X5MaxVDetail X5ProDDetail);#  X5MDetail);  # 机型
my @PHONEMODELS = qw(X5ProDDetail);  # 机型

my $dir = getcwd;
my $workbook;
my $pageNum = 2;	
$colMax = 79;  # 模式数 

@TAGSERIES = qw(耗电 发热 系统性能 死机 重启 自动关机 触屏 桌面 黑屏 升级 vivo乐园 屏幕发黄 闪屏 场景桌面 小挂件 相机 通话 无响应 停止运行 闪退 兼容性 
i音乐 i视频 音频 i管家 浏览器 软件商店 状态栏 联系人 短信 电子邮件 文件管理 输入法 天气预报 便签 计算器 超清影院 电子书 
网络信号 WIFI GPS 蓝牙 指纹 OTG 智能体感 流量监控 时间不准 帐号 小屏 游戏 第三方软件 云服务 充电 截屏 闹钟 photo+ i主题 HIFI 锁屏 相册 手电筒 收音机 字体 内存和SD卡 屏幕亮度 震动 vivo语音助手 
日历 NFC ROOT 游戏中心 访客模式 USB vivo社区 天籁K歌 录音 掉漆 建议 问题 抱怨 满意);


#二级分类匹配字符串数组
#耗电
my @KeywordsBatterySecond = qw(影音|电影|电视|视频|连续剧|美剧 听歌|音乐|歌曲 游戏 满.{0,18}电.{0,18}(没|木有).{0,18}电|电.{0,18}快|耗电.{0,18}快|小时.{0,18}(耗|用).{0,18}电|电.{0,18}厉害|真是耗电|电量.{0,18}掉|电.{0,18}不.{0,18}耐用|充满电.{0,18}只剩|去.{0,18}%.{0,18}电|用电.{0,18}快|电掉.{0,18}快|百分之.{0,18}电|电池消耗|电不耐用|耗电.{0,18}大|掉电.{0,18}严重|不存电|电.{0,18}流逝|费电|电.{0,18}多|耗电严重|(没|木有)电|耗电|电(没|木有)了|电.{0,18}不够用|电.{0,18}自己.{0,18}光|电.{0,18}用.{0,18}不|电.{0,18}吊.{0,18}快|电池.{0,18}短|电.{0,18}不耐用|电池.{0,18}抗使|电.{0,18}耗|电池.{0,18}不|电.{0,18}用不|电池.{0,18}(没|木有).{0,18}电|不保电|電池.{0,18}不|电池续航|不耐电|电.{0,18}不经用|电量.{0,18}迅速.{0,18}少|电池.{0,18}用.{0,18}快|电池用不.{0,18}天|电.{0,18}不耐用|电量.{0,18}不行|电用.{0,18}快|电量.{0,18}差|电跑的.{0,18}快|电太费|电池.{0,18}差|放电很快|优化电池|电池.{0,18}弱|电.{0,18}降.{0,18}快|不住电|用电 待机.{0,18}(更|还|非常|特别) 晚上 电量.{0,18}显示.{0,18}(不准|异常不正确|不对) 媒体服务器.{0,18}(自.{0,18}启|自己.{0,18}开) %.*%重.{0,18}启.*(%|正常|回复|恢复));
$mergeArray[0]=@KeywordsBatterySecond;
#---------------------------------
#发热
my @KeywordsHeatSecond = qw(新闻 上.{0,18}网 听筒 音乐|听.{0,18}歌|歌曲  屏幕 游戏 (充.{0,18}电|冲.{0,18}电).{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的|发烫|发热|发熱) 影音|电影|电视|视频|连续剧|美剧 保护套|手机套|手机壳 下载.{0,18}(影音|电影|电视|视频|连续剧|美剧) 电池|背面|背部|后盖|后背|后面 前.{0,18}摄像头 (分钟|小时).{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的)|发热.{0,18}快 指纹.{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的) 相机|拍照|录像|照相);
$mergeArray[1]=@KeywordsHeatSecond;
#---------------------------------
#性能 34
my @KeywordsPerfSecond = qw(切.{0,18}歌 vivoice 相机.{0,18}(专业模式|专业拍照) (影音|电影|电视|视频|连续剧)|自带.{0,18}播放器.{0,18}(播|放).{0,18}MV 相机.{0,18}聚焦 触.{0,18}屏|点.{0,18}屏|屏.{0,18}触|屏.{0,18}点 上滑.{0,18}通知栏.{0,18}进.{0,18}程序|上滑 开机.{0,18}(慢|卡|迟钝) 关机.{0,18}(慢|卡|迟钝) 升级.{0,18}时 OTG (听|播|放).{0,18}(音乐|歌) 横屏 (收音机|FM).{0,18}(卡|迟钝|迟缓|(没|木有)反应|不响应) 来电.{0,18}(没|木有)反应 安装 划屏|滑屏 (开|进).{0,18}文件夹 视频|播放.{0,18}摄像|电影|电视|影像|连续剧|美剧 重力感应|重力传感器 (联系人|通讯录).{0,18}(拨号|拨.{0,18}电话|打.{0,18}电话) 删.{0,18}(照片|图片|图像|相片) (开|进).{0,18}相机|相机.{0,18}(开|进) 下载.{0,18}卡 桌面.{0,18}滑|桌面.{0,18}移动|滑.{0,18}桌面 i管家.{0,18}内存.{0,18}清理.{0,18}卡 i音乐|自带.{0,18}音乐.{0,18}播放器 游戏 闹钟 输入法|中英文.{0,18}切换|数字.{0,18}切换|打.{0,18}字|输.{0,18}字|写.{0,18}字 打开.{0,18}(照片|图片|图像|相片) 内存.{0,18}(%|高) 壁纸.{0,18}滚动 亮.{0,18}屏|唤醒.{0,18}屏|屏.{0,18}亮|屏.{0,18}唤醒 省电.{0,18}开.{0,18}关 锁.{0,18}屏.{0,18}解.{0,18}锁|锁.{0,18}屏键 ((文件夹.{0,18}打开)|(打开.{0,18}文件夹)).{0,18}多 浏览器|流览器 锁屏.{0,18}全屏.{0,18}(闪电|雷电) (图库|相册).{0,18}gif 相机.{0,18}(进|入|到).{0,18}(相册|图库) 拍照|用.{0,18}相机 (卸载|删除).{0,18}(软件|应用程序) 语音助手.{0,18}(启动|打开|进)|(启动|打开|进).{0,18}语音助手 手势拨号 320mp3.{0,18}系统播放器 状态栏|通知栏 开软件|进.{0,18}(应用|程序) 发.{0,18}(短信|信息) 开机.{0,18}时间.{0,18}(长|久) (开|进).{0,18}短信|短信.{0,18}(开|进) 解锁 电子书.{0,18}(显示|现实).{0,18}(卡顿|迟钝|不.{0,18}(流畅|顺畅)) (智能接叫|智能接听|命令接听).{0,18}(迟钝|迟缓|卡|不敏感) 4K 访客模式.{0,18}正常模式.{0,18}(转换|切换)|访客模式.{0,18}(转换|切换));
$mergeArray[2]=@KeywordsPerfSecond;
#---------------------------------
#死机
my @KeywordsDieSecond = qw(触屏|点.{0,18}屏 i音乐|自带.{0,18}音乐.{0,18}播放器 (插|连|联).{0,18}(数据线|USB) (听|播|放).{0,18}(音乐|歌) 游戏 拍照|照相|相机 photo+ 影音|电影|电视|视频|连续剧|美剧 录像|摄像|拍摄|录影 闹钟.{0,18}(响|闹|叫).{0,18}(一键加速|一键清理) 通话|打电话|电话.{0,18}聊天|电话粥 桌面.{0,18}待机|待机.{0,18}桌面 (接|听).{0,18}电话 解锁 打.{0,18}(完.{0,18}电话|电话.{0,18}完)|(电话|通话).{0,18}完 (升级|更新.{0,18}系统|系统.{0,18}更新|升.{0,18}版本).{0,18}死机 相机.{0,18}(开|进)|(开|进).{0,18}相机 开机.{0,18}vivo 充电.{0,18}死机 闹钟.{0,18}响.{0,18}死机);
$mergeArray[3]=@KeywordsDieSecond;
#---------------------------------
#重启
my @KeywordASZestartSecond = qw(点.{0,18}关机 锁屏 u盘.{0,18}损坏 (开|进).{0,18}数据连接 手电|电筒 通话|打电话|电话.{0,18}聊天|电话粥 (看|播|放).{0,18}(影音|电影|电视|视频|连续剧|美剧) 下载.{0,18}(影音|电影|电视|视频|连续剧|美剧) 开.{0,18}关.{0,18}数据连接 音乐播放器|(听|播|放).{0,18}(音乐|歌) 开机.{0,18}界面 拍照|照相|相机 录像|摄像|拍摄|录影 (影音|电影|电视|视频|连续剧|美剧|片).{0,18}锁.{0,18}屏 蓝牙.{0,18}(汽车|车载) 数据.{0,18}((没|木有)了|丢失|找不到|消失|失踪) SD|存储卡|储存卡 (软件|应用|程序).{0,18}(丢失|找不到|消失|失踪|(没|木有)了) (开|运行).*WAY 重启.{0,18}游戏.{0,18}(没了|消失了|找不到|没有了));
$mergeArray[4]=@KeywordASZestartSecond;
#---------------------------------
#自动关机
my @KeywordsPoweroffSecond = qw(影音|电影|电视|视频|连续剧|美剧 通话|打电话|电话.{0,18}聊天|电话粥 桌面.{0,18}(开|进).{0,18}(程序|应用)|(开|进).{0,18}桌面.{0,18}(程序|应用) 游戏 手电|电筒 来电|打.{0,18}来|给.{0,18}我.{0,18}打|接.{0,18}电话 vivo.{0,18}(闪传|互传) (听|播|放).{0,18}(音乐|歌) (关机|自动死机).{0,18}(充电|冲电|接电源).{0,18}((没|木有)反应|不响应|不显示));
$mergeArray[5]=@KeywordsPoweroffSecond;
#---------------------------------
#触屏
my @KeywordsTouchPanelSecond = qw(屏.{0,18}(抖动|跳)|跳.{0,18}屏 桌面.{0,18}图标.{0,18}(屏.{0,18}(抖动|跳)|跳.{0,18}屏) 短时间.{0,18}连续 出错.{0,18}多次.{0,18}|乱了|乱跳 太灵敏|灵敏.{0,18}(高|过)|过.{0,18}灵敏 灵敏度.{0,18}(差|不好|不行|烂)|误触|不好使|(没|木有).{0,18}应|不准|失灵|(没|木有).{0,18}敏|不.{0,18}好.{0,18}用|屏幕.{0,18}(没|木有).{0,18}反应|不.{0,18}稳|不好 (不|无法).{0,18}校准|(没|木有).{0,18}校准 失灵|(不|无法).{0,18}灵|(没|木有).{0,18}灵|(失|(没|木有)|无)效|失败|不.{0,18}成功|(不|(没|木有)).{0,18}(反应|响应) 开.{0,18}护屏 延迟|滞后 右.{0,18}用不|右.{0,18}(无法|不).{0,18}使用 桌面.{0,18}滑屏.{0,18}抖动 左.{0,18}绿 游戏.{0,18}(不|无法).{0,18}多点.{0,18}(触屏|触控) 底.{0,18}键.{0,18}(无|(没|木有)).{0,18}(声|音) 定屏);
$mergeArray[6]=@KeywordsTouchPanelSecond;
#---------------------------------
#桌面
my @KeywordsLauncherSecond = qw(动态桌面.{0,18}(丑|难看|不好看|恶心) (timeline|时间轴|时间桌面|时光轴).{0,18}签名 (timeline|时间轴|时间桌面|时光轴).{0,18}(壁纸|背景) 壁纸.{0,18}(不|无法).{0,18}滑动|壁纸.{0,18}(不|无法).{0,18}移动|壁纸.{0,18}动不了 经典桌面 桌面.{0,18}便捷开关 (timeline|时间轴|时间桌面|时光轴).{0,18}打.{0,18}开 动态壁纸 场景切换 图标.{0,18}删|删.{0,18}图标 主题桌面.{0,18}(不|无法).{0,18}回 (关闭|退出).{0,18}(桌面场景|场景模式) 建.{0,18}文件夹 (不|无法).{0,18}显示.{0,18}运营商 设置.{0,18}桌面循环 未读信息显示 壁纸.{0,18}(不|无法).{0,18}全屏 ((滑.{0,18}屏)|(屏.{0,18}滑)).{0,18}(抖|跳) (滑屏|屏滑).{0,18}(亮.{0,18}暗|暗.{0,18}亮) ((没|木有)|不|无法).{0,18}(节日|过节).{0,18}壁纸|(节日|过节).{0,18}壁纸.{0,18}((没|木有)|不|无法) (换.{0,18}不|不.{0,18}换).{0,18}壁纸|壁纸.{0,18}(换.{0,18}不|不.{0,18}换) 显示.{0,18}(无|(没|木有)|不).{0,18}壁纸|(无|(没|木有)|不).{0,18}显示.{0,18}壁纸 横屏.{0,18}壁纸.{0,18}(不|无法|(没|木有)).{0,18}用 ((没|木有)|无).{0,18}(timeline|时间轴|时间桌面|时光轴) 待机.{0,18}(时间|时长).{0,18}(短|不.{0,18}长) (timeline|时间轴|时间桌面|时光轴).{0,18}((没|木有)反应|不响应) 3D壁纸.{0,18}(用不了|不能用|(没|木有)效|无效|不能使用|不行) 重.{0,18}启.{0,18}壁纸.{0,18}换 乐享极致.{0,18}(改|替换|删除|哪.{0,18}改) (timeline|时间轴|时间桌面|时光轴|時間桌面).{0,18}(怎么|怎样|如何|不能|不可以|((没|木有))|没法|无法).{0,18}(关|切回) (横屏.{0,18}游戏|游戏.{0,18}横屏).{0,18}桌面.{0,18}横屏 (不能|没法|无法|不可以).{0,18}设.{0,18}滚动壁纸 图标.{0,18}变.{0,18}位置 (滑屏|翻页).{0,18}闪屏 (timeline|时间轴|时间桌面|时光轴|時間桌面).{0,18}(丑|难看|不好看));
$mergeArray[7]=@KeywordsLauncherSecond;
#---------------------------------
#黑屏
my @KeywordsblackScreenSecond = qw(开.{0,18}(图片|相片|照片|图像) 听.{0,18}语音贴 黑.{0,18}(块|点) 游戏 photo+ 听.{0,18}(歌|音乐)|音乐播放器 蓝牙.{0,18}(汽车|车载) 相机|拍照|摄像|拍摄|录像|摄影);
$mergeArray[8]=@KeywordsblackScreenSecond;
#---------------------------------
#升级
my @KeywordsupGradeSecond = qw(不.{0,18}升级.{0,18}Android|升级.{0,18}失败|(不能|不可以|无法).{0,18}升级|升级.{0,18}失效|升级不了|升级(不|无法)成功|升级慢|升级升(不|无法)了|升(不|无法)了伋|无法.{0,18}升级|更新(不|无法)了.{0,18}系统|系统.{0,18}升(不|无法)了级|系统更新失败|刷机(不|无法)成|升级不.{0,18}系统|系统更新.{0,18}(不成功|不行|不了|不有效)|更新.{0,18}不.{0,18}版本|系统.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|不.{0,18}自动升级|系统.{0,18}不.{0,18}更新|更新失败|更新不.{0,18}系统|升级.{0,18}(不成功|不行|不了|不有效)|升不了级|升级.{0,18}不.{0,18}成功|更行系统.{0,18}失败|系统.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|昇级.{0,18}(不成功|不行|不了|不有效)|手机.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|(不|无法).{0,18}更新|版本.{0,18}(更新.{0,18}不|不.{0,18}更新)|升级不到|不能更新最新版本|无法更新系统|没法升级 升级.{0,18}后|升完级|升级完|更新版本.{0,18}后|更新后就不行|更新了版本 升级.{0,18}慢|系统更新去哪啦 (不|(没|木有)|无法).{0,18}自.{0,18}启 (怎么|如何).{0,18}(升级|更新.{0,18}系统|升.{0,18}版本)|升级在哪.{0,18} 升级.{0,18}重.{0,18}启.{0,18}乱码);
$mergeArray[9]=@KeywordsupGradeSecond;
#---------------------------------
#vivo乐园
my @KeywordsvivoSpaceSecond = qw(乐园.{0,18}社区.{0,18}注册.{0,18}同.{0,18}(账户|账号|帐户|帐号) 密码.{0,18}(找回|取回|不记得)|(取回|找回).{0,18}密码|密码.{0,18}(忘|丢)|(忘|丢).{0,18}密码|注册.{0,18}忘 (无法|不).{0,18}(登录|登陆) (自动|自己).{0,18}退出 (帖子|贴子).{0,18}(打不开|进不去|上不了)|(打不开|进不去|上不了).{0,18}(帖子|贴子) 论坛.{0,18}上.{0,18}不|论坛.{0,18}(不|无法).{0,18}进|(不|无法|(没|木有)).{0,18}(上|进).{0,18}论坛. (更新|升级).{0,18}后.{0,18}(不|无法).{0,18}(登入|登录|登上) 怎么.{0,18}改.{0,18}密码 图片.{0,18}(加载.{0,18}不|不.{0,18}加载)|(没|木有).{0,18}图片|看.{0,18}不.{0,18}图片|图片.{0,18}看.{0,18}不 打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|用不了 (不|无法|(没|木有)).{0,18}发.{0,18}(贴|帖) 乐园.{0,5}(打不开|进不去|上不了)|(打不开|进不去|上不了).{0,5}乐园 (不能|不可以|无法|(没|木有)|没法).{0,18}注册|注册.{0,18}失败);
$mergeArray[10]=@KeywordsvivoSpaceSecond;
#---------------------------------
#屏幕发黄
my @KeywordASZellowScreenSecond = qw(最下.{0,18}横条 上下.{0,18}黄屏 黄线 底端|下方|地下 (又上|右上).{0,18}黄 白.{0,18}页);
$mergeArray[11]=@KeywordASZellowScreenSecond;
#---------------------------------
#闪屏
my @KeywordsflickerScrrenSecond = qw((通话|电话).{0,18}闪.{0,18}屏|(通话|电话).{0,18}屏.{0,18}闪 插.{0,18}充电器 (键|健|建).{0,18}(不|无法) 中间.{0,18}(黑|蓝) 滑.{0,18}屏|划.{0,18}屏);
$mergeArray[12]=@KeywordsflickerScrrenSecond;
#---------------------------------
#场景桌面
my @KeywordsSceneSecond = qw((不|无法).{0,18}下载 黑色.{0,18}桌面 (取消|撤销|删除|关不了|换掉|去除|切换|关|换不了).{0,18}(场景桌面|虚拟桌面|x空间)|关闭|退出|(场景桌面|虚拟桌面|x空间).{0,18}(取消|撤销|删除|关不了|换掉|去除|切换|关|换不了));
$mergeArray[13]=@KeywordsSceneSecond;
#---------------------------------
#小挂件
my @KeywordsWidgetSecond = qw(日历.{0,18}(无|不|(没|木有)).{0,18}农历 日历.{0,18}(丑|难看|恶心|简陋));
$mergeArray[14]=@KeywordsWidgetSecond;
#---------------------------------
#相机 57
my @KeywordsCameraSecond = qw((夜景|晚上|夜拍|夜间).{0,18}(不|差|烂|模糊) 模糊|(不|无法|((没|木有))).{0,18}(清晰|清楚|清晰)|摸湖|(照片|相片).{0,18}(白内障|花) 前.{0,18}摄像.{0,18}(打不|无法).{0,18}开|(打不|无法).{0,18}开.{0,18}前.{0,18}摄像 莫名其妙.{0,18}拍 水印.{0,18}花哨 ((没|木有)|无法|不).{0,18}变焦|变焦.{0,18}(无效|失效|失败|不)|全景.{0,18}(不能|不可以|(没|木有)|无法).{0,18}对焦 前.{0,18}摄像头.{0,18}反|自拍.{0,18}反 ((没|木有)|无).{0,18}构图线 (多|有).{0,18}(噪点|燥点)|(噪点|燥点).{0,18}(多|大) (专业模式|专业拍照).{0,18}放大 前.{0,18}摄像头.{0,18}色点 全景.{0,18}(不|无法).{0,18}显示.{0,18}全条 全景.{0,18}(照片|图片|相片|图像).{0,18}(不|无法).{0,18}存 启动.{0,18}(失败|失效|不.{0,18}成功) 
美颜.{0,18}怪 (无法|不|(没|木有)).{0,18}调.{0,18}感光度|感光度.{0,18}(无法|不|(没|木有)).{0,18}调 mov.{0,18}(无|(没|木有)|不).{0,18}(声|音) (对焦|聚焦).{0,18}(不|无法).{0,18}(准|精确|行|正确)|(不|无法).{0,18}(对焦|聚焦) HDR 录像.{0,18}删.{0,18}(照片|相片|图片|图像) (不|无法).{0,18}全屏 颜色.{0,18}(失|不).{0,18}真 涂抹 (照片|相片|图片|图像).{0,18}(黑斑|黑团) 闪光灯.{0,18}(失效|不.{0,18}开|无效|不.{0,18}工作)|开不起灯光|闪光灯.{0,18}(无法|没法|不能|不可以)打开 自动曝光.{0,18}(不|无法).{0,18}稳 (不|无法).{0,18}横.{0,18}拍 近距离.{0,18}对焦.{0,18}(不|烂|差|有待.{0,18}(提高|进步)) (照片|相片|图片|图像).{0,18}自动删除 
背景虚化.{0,18}(延迟|迟缓|慢) 背景虚化.{0,18}((难|不).{0,18}对焦|对焦.{0,18}(难|不|差|烂|搓)) (极速盲|侧).{0,18}拍.{0,18}慢 支持.{0,18}3D 4k.{0,18}(摄像|录像|拍摄|录影|拍视频).{0,18}(不|无法).{0,18}亮 (夜间|夜晚|晚上|夜景).{0,18}(红眼|红颜|红眼|狼眼) 720.{0,18}摄像头.{0,18}(不|无法|(没|木有)).{0,18}关闭|(不|无法|(没|木有)).{0,18}关闭.{0,18}720.{0,18}摄像头 (语音拍照|声控).{0,18}((不|无法).{0,18}灵|(没|木有)反应|无效|失效|不响应|差|不|垃圾|很烂|搓) (照相|照片|相片|图片|图像|拍照).{0,18}绿 (盲拍|侧).{0,18}((不|无法).{0,18}用||(没|木有)反应|无效|失效|不响应) (不|无法).{0,18}五连拍|五连拍.{0,18}(不|无法) 麦克风.{0,18}(灵敏度.{0,18}低|不.{0,18}灵|失效|无效|(没|木有)反应|不响应) 
4K.{0,18}(摄像|录像|拍摄|录影|拍视频).{0,18}拖影 散光 前置.{0,18}白 前置.{0,18}((不|无法|失).{0,18}真|涂抹) (摄像|录像|拍摄|录影|拍视频).{0,18}(无|(没|木有)|不|无法).{0,18}(音|声|语音) 后置.{0,18}摄像头.{0,18}(抖|跳) (专业模式|专业拍照).{0,18}(不|无法).{0,18}(进|用)|(不|无法).{0,18}(进|用).{0,18}(专业模式|专业拍照)|(专业模式|专业拍照).{0,18}FC|(专业模式|专业拍照).{0,18}(玩|用).{0,18}不 相机.{0,18}打不开|相机.{0,18}进不去|相机.{0,18}无法.{0,18}开|相机.{0,18}(启动不起|(不|无法).{0,18}运行|用.{0,18}不了|故障|无法.{0,18}用)|(启动不起|(不|无法).{0,18}运行|用.{0,18}不了|故障|无法.{0,18}用).{0,18}相机|相机.{0,18}(无法|没法)(联接|连接)|(无法|没法)(联接|连接).{0,18}相机 (录像|摄像|拍摄|录影).{0,18}(不|无法).{0,18}(看|播|放) 美颜.{0,18}((没|木有)|无).{0,18}美颜 (不|无法).{0,18}调.{0,18}(焦|远近) 
白平衡.{0,18}红 优化.{0,18}(启动|开).{0,18}速度|(启动|开).{0,18}速度.{0,18}慢|(启动|开).{0,18}速度.{0,18}(不|无法) 前置.{0,18}美颜.{0,18}(不|无法|差|烂|搓) (不|无法).{0,18}(触屏|触摸|点.{0,18}屏).{0,18}拍照|(触屏|触摸|点.{0,18}屏).{0,18}拍照.{0,18}(不|无法)|中间.{0,18}圆圈.{0,18}(没用|无效|没效|不行) 黑线|黑团 
(录像|摄像|拍摄|录影).{0,18}用.{0,18}(不|无法)|(摄像|录像|拍摄|录影|拍视频).{0,18}(无法|不).{0,18}用 变形|歪|斜 前.{0,18}摄像.{0,18}(成像|效果|拍照|照片).{0,18}不 摄像.{0,18}(卡|(没|木有)反应|不响应) 黑点 (语音拍照|声控).{0,18}((不|无法).{0,18}灵|(没|木有)反应|无效|失效|不响应|差|不|垃圾|很烂|搓) 自动.{0,18}白平衡.{0,18}不|白平衡.{0,18}问题 (不|无法|(没|木有)).{0,18}全屏.{0,18}拍|全屏.{0,18}拍.{0,18}(不|无法) (图片|相片|照片|图像).{0,18}(消失|不见|失踪|找不到|(没|木有)了)
(前置|前.{0,18}摄像头).{0,18}(哈哈镜|畸变|歪)|歪|扭曲 防.{0,18}抖 拍照.{0,18}不.{0,18}灵 拍照.{0,18}(完|结束).{0,18}(不|无法).{0,18}进.{0,18}相册 闪光灯.{0,18}(长|一直).{0,18}亮 (盲拍|侧|快门键).{0,18}(((没|木有))反应|不|不响应|失灵|不灵)|按两下.{0,18}不 照片.{0,18}(打|写).{0,18}字.{0,18}(多选|批) (打开|开启|启动).{0,18}(响|声|音).{0,18}(画面|界面).{0,18}(浮动|抖动) 像素.{0,18}(低|差|不|烂|垃圾) (拍照|照相).{0,18}浮点 补光灯.{0,18}(不|无法)|(不|无法).{0,18}补光灯 (拍照|摄像).{0,18}抖动|(拍照|摄像).{0,18}抖动.{0,18}波浪.{0,18}图像 不行|不好|烂|搓|你妹|渣|优化.{0,18}相机|质量.{0,18}差 (无法|(没|木有)|不能|不可以).{0,18}(拍照|照相)|(拍照|照相).{0,18}(不了|不行|不能)|拍不了照|照.{0,18}不了|照不成照片|照不成相片|照不了像 相册.{0,18}((没|木有)|无).{0,18}(图片|相片|照片|图像)
(无|(没|木有)|不).{0,18}(专业模式|专业拍照) (图片|相片|照片|图像).{0,18}(日期|时间).{0,18}错 (不|无法).{0,18}(摄像|录像|拍摄|录影|拍视频) (摄像|录像|拍摄|录影|拍视频).{0,18}(不.{0,18}真实|失真) (图片|相片|照片|图像).{0,18}(不|无|(没|木有)).{0,18}时间 (不|无法).{0,18}拍.{0,18}gif
花屏|屏.{0,18}花 (摄像|录像|拍摄|录影|拍视频).{0,18}(模糊|不.{0,18}清) 夜拍.{0,18}(无|(没|木有)|不).{0,18}闪光灯 (怎么|如何).{0,18}用.{0,18}曝光|曝光.{0,18}(怎么|如何).{0,18}用 (专业模式|专业拍照).{0,18}(怎么|如何).{0,18}(开启|打开|进)|(怎么|如何).{0,18}(开启|打开|进).{0,18}(专业模式|专业拍照) 侧.{0,18}键.{0,18}(不|((没|木有)|无).{0,18}反应)|极速盲拍.{0,18}(不|无法).{0,18}进|(不|无法).{0,18}进.{0,18}极速盲拍|进.{0,18}(不|无法).{0,18}极速盲拍 
左下.(两次|多次) (专业模式|专业拍照).{0,18}(正常拍照|正常模式) (相机.{0,18}相册|相册.{0,18}相机).{0,18}(不|无法|(没|木有)).{0,18}(连接|联接|链接)|相机.{0,18}进不了.{0,18}相册|相机.{0,18}(不能|不可以|(没|木有)|无法).{0,18}进.{0,18}相册 (对焦|聚焦).{0,18}慢 (相片|照片|图片|图像).{0,18}(上传|转发|头像).{0,18}(发雾|PS|痕迹) 水印.{0,18}(不能|不可以|没法|无法).{0,18}用|(不能|不可以|没法|无法).{0,18}用.{0,18}水印 (没|无).{0,18}(儿童模式|文档矫正|背景虚化|运动模式) (相机|相機).{0,18}重启 微距 眩光 (启动|打开).{0,18}(无|没有).{0,18}(画面|显示)|不能,{0,18}显示 (美颜|美妆|换妆).{0,18}((不能|没法|无法|不可以).{0,18}(用|打开)|失灵|无效|失效|不出来|用不起) (拍照|照相).{0,18}(差|烂) (亮度|画面|显示|界面).{0,18}(暗|不亮) 手动对焦.{0,18}(失败|失灵|无效|失效) (视频拍摄|拍摄视频).{0,18}((不能|没法|无法|不可以).{0,18}追焦|要.{0,18}手动对焦));
$mergeArray[15]=@KeywordsCameraSecond;
#---------------------------------
#通话
my @KeywordsPhoneSecond = qw(无.{0,18}热感应 来电.{0,18}显示.{0,18}(不.{0,18}好看|丑|难看|不.{0,18}美观) (无|(没|木有)).{0,18}来电.{0,18}语音播报 免提.{0,18}(不|无法) (通话|电话).{0,10}(卡顿|迟钝|断断续续|断续)|时断时续|通话.{0,18}(质量|效果).{0,18}(不行|烂|搓|不怎么样|差|下降) (完|结束).{0,18}屏幕.{0,18}黑 打.{0,18}(不|无法)出|(不|无法)能.{0,18}打电话|拨.{0,18}(不|无法)出|打(不|无法)了|拨.{0,18}不.{0,18}号|拨.{0,18}号.{0,18}不 (无|(没|木有)|不).{0,18}来电.{0,18}闪光|来电.{0,18}闪光.{0,18}(不|(没|木有))闪 断线|断線|中断|掉线|停|(自己|自动).{0,18}(挂|断)|(老是|总是|经常).{0,18}结束 (不|无法|(没|木有)).{0,18}自动拨号|自动拨号.{0,18}(不|无法|(没|木有)) (不|无法).{0,18}拨.{0,18}视频电话|视频电话.{0,18}(不|无法).{0,18}拨|(不|无法).{0,18}视频通话|视频通话.{0,18}(不|无法)|((没|木有)|不|无法).{0,18}视频|((没|木有)|无).{0,18}(视频通话|视频同话|视频电话) 识别.{0,18}联通185 (取消|关|关闭).{0,18}(来电语音提示|语音播报|播报语音|来电播报)|(来电语音提示|语音播报|播报语音|来电播报).{0,18}(无法|不).{0,18}关|(怎么|如何).{0,18}关.{0,18}(来电语音提示|语音播报|播报语音|来电播报)|(来电语音提示|语音播报|播报语音|来电播报).{0,18}(取消|关|关闭|讨厌) 屏幕.{0,18}时亮时不亮 怎.{0,18}设置.{0,18}来电.{0,18}(大头贴|背景墙)|来电大头贴|来电背景墙|(不|无法).{0,18}设置.{0,18}来电大头贴|后.{0,18}壁纸.{0,18}设置 后.{0,18}转屏|后.{0,18}横屏|后.{0,18}竖屏 打.{0,18}黑屏 接.{0,18}黑屏|打.{0,18}来.{0,18}黑屏 挂.{0,18}(不|无法).{0,18}掉|挂.{0,18}失灵|(不能|无法|没法).{0,18}(挂掉|挂断) 接.{0,18}(不|无法).{0,18}电话|电话.{0,18}接.{0,18}(不|无法)|电话.{0,18}打.{0,18}(不|无法).{0,18}进|打.{0,18}(不|无法).{0,18}电话|打来.{0,18}不通|打.{0,18}我.{0,18}(不|无法).{0,18}通|打.{0,18}电话.{0,18}(不能|无法|(没|木有)|没法|不可以).{0,18}接通|电话.{0,18}(不能|无法|(没|木有)|没法|不可以).{0,18}接通|电话.{0,18}打不进 (不|无法|(没|木有)).{0,18}设.{0,18}背景 回音|电话.{0,18}回音 录音.{0,18}停 免提.{0,18}(自己|自动|莫名其妙|会|经常|偶尔).{0,18}(切|变|跳)听筒 (手机套|保护套|皮套).{0,18}不|不.{0,18}(手机套|保护套|皮套) ((打我.{0,18}电话)|来电|(接.{0,18}电)|(电话.{0,18}进)|(进.{0,18}电话)|(对方.{0,18}打.{0,18}电话)).{0,18}关机 视频.{0,18}(差|不好|烂|搓|清楚|模糊) 通话.{0,18}设置.{0,18}(不|无法).{0,18}(拒绝|拒接).{0,18}所.{0,18}(来电|电话) 呼叫转移.{0,18}(不|无法) (对方|别人).{0,18}听.{0,18}不 来电.{0,18}(无|(没|木有)).{0,18}LED.{0,18}灯 (无|(没|木有)).{0,18}信号 电话.{0,18}(拨.{0,18}不|不.{0,18}拨)|(不|无法).{0,18}拨.{0,18}电话 (自动|自己).{0,18}挂|断电话|断开 拨.{0,18}(电话|号).{0,18}自动.{0,18}挂 (不|无法).{0,18}归属|归属.{0,18}(不|无法) 怎么.{0,18}(关.{0,18}语音播报|语音播报.{0,18}关) 听筒.{0,5}不.{0,18}免提 (通话|来电|电话).{0,18}记录.{0,18}(不|无法|(没|木有)).{0,18}显示 一键拔号.{0,18}(无效|不|(没|木有)|失效|不响应) (来.{0,18}电|来.{0,18}电).{0,18}报号.{0,18}(开.{0,18}关|关.{0,18}开) (可以|怎么).{0,18}视频通话 ((没|木有)|无|不).{0,18}显示.{0,18}号|号.{0,18}((没|木有)|无|不).{0,18}显示|号.{0,18}显示.{0,18}不 蓝牙耳机.{0,18}断断续续 (对方|人家).{0,18}听.{0,18}不
记录.{0,18}(不|无法).{0,18}删.{0,18}一条|(不|无法).{0,18}删.{0,18}一条.{0,18}记录 (接.{0,18}(不|无法).{0,18}电话|电话.{0,18}接.{0,18}(不|无法)|电话.{0,18}打.{0,18}(不|无法).{0,18}进|打.{0,18}(不|无法).{0,18}电话|打来.{0,18}不通|打.{0,18}我.{0,18}(不|无法).{0,18}通).{0,18}(走分钟|走时|算时间|计时|(显示|现实).{0,18}时间) ((没|木有)|无|找不到).{0,18}通话.{0,18}记录 时间.{0,18}长.{0,18}屏.{0,18}不亮 ((电话|通话).{0,18}(完|结束)|(完|结束).{0,18}(电话|通话)).{0,18}(显示|现实|出现|看到).{0,18}(无|(没|木有)|找不到).{0,18}SIM (所有|全部).{0,18}((没|木有)|无|不).{0,18}显示.{0,18}号|(所有|全部).{0,18}号.{0,18}((没|木有)|无|不).{0,18}显示|(所有|全部).{0,18}号.{0,18}显示.{0,18}不 (排序|顺序).{0,18}(不|乱) (电话响|来电).{0,18}黑屏 通话.{0,18}(听.{0,18})?回声 (名字|姓名).{0,18}(不|没).{0,18}(显示|显现) 耳机.{0,18}(无效|失效|没效));
$mergeArray[16]=@KeywordsPhoneSecond;
#---------------------------------
#无响应
my @KeywordsANRSecond = qw(TF卡 (浏览器|流览器) (相机|拍照|摄像).{0,18}(无响应|(没|木有)响应));
$mergeArray[17]=@KeywordsANRSecond;
#---------------------------------
#停止运行
my @KeywordsStopRunningSecond = qw(log.{0,18}System|sog.{0,18}System|logsestym i音乐|音乐|i音樂|听音乐 游戏 电子书|电纸书|電子書 i主题 浏览器|流览器|游览器 手机管家.{0,18}隐私空间 相机|拍照|摄像|拍摄|录像|摄影|拍视频 谷歌服务|google服务 音乐播放器|(播|听|放).{0,18}(歌|音乐) 乐园 换.{0,18}壁纸 升级 状态栏|通知栏 输入法|中英文.{0,18}切换|数字.{0,18}切换|打.{0,18}字|输.{0,18}字|写.{0,18}字 手电筒 天气 i管家 短信|信息 联系人|通讯录 i视频 (隐私|加密).{0,18}(图片|相片|照片|图像) i视频.{0,18}(在线.{0,18}点播|点击.{0,18}播放.{0,18}节目|推荐.{0,18}播放) google 个性搭配 场景桌面.{0,18}在线 (换|开).{0,18}专业模式|(开|换).{0,18}专业相机 商店 photo+.{0,18}录.{0,18}视频 相册 闪传 photo+ 日历 录音.{0,18}暂停 桌面);
$mergeArray[18]=@KeywordsStopRunningSecond;
#---------------------------------
#闪退
my @KeywordsExceptionQuitSecond = qw(I管家|自己.{0,18}管家 (浏览器|流览器) 文件管理 相机专业模式 i管家在清理垃圾时 一键加速.{0,18}浏览器 游戏 相机 手电筒 天气 相册 i视频.{0,18}在线视频 进.{0,18}u盘 主题 i音乐);
$mergeArray[19]=@KeywordsExceptionQuitSecond;
#---------------------------------
#兼容性
my @KeywordsCompatibleSecond = qw(锁屏.{0,18}数字密码.{0,18}锁屏 耳机线 解锁样式.{0,18}密码 主题.{0,18}系统 线控 (不|什么时候|没法|无法).{0,18}智能手环);
$mergeArray[20]=@KeywordsCompatibleSecond;
#---------------------------------
#i音乐
my @KeywordsiMusicSecond = qw(QRC.{0,18}歌词 歌词.{0,18}(不|无法).{0,18}完整  铃声.{0,18}剪辑 延迟 歌词.{0,18}桌面|桌面.{0,18}歌词 歌词.{0,18}歌曲.{0,18}关联 歌.{0,18}搜不到 (检索|扫描).{0,18}本地.{0,18}(歌|音乐)|本地.{0,18}(歌|音乐).{0,18}(检索|扫描) 播放.{0,18}自动斩停|播放.{0,18}自动暂停 自.{0,18}启|自己打开|自动运行 (不|无法).{0,18}记忆播放 无损音乐.{0,18}卡顿 拍照.{0,18}(不|无法).{0,18}继续播放 
BBE.{0,18}(不|无法).{0,18}自.{0,18}启 bbe.{0,18}失效 音效设置.{0,18}自动重置 歌曲.{0,18}重.{0,18}播|切歌.{0,18}重.{0,18}播 (音乐|自带播放器|歌曲).{0,18}(打.{0,18}(不开|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|无法运行|不.{0,18}运行|用不了)
 插.{0,18}耳机.{0,18}自动.{0,18}播放 自.{0,18}启 自动.{0,18}关闭.{0,18}bbe.{0,18}音效 (无法|不).{0,18}换肤 (无法|不).{0,18}调.{0,18}歌词 (录像|摄像|拍摄|录影).{0,18}(不|无法).{0,18}听.{0,18}(歌|音乐)|听.{0,18}(歌|音乐).{0,18}(不|无法).{0,18}(录像|摄像|拍摄|录影) ((没|木有)|不).{0,18}srs (不|(没|木有)|无法).{0,18}批量 (无法|不).{0,18}修改.{0,18}专辑.{0,18}图片 码率.{0,18}(无法|不).{0,18}(播|放) 扫描.{0,18}歌曲.{0,18}不|(不|无法).{0,18}扫描.{0,18}歌曲 下载.{0,18}(音乐|歌).{0,18}同步.{0,18}重启 (搜|找).{0,18}歌.{0,18}(没|木有)反应 (不|无法).{0,18}播 录音.{0,18}(不|无法).{0,18}播 
(不|无法).{0,18}(分享.{0,18}朋友圈|朋友圈.{0,18}分享) 不.{0,18}的.{0,18}《.{0,18}》 歌曲.{0,18}关机.{0,18}((没|木有)了|消失了|不见了|找.{0,18}不到|失踪了) 后台运行.{0,18}清理.{0,18}(有|自.{0,18}启) 图标.{0,18}((没|木有)了|找不到|消失|失踪) 下载.{0,18}歌曲.{0,18}((没|木有)了|找不到|消失|失踪) (歌|音乐).{0,18}(少|不.{0,18}多) ((没|木有)|无).{0,18}主题 歌词.{0,18}trc|trc.{0,18}歌词 列表.{0,18}乱码 (无|(没|木有)).{0,18}桌面.{0,18}歌词
(不|无法|(没|木有)).{0,18}自动.{0,18}下载.{0,18}歌词 设置.{0,18}退出.{0,18}(恢复|回复|还原).{0,18}重新 (不能|无法|(没|木有)|不可以).{0,18}淡入淡出 (怎么|怎样|如何).{0,18}.加{0,18}(音乐|歌曲) 一键清理.{0,18}(重头|重新|从头).{0,18}播 字母.{0,18}(查询|查找));
$mergeArray[21]=@KeywordsiMusicSecond;
#---------------------------------
#i视频
my @KeywordsiVideoSecond = qw(视频.{0,18}(消失|找.{0,18}回|(没|木有)了|找不到|消失|失踪)|(找到|找回).{0,18}视频 自动.{0,18}暂停 (不|无法).{0,18}显示.{0,18}mkv.{0,18}封装字幕 flv.{0,18}视频.{0,18}黑屏 DTS.{0,18}(不|无法)|(不|无法).{0,18}DTS rmvb.{0,18}记忆播放 (打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启)|运行.{0,18}(不能|不可以|无法)|(不|无法).{0,18}.{0,18}用|启动不起|无法运行) 1G.{0,18}rmvb.{0,18}(不|无法).{0,18}快进|1G.{0,18}rmvb.{0,18}(不|无法).{0,18}快进 (不|无法).{0,18}(播|放).{0,18}哔哩哔哩|哔哩哔哩.{0,18}(不|无法).{0,18}(播|放) (不|无法).{0,18}(播|放)|看不了|视频.{0,18}打不开|(播|放).{0,18}不|视频.{0,18}打.{0,18}不 (不|无法).{0,18}外挂.{0,18}字幕 (视频|电视|电影|电视剧).{0,18}(变.{0,18}暗|亮度调节) (视频|电视|电影|电视剧).{0,18}((亮.{0,18}暗)|(暗.{0,18}亮)|(明.{0,18}暗)|(暗.{0,18}明)) MP4.{0,18}(不|无法).{0,18}播放|(不|无法).{0,18}播放.{0,18}MP4 视频.{0,18}(不|无法|(没|木有)).{0,18}(亮度.{0,18}调节|调节.{0,18}亮度) 播放.{0,18}断.{0,18}续 悬浮窗.{0,18}(不|无法).{0,18}视频 亮度.{0,18}低.{0,18}(不|无法).{0,18}调 (开|放).{0,18}视频.{0,18}暗 720.{0,18}pmkv.{0,18}花屏 缓存.{0,18}视频.{0,18}(不|无法|(没|木有)).{0,18}(看|播) (出厂|自带|原有|原生|原带).{0,18}视频.{0,18}删|删.{0,18}(出厂|自带|原有|原生|原带).{0,18}视频 声音.{0,18}图.{0,18}(不|无法|(没|木有)).{0,18}同步 (facebook|脸书|面子书).{0,18}下载.{0,18}视频.{0,18}(打.{0,18}不|开.{0,18}不) rmvb.{0,18}((无法|(没|木有)|不能|不可以).{0,18}快进|能快进.{0,18}好) (往后拉|快进).{0,18}卡 (声音|配音).{0,18}(不|(没|木有)|无法).{0,18}(同步|一起|一致) i视频.{0,18}(删除|删了|卸了|卸载).{0,18}(恢复|回复|找回|找到) (隐藏|隐私).{0,18}(哪|怎么找|找不到));
$mergeArray[22]=@KeywordsiVideoSecond;
#---------------------------------
#音频 音质.{0,18}(不|无法)好|音质.{0,18}差|音质.{0,18}(不|无法)行
my @KeywordsAudioSecond = qw(音质.{0,18}(不.{0,18}好|不行|不对|差|烂|搓|一般般)|音质.{0,18}优化|(声|音).{0,18}不好|音质.{0,18}有问题 (声|音).{0,5}大 听筒.{0,18}((没|木有)|无).{0,18}(声|音) 话筒.{0,18}(无|(没|木有)|不).{0,18}(声|音) 杂音|噪音|澡音|燥音|滋滋.{0,18}(声|音)|吱吱.{0,18}(声|音)|破声|破音|刺耳|爆音 外放 扬声器.{0,18}无(声|音)|扬声器.{0,18}((没|木有)).{0,18}(声|音) 电波 mov.{0,18}(没|木有).{0,18}(声|音)|mov.{0,18}无(声|音) 耳机.{0,18}(杂音|噪音|澡音|燥音|滋滋) ((没|木有)|无).{0,18}低音 听筒.{0,18}声.{0,18}小 喇叭.{0,18}噪音|喇叭.{0,18}澡音|喇叭.{0,18}澡音 多媒体.{0,18}((没|木有)|无).{0,18}(声|音)|多媒体.{0,18}(声|音).{0,18}((没|木有)|无) (通话|电话|接听).{0,18}((声|听着).{0,18}(小|轻)|音.{0,18}(小|轻)|小.{0,18}声) ((通话|电话|接听|通話).{0,18}((无|(没|木有)|不).{0,18}(声|音|聲))|(听不见|聽不到))|听不.{0,18}对方|(通话|电话|接听|通話).{0,18}(听.{0,18}不.{0,18}清|不清楚|聽不到)|听.{0,18}不.{0,18}清.{0,18}(通话|电话|接听|通話) (声|音).{0,18}小|好小声 时有时无|飘忽 ((没|木有)|无).{0,18}(声|音) 耳机.{0,18}(两边|两侧).{0,18}不.{0,18}(同|一样) (通话|电话).{0,18}(飘忽|断断续续|时有时无) (通话|电话|来电).{0,18}(对方|别人).{0,18}不清 开.{0,18}关.{0,18}机.{0,18}((没|木有)|无).{0,18}(声|音) 耳机.{0,18}(无|(没|木有)|不).{0,18}((音量.{0,18}调节)|(调节.{0,18}音量)) (听筒|听简).{0,18}(声|音).{0,18}(小|轻) (((自动|自己).{0,18}(声|音))|((声|音).{0,18}(自动|自己))).{0,18}(调|到).{0,18}最高 喇叭.{0,18}((没|木有)|不).{0,18}(声|音) 重.{0,18}低.{0,18}音.{0,18}不 (铃声|铃音|响铃).{0,18}渐强.{0,18}(无效|失灵|不.{0,18}行|不.{0,18}灵|(没|木有).{0,18}用) (听见|有).{0,18}男声|(听见|有).{0,18}女声 (视频|电视|电影|电视剧).{0,18}快进.{0,18}(滋|咔咔|杂).{0,18}(声|音) 媒体.{0,18}音量.{0,18}小|媒体.{0,18}音量.{0,18}加.{0,18}不.{0,18}上 耳机.{0,18}(1|一).{0,18}(响|不响|无.{0,18}声|(没|木有).{0,18}声|发.{0,18}声) 语音.{0,18}问题 (通话|电话).{0,18}(吱吱|滋滋|干扰).{0,18}(声|音) (声|音).{0,18}从.{0,18}听筒.{0,18}不.{0,18}喇叭|听筒.{0,18}发声 扬声器.{0,18}(不|无法|(没|木有)).{0,18}(开启|打开) hifi.{0,18}高音.{0,18}齿音 (不|无法).{0,18}发.{0,18}语音 SRS.{0,18}低音 蓝牙.{0,18}(声|音).{0,18}延 耳机.{0,18}(仍|还).{0,18}显示|没插.{0,18}耳机.{0,18}连接 音效.{0,18}(不能|不可以|没法|无法).{0,18}调|(不能|不可以|没法|无法).{0,18}调.{0,18}音效 静音模式.{0,18}(没有了|没了|找不到) 短信.{0.18}(暴|爆)音 媒体.{0,18}音量调节.{0,18}(有时|偶尔)(失效|无效|没用));
$mergeArray[23]=@KeywordsAudioSecond;
#---------------------------------
#i管家
my @KeywordsiGuardSecond = qw(通话.{0,18}拦截|拦截.{0,18}号码 短信.{0,18}拦截|拦截.{0,18}号码 一键.{0,18}关|一键.{0,18}全退 一键.{0,18}关|一键.{0,18}全退 白名单.{0,18}((没|木有)用|错误|失效|无效|失去|((不|无法).{0,18}见)) 黑名单.{0,18}((没|木有)用|错误|失效|无效|失去|((不|无法).{0,18}见)) 超级省电.{0,18}(无效|(没|木有)效|不行|失效|进不去) 软件卸载.{0,18}(无效|(没|木有)|不|失效) root.{0,18}权限 i管家.{0,18}(打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|不.{0,18}运行)|(打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|不.{0,18}运行).{0,18}i管家 下载.{0,18}SD.{0,18}异常 空间清理.{0,18}无效|空间清理.{0,18}(不|无法).{0,18}成功|空间清理.{0,18}(不|无法).{0,18}行 限.{0,18}网.{0,18}(不行|无效|失败|(没|木有)效果|不灵) ((自.{0,18}启)|(开机.{0,18}启动)).{0,18}(禁|关闭)|(禁|关闭).{0,18}((自.{0,18}启)|(开机.{0,18}启动)) 超级省电.{0,18}((能.{0,18}上.{0,18}网)|(网络.{0,18}启动)) (弹|出现).{0,18}广告 (无|(没|木有)).{0,18}网购保护 系统.{0,18}缓存.{0,18}删 i管家.{0,18}(能|可以).{0,18}(删|卸载).{0,18}吗|(能|可以).{0,18}(删|卸载).{0,18}i管家.{0,18}吗 一键加速.{0,18}时间.{0,18}长 内存清理.{0,18}返回.{0,18}桌面 (不能|不可以|无法|没法).{0,18}(藏|隐藏).{0,18}(圖片|图片));
$mergeArray[24]=@KeywordsiGuardSecond;
#---------------------------------
#浏览器
my @KeywordsBrowserSecond = qw((不|无法)缓存图片 下载.{0,18}提示.{0,18}退出.{0,18}失灵 连接.{0,18}失败 图片.{0,18}模糊 无痕.{0,18}浏览 (不|无法).{0,18}下载图片 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 网.{0,18}慢 不.{0,18}(断点|断网).{0,18}(续传|下载) (不|无法).{0,18}显示.{0,18}图|图.{0,18}(不|无法).{0,18}显示 (出|报).{0,18}错 (自己|自动).{0,18}下载 (不能|不可以|不行|不支持|没法|无法|不能支持).{0,18}中文 不.{0,18}COOkie);
$mergeArray[25]=@KeywordsBrowserSecond;
#---------------------------------
#软件商店
my @KeywordsAppStoreSecond = qw(关不.{0,18}(自动开|自.{0,18}启)|总.{0,18}运行 停止通知 自.{0,18}启 恶心 (不|无法).{0,18}安装 打.{0,18}(不开|无法)|(进|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|用不了 清.{0,18}缓存.{0,18}一直.{0,18}加载|清.{0,18}缓存.{0,18}一直.{0,18}载入 更新.{0,18}不.{0,18}软件|不.{0,18}更新.{0,18}软件 (下载好|下载完).{0,18}(不|(没|木有)).{0,18}显示.{0,18}下载|(下载好|下载完).{0,18}显示.{0,18}(不|(没|木有)).{0,18}下载 后台 下载.{0,18}(停|不下) (应用.{0,18}下载|下载.{0,18}应用).{0,18}(失效|失败|不.{0,18}成功) (开启|打开).{0,18}商店.{0,18}白屏);
$mergeArray[26]=@KeywordsAppStoreSecond;
#---------------------------------
#状态栏
my @KeywordsStatusBarSecond = qw(快捷操作.{0,18}按钮.{0,18}(少|不.{0,18}多) ((没|木有)).{0,18}电量.{0,18}显示|电量.{0,18}百分比|电量.{0,18}百分百|电量.{0,18}现实|百分数.{0,18}显示|百分比.{0,18}电量|电池.{0,18}百分比|電量顯示|电源百分比|显示电量.{0,18}哪|显示.{0,18}电量|电量.{0,18}显示 底部.{0,18}阴线 阴阳屏 长按.{0,18}HOME GPS.{0,18}显示 下.{0,18}拉上.{0,18}(不|无法) 下滑.{0,18}(不|无法) 顶部.{0,18}(没|木有).{0,18}快捷开关|顶部.{0,18}无.{0,18}快捷开关 全屏.{0,18}(不|无法).{0,18}拉 游戏.{0,18}(不|无法).{0,18}(下拉|拉下)|游戏.{0,18}(下拉|拉下).{0,18}就好 (无|((没|木有))).{0,18}竖屏.{0,18}锁定|自动旋转屏幕|关.{0,18}横屏|关闭.{0,18}屏幕.{0,18}旋转|转屏|竖屏锁定|移动旋转|横竖切换|切换横屏|关闭横屏|屏幕旋转|取消横屏|重力感应|设置横屏 单手模式.{0,18}(不.{0,18}方便|麻烦|困难) 网络.{0,18}显示.{0,18}不.{0,18}(准确|精确)|流量.{0,18}显示.{0,18}不 上拉.{0,18}太.{0,18}灵敏 应用.{0,18}颜色.{0,18}变 下拉.{0,18}悬停 自动.{0,18}横屏|竖屏.{0,18}无效 快捷方式 (没|找不到|添加).{0,18}(开|关)机.{0,18}(图标|快捷)|(加回|添加).{0,18}(开|关)机 (图标|标志).{0,18}… (横屏|横着).{0,18}上滑.{0,18}关闭.{0,18}(应用|程序) 上拉.{0,18}闪 通知栏.{0,18}(丑|难看|简陋|不好看));
$mergeArray[27]=@KeywordsStatusBarSecond;
#---------------------------------
#联系人
my @KeywordsContactSecond = qw((不|无法).{0,18}显示.{0,18}联系人|无法.{0,18}显示.{0,18}联系人|显示.{0,18}不 人名.{0,18}查询.{0,18}不.{0,18}出|拼音.{0,18}汉字|搜.{0,18}不|不.{0,18}搜|搜.{0,18}失效 忽多忽少 全屏.{0,18}手写.{0,18}显示 查询.{0,18}号码 (姓名|人名).{0,18}(排序|顺序).{0,18}乱 (不|无法).{0,18}支持.{0,18}蓝牙.{0,18}导入 (谷歌|google)服务.{0,18}删除|(谷歌|google)服务.{0,18}不|不.{0,18}支持.{0,18}(谷歌|google)服务|((没|木有)).{0,18}(谷歌|google)服务 号码.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 联系人.{0,18}总.{0,18}更新|联系人.{0,18}一直.{0,18}更新 打.{0,18}不开|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 关机.{0,18}SIM.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 图标.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) (联系人|通讯录).{0,18}(不|无法).{0,18}(拨|打) (不|无法).{0,18}(显示.{0,18}全部|全部.{0,18}显示)|读取.{0,18}不出 (联系人|号码|人名|通讯录).{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见|(没|木有)了|变.{0,18}空白) (不|无法).{0,18}编辑 (不|无法).{0,18}批量 (不能|无法|(没|木有)|不行|不可以|怎么|如何|怎样).{0,18}加.{0,18}联系人|加.{0,18}联系人.{0,18}((没|木有)|不行|不可以|无效|(没|木有)效) 职位|职等|职级 (删.{0,18}(联系人|电话本)|(联系人|电话本).{0,18}删).{0,18}(云服务|云备份).{0,18}删 联系人.{0,18}(不能|没法|无法).{0,18}云端.{0,18}同步);
$mergeArray[28]=@KeywordsContactSecond;
#---------------------------------
#短信
my @KeywordsMMSSecond = qw((收|接).{0,18}不|(不|无法).{0,18}(收|接) 发.{0,18}(不|失败)|(无法|不).{0,18}发 悬浮多任务 延迟|延后 (不|无法).{0,18}批量.{0,18}删除 读.{0,18}不|(无法|不).{0,18}读 自动亮屏.{0,18}短信.{0,18}关闭.{0,18}提示 重复.{0,18}(接受|接收|收到)|(同一条|一样的|相同的|同样).{0,18}收|短信.{0,18}重复 自动.{0,18}发.{0,18}两 (无|(没|木有)).{0,18}短信气泡|短信气泡.{0,18}(无|(没|木有)) 短信.{0,18}铃声.{0,18}(没|木有)|无.{0,18}短信.{0,18}铃声|短信.{0,18}铃声.{0,18}不 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 短信.{0,18}键盘|(输入|写字|打字).{0,18}((没|木有)|无).{0,18}反应|点.{0,18}多次.{0,18}输入法 (排序|顺序).{0,18}(不|乱) 彩信.{0,18}((发.{0,18}不)|((不|无法).{0,18}发))|((发.{0,18}不)|((不|无法).{0,18}发)).{0,18}彩信 彩信.{0,18}(不|无法).{0,18}下载|(不|无法).{0,18}下载.{0,18}彩信 发.{0,18}短信.{0,18}(迟缓|慢) 图标.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 短信.{0,18}读.{0,18}图标.{0,18}(在|(没|木有)读) (怎么|如何).{0,18}关.{0,18}语音播报 短信.{0,18}提示.{0,18}(声|音) 设.{0,18}背景|背景.{0,18}设 短信备份.{0,18}删除|删除.{0,18}短信备份 (接|收).{0,18}慢 短信.{0,18}(6|5|六|五)行.{0,18});
$mergeArray[29]=@KeywordsMMSSecond;
#---------------------------------
#电子邮件
my @KeywordsEmailSecond = qw((不|无法).{0,18}粘贴.{0,18}邮件地址 (不|无法).{0,18}同步.{0,18}自动.{0,18}删除 打不开.{0,18}附.{0,18}xls  打不开.{0,18}附件 收件.{0,18}(不|无法).{0,18}(粘贴|黏贴) 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 (不|无法).{0,18}设置 gmail.{0,18}(exchange.{0,18}(连|联).{0,18}不|不.{0,18}(连|联).{0,18}exchange) 不.{0,18}刷新|刷新.{0,18}(不|失败) 收件箱.{0,18}(不能|不可以|无法|(没|木有)).{0,18}下拉.{0,18}收.{0,18}邮件);
$mergeArray[30]=@KeywordsEmailSecond;
#---------------------------------
#文件管理
my @KeywordsFileManagerSecond = qw(文件夹.{0,18}大小排列 内存显示|显示内存|内存.{0,18}G.{0,18}G (不|(没|木有)|无法).{0,18}左.{0,18}右.{0,18}滑 ((没|木有)|无).{0,18}(批操作|批处理|批删除) 存储模式.{0,18}(不可用|不能用|不行|无效|((没|木有))效|失效|不可使用|退出)|退出.{0,18}存储模式 (不|没有).{0,18}(连接|联接)电脑.{0,18}存储模式);
$mergeArray[31]=@KeywordsFileManagerSecond;
#---------------------------------
#输入法
my @KeywordsIMESecond = qw((不|无法).{0,18}连续.{0,18}(输入|写).{0,18}英文|无法.{0,18}连续.{0,18}(输入|写).{0,18}英文 隐私信息.{0,18}无法.{0,18}(输入|写)|隐私信息.{0,18}(不|无法).{0,18}(输入|写|打) 中英.{0,18}转换.{0,18}状态 插入.{0,18}充电器.{0,18}键盘.{0,18}失灵 字体.{0,18}小 ((没|木有)|无).{0,18}清除功能 夜间模式 输入法.{0,18}错.{0,18}字 切换.{0,18}第三方|(不|无法).{0,18}用.{0,18}第三方|(不|无法).{0,18}搜狗.{0,18}输入法|(不|无法).{0,18}百度.{0,18}输入法|切换.{0,18}搜狗|切换.{0,18}百度.{0,18}输入法 (输入法|键盘).{0,18}用(不|无法)了|(输入法|键盘).{0,18}点.{0,18}(不|无法)|隐藏|不灵|不见|不能用 联想.{0,18}(差|不好|不行) 文字.{0,18}输入|打不出字 数学符.{0,18}(乘号|除号) ((没|木有)|无).{0,18}云输入 (经常|偶尔|有时|老是|总是).{0,18}(切.{0,18}回|跳.{0,18}回) 支付宝.{0,18}兼容|兼容.{0,18}支付宝 皮肤.{0,18}换|换.{0,18}肤 字母乱跳|乱跳字母);
$mergeArray[32]=@KeywordsIMESecond;
#---------------------------------
#天气预报
my @KeywordsWeatherSecond = qw(((没|木有)|无).{0,18}语音 (不|无法).{0,18}准|(没|木有)谱|早了|晚了 (不|无法).{0,18}(更新|刷新).{0,18}数据|数据.{0,18}刷新不 天气.{0,18}定位.{0,18}(异常|(无法|不能).{0,18}更新) 天气.{0,18}无.{0,18}.{0,18}用数据 闹钟.{0,18}天气.{0,18}(地点|位置) 天气.{0,18}城市.{0,18}(删除不|(不能|无法|没法).{0,18}删));
$mergeArray[33]=@KeywordsWeatherSecond;
#---------------------------------
#便签
my @KeywordsNotesSecond = qw(云端.{0,18}同步);
$mergeArray[34]=@KeywordsNotesSecond;
#---------------------------------
#计算器
my @KeywordsCalcSecond = qw(乘号.{0,18}((没|木有)|无)|((没|木有)|无).{0,18}乘号 格式.{0,18}假 连.{0,18}(加|减|乘|除)|历史记录|记忆|连续.{0,18}(加|减|乘|除)|无.{0,18}历史记录|(没|木有).{0,18}历史记录|历史记录.{0,18}(没|木有) 悬浮 (无|(没|木有)).{0,18}双行 丑|难看|简陋|不好看);
$mergeArray[35]=@KeywordsCalcSecond;
#---------------------------------
#超超清影院
my @KeywordsCinemaSecond = qw(离线.{0,18}下载.{0,18}(无法|不|(没|木有)|无效)|(无法|不|(没|木有)).{0,18}离线.{0,18}下载 (不|无法).{0,18}全屏  蓝光.{0,18}电影 vip.{0,18}((收费|看不了)|(无法|没法|不能|不可以).{0,18}看) 高清片源.{0,18}(少|不.{0,18}给力|不.{0,18}多));
$mergeArray[36]=@KeywordsCinemaSecond;
#---------------------------------
#电子书
my @KeywordsEbookSecond = qw(打.{0,18}(不开|无法)|(进|用|开).{0,18}(不了|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|看.{0,18}不|(不|无法).{0,18}看|什么时候.{0,18}能.{0,18}看|何时.{0,18}能.{0,18}看 自己.{0,18}息屏 删除数据.{0,18}再.{0,18}使用 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|看.{0,18}不|(不|无法).{0,18}看|什么时候.{0,18}能.{0,18}看|何时.{0,18}能.{0,18}看 书签.{0,18}(无效|失败)|不.{0,18}设.{0,18}书签 图标.{0,18}(不|一样).{0,18}主题);
$mergeArray[37]=@KeywordsEbookSecond;
#---------------------------------
#网络信号
my @KeywordsNetSignalSecond = qw(差|烂|((没|木有)|无).{0,18}信号|信号.{0,18}差|连接.{0,18}差|弱|不.{0,18}稳定|不行|烂|搓|有时有.{0,18}有时(没|木有)|不好|不.{0,18}强|不.{0,18}好|收.{0,18}不|有问题|严重|(没|木有).{0,18}网|段.{0,18}信号|找不见.{0,18}网|断.{0,18}信号|收.{0,18}不|问题.{0,18}多|咔|沒.{0,18}信號|(自动|自己).{0,18}开.{0,18}关|(没|木有)了|时好时坏|联网.{0,18}断|信号.{0,18}不.{0,18}稳|不联网|丢.{0,18}信号|不给力|慢|用.{0,18}不|(没|木有)了|网.{0,18}(卡住|卡顿|不动|迟钝|迟缓)|信号.{0,18}(没|木有).{0,18}满|只有.{0,18}信号|联网|老是掉|卡住不动|信號.{0,18}差|超卡|好卡|网络异常|网页.{0,18}打不开|不.{0,18}快|网.{0,18}掉|数据连接不|改善手机信号 (不|无法).{0,18}显示 连接.{0,18}慢|网.{0,18}慢|网.{0,18}漫|连接.{0,18}漫|数据流量.{0,18}慢|GPR.{0,18}S.{0,18}慢 掉线|断线|网.{0,18}断|断.{0,18}网|不稳定|中断|(没|木有)网|突然.{0,18}掉|信号.{0,18}断|掉.{0,18}网|无法下载 无法.{0,18}连接|(不|无法).{0,18}连接|连.{0,18}(不|无法)上|打(不|无法)开|(不|无法).{0,18}上.{0,18}网|上.{0,18}(不|无法).{0,18}网|弱|(连|联).{0,18}不.{0,18}网|不正常|信号.{0,18}无|不.{0,18}用|灵敏度|不.{0,18}强|(连|联).{0,18}不.{0,18}网|(没|木有)网络|网络连接.{0,18}失败|网络错误 (不|无法).{0,18}支持.{0,18}(4G|四G)|要是.{0,18}(4G|四G).{0,18}就|(不|无法).{0,18}用.{0,18}(4G|四G) 电话.{0,18}(不|无法)|电话.{0,18}无法 (4G|四G)网.{0,18}上.{0,18}(不|无法).{0,18}(4G|四G)|(4G|四G)网.{0,18}(不|无法).{0,18}上.{0,18}(4G|四G)|(不|无法).{0,18}上.{0,18}(4G|四G)|((没|木有)|收不).{0,18}(4G|四G) 满格 (无|(没|木有)).{0,18}(2G|两G|二G) 联通.{0,18}(3G|三G) (3G|三G).{0,18}(老是|总是|经常|莫名其妙|自动|自己).{0,18}(切换|变).{0,18}(2G|两G|二G)|(3G|三G).{0,18}(不|无法)|(不|无法).{0,18}(3G|三G)|(3G|三G).{0,18}变.{0,18}(2G|两G|二G) (4G|四G).{0,18}(2G|两G|二G)|(2G|两G|二G).{0,18}(4G|四G)|(4G|四G).{0,18}差|GPRS.{0,18}4G 下载.{0,18}(慢|不) USB.{0,18}电脑.{0,18}网|USB.{0,18}共享.{0,18}网 (3G|三G).{0,18}(差|弱) (4G|四G).{0,18}香港.{0,18}(失败|不|失敗)|香港.{0,18}(不|(没|木有)|无法).{0,18}4G|香港.{0,18}(4G|四G).{0,18}(不|(没|木有)|无法) 打开.{0,18}(无|(没|木有)|不).{0,18}右上.{0,18}显示 不.{0,18}联通.{0,18}4G (能|可以|是否).{0,18}(支持|用).{0,18}4G|(支持|用).{0,18}4G.{0,18}吗|是4G.{0,18}吗|怎么.{0,18}4G 歌.{0,18}下载.{0,18}一半 (大陆.{0,18}香港|香港.{0,18}大陆).{0,18}不 (不能|不可以|无法|(没|木有)|没法).{0,18}(显示|读取).{0,18}sim卡|显示.{0,18}(无|没).{0,18}sim卡|sim卡不可用|sim卡不能用|无SIM|sim卡.{0,18}识别|识别.{0,18}SIM卡 3G.{0,18}(显示|现实|却是).{0,18}2G 联通);
$mergeArray[38]=@KeywordsNetSignalSecond;
#---------------------------------
#wifi
my @KeywordsWifiSecond = qw(差|烂|(((没|木有))|无).{0,18}信号|信号.{0,18}差|连接.{0,18}差|弱|不.{0,18}稳定|不行|烂|搓|有时有.{0,18}有时((没|木有))|不好|不.{0,18}强|不.{0,18}好|收.{0,18}不|有问题|严重|((没|木有)).{0,18}网|段.{0,18}信号|找不见.{0,18}网|断.{0,18}信号|收.{0,18}不|问题.{0,18}多|咔|沒.{0,18}信號|(自动|自己).{0,18}开.{0,18}关|((没|木有))了|时好时坏|联网.{0,18}断|信号.{0,18}不.{0,18}稳|不联网|丢.{0,18}信号|不给力|慢|用.{0,18}不|((没|木有))了|网.{0,18}(卡住|卡顿|不动|迟钝|迟缓)|信号.{0,18}((没|木有)).{0,18}满|只有.{0,18}信号|联网|老是掉|卡住不动|信號.{0,18}差|超卡|好卡|网络异常|网页.{0,18}打不开|不.{0,18}快|连接.{0,18}慢 网络.{0,18}慢|(无|(没|木有)).{0,18}网速 连.{0,18}(不|无法)|搜.{0,18}不.{0,18}热点|用不了|上不了|无法连接 中断.{0,18}掉线|断 打(不|无法)开|进(不|无法)去|无法使用|(不|无法).{0,18}用|(不|无法).{0,18}开 满格 ((加载.{0,18}图片)|(图片.{0,18}加载)).{0,18}(慢|迟钝|卡) ((没|木有)|无).{0,18}5G);
$mergeArray[39]=@KeywordsWifiSecond;
#---------------------------------
#GPS
my @KeywordsGpsSecond = qw(定位.{0,18}慢|搜索.{0,18}慢 (不|无法)准|不好|差|烂|搓|垃圾|不.{0,18}行 (不|无法).{0,18}定位|无法.{0,18}定位|定位.{0,18}(不|无法)了|定位.{0,18}((没|木有))用|定位.{0,18}(失败|不.{0,18}成功)|((没|木有))作用|(不|无法).{0,18}成功|(不|无法).{0,18}接收|用不了|((没|木有)).{0,18}用|((没|木有)).{0,18}反应|定不出 搜.{0,18}星.{0,18}慢 实景导航.{0,18}出.{0,18}错 AR.{0,18}navi.{0,18}(不准|不精确|不行|有问题|不可用|定位不));
$mergeArray[40]=@KeywordsGpsSecond;
#---------------------------------
#蓝牙
my @KeywordsBluetoothSecond = qw(蓝牙耳机.{0,18}(不|无法).{0,18}(连|联)|(连|联).{0,18}不.{0,18}蓝牙耳机 蓝牙鼠标.{0,18}无法.{0,18}配对|蓝牙鼠标.{0,18}(不|无法).{0,18}配对 收.{0,18}不.{0,18}设备|搜.{0,18}不.{0,18}设备 (不|无法).{0,18}(听|放|播).{0,18}(歌|音乐) 车上.{0,18}蓝牙|车载.{0,18}蓝牙 车载系统 连.{0,18}(不|无法).{0,18}上|无法连接|(不|无法).{0,18}连接|不.{0,18}匹配打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 耳机.{0,18}(不|无法).{0,18}搜索|耳机.{0,18}搜索.{0,18}不 (不|无法).{0,18}(听|放|播).{0,18}(歌|音乐) 车.{0,18}导航 蓝牙耳机.{0,18}(无法|不).{0,18}智能声控|(无法|不).{0,18}蓝牙耳.{0,18}智能声控 蓝牙.{0,18}耳机.{0,18}(怎么|如何).{0,18}用|(怎么|如何).{0,18}用.{0,18}蓝牙.{0,18}耳机 (蓝牙.{0,18}(关闭|关了)|(关闭|关了).{0,18}蓝牙).{0,18}(还|仍然|依然|依旧).{0,18}(显示|现实) 蓝牙.{0,18}(哪|找不到) (没有|没了).{0,18}智能声控);
$mergeArray[41]=@KeywordsBluetoothSecond;
#---------------------------------
#指纹
my @KeywordsFingerprintSecond = qw((解锁|识别|指纹).{0,18}(无法|不|次|失败|失效|((没|木有)).{0,18}(作用|效果)|难.{0,18}识别)|优化|吹牛|差|((没|木有)).{0,18}反应|灵敏度|不灵 (不|无法)会用|怎么用|不会弄|(不能|不行|不可以|((没|木有))|没法|无法|((没|木有))办法).{0.12}解锁 能不能用|能用吗|有吗);
$mergeArray[42]=@KeywordsFingerprintSecond;
#---------------------------------
#OTG
my @KeywordsOTGSecond = qw(无法.{0,18}用|(不|无法).{0,18}用 OTG.{0,18}64G.{0,18}USB.{0,18}损坏 鼠标.{0,18}((没|木有)|无|不).{0,18}键盘 OTG.{0,18}(连.{0,18}不|无响应|无反应));
$mergeArray[43]=@KeywordsOTGSecond;
#---------------------------------
#智能体感
my @KeywordsSmartSecond = qw(摇一摇.{0,18}手电 智能窗口.{0,18}接.{0,18}电话 智能接听|智能通话 智能体感 (双击亮屏|双击触屏|双点屏幕).{0,18}(不|无法).{0,18}亮|(双击亮屏|双击触屏|双点屏幕).{0,18}(无效|废了|失灵|失效|((没|木有))效|不太准)|双击.{0,18}唤醒.{0,18}(无效|废了|失灵|失效|((没|木有))效)|双击.{0,18}(无法|不).{0,18}唤醒|双击.{0,18}唤.{0,18}不 智能亮屏 (划|画|滑).{0,18}o (划|画|滑).{0,18}m (划|画|滑).{0,18}w 智能感应 手套模式 喚醒 熄屏手势 智能唤醒 多屏互动 隔空 语音唤醒 上划.{0,18}解屏.{0,18}(不|无法)|上滑.{0,18}解锁.{0,18}(不|无法) 双击.{0,18}亮.{0,18}屏.{0,18}(不好用|不灵敏)|双击.{0,18}屏.{0,18}亮.{0,18}(没|木有).{0,18}反应|双击.{0,18}((不.{0,18}亮)|(亮.{0,18}不)|(开.{0,18}不.{0,18}屏)|(不.{0,18}灵)) Air.{0,18}wake.{0,18}(识别|成功|辨别).{0,18}(低|不高|差|不行)|Air.{0,18}wake.{0,18}(不管用|用不了) 摇一摇.{0,18}(失灵|(没|木有)反应|无反应) (保护盖|保护套|手机套).{0,18}亮屏.{0,18}(失效|不.{0,18}灵) 声控接听.{0,18}(无效|不) 智能暂停.{0,18}不.{0,18}灵 双击亮屏.{0,18}黑框 智能拨号.{0,18}怎么.{0,18}(变回|关) (smart.{0,18}wake|smark.{0,18}wake).{0,18}(程序|应用|不.{0,18}(灵|敏感)|不管用) 语音.{0,18}接听.{0,18}(无效|不|无法|(没|木有).{0,18}用) 语音.{0,18}挂断.{0,18}(无效|不|无法|(没|木有).{0,18}用) (双击.{0,18}唤醒|双击.{0,18}亮屏).{0,18}(挂.{0,18}电话|(打|通).{0,18}完.{0,18}电话)|(挂.{0,18}电话|(打|通).{0,18}完.{0,18}电话).{0,18}(双击.{0,18}唤醒|双击.{0,18}亮屏) 手势拨号.{0,18}(无法|没法|不能).{0,18}用);
$mergeArray[44]=@KeywordsSmartSecond;
#---------------------------------
#流量监控
my @KeywordsFlowrateSecond = qw(每月.{0,18}清零 不准);
$mergeArray[45]=@KeywordsFlowrateSecond;
#---------------------------------
#时间(不|无法)准
my @KeywordsTimeSecond = qw(时钟.{0,8}慢|时钟.{0,18}(不|无法).{0,18}准|时间.{0,8}慢|时间.{0,18}(不|无法).{0,18}准|自动对时.{0,18}(不|无法).{0,18}准|时间.{0,18}(不|无法).{0,18}对|时间.{0,18}错|时问.{0,18}慢|(时间|日期).{0,18}自动修改|日期.{0,18}不相符 开.{0,18}网络.{0,18}(无法|不).{0,18}对时 自动对时.{0,18}(不准|失败));
$mergeArray[46]=@KeywordsTimeSecond;
#---------------------------------
#账号
my @KeywordsAccountSecond = qw((谷歌|google).{0,18}(帐号|账户|帐户|账号) 游戏.{0,18}帐号 账户名.{0,18}显示 密码.{0,18}找.{0,18}回|找.{0,18}回.{0,18}密码|(账户|密码).{0,18}哪.{0,18}找 (账号|账户|帐号|帐户).{0,18}((忘.{0,18}密码)|(密码.{0,18}忘))|不记得|(忘.{0,18}密码)|(密码.{0,18}忘)|密码.{0,18}改.{0,18}不|不.{0,18}知道.{0,18}密码 注册.{0,18}不|不.{0,18}注册);
$mergeArray[47]=@KeywordsAccountSecond;
#---------------------------------
#小屏
my @KeywordsMiniscreenSecond = qw(小屏.{0,18}(没|木有).{0,18}大屏 (不|无法).{0,18}调.{0,18}大.{0,18}小 (关|(设置.{0,18}不)).{0,18}小屏.{0,18}小屏.{0,18}(出|开) 悬浮.{0,18}(无|(没|木有)|不).{0,18}小屏|(无|(没|木有)|不).{0,18}悬浮.{0,18}小屏 悬浮窗.{0,18}调.{0,18}大小 (滑出|划出).{0,18}概率.{0,18}(低|不高)|(((没|木有))|无).{0,18}小屏 (怎么|如何).{0,18}(打开|开启|进入|操作|调开|调出));
$mergeArray[48]=@KeywordsMiniscreenSecond;
#---------------------------------
#游戏
@KeywordsGameSecond = qw(亮.{0,18}暗|暗.{0,18}亮|亮度.{0,18}不.{0,18}平衡|忽明忽暗|忽暗忽明 游戏.{0,18}退.{0,18}屏.{0,18}黑 (不|无法).{0,18}安装 (谷歌|google).{0,18}兼容 使命召唤 神秘之剑 汤姆猫 天天风之旋 火线指令 崩坏学院|崩坏学园 海岛奇兵 小小帝国 暖暖环游世界 刀塔传奇 开心消消乐 狂野飙车 放开那三国 葡萄游戏厅 布丁怪兽 游戏 极品飞车 酷跑 飞机 时空猎人 爱消除 天天 格斗 背刺 全民 地主 神魔 飞车 节奏大师 僵尸 麻将 时空腊人 梦幻西游 红警 侠盗 nba 剑魂之刃 雷霆战机 无尽之剑 部落战争 我的世界 小黄人快跑 小黄人 消灭星星 斗地主 史上最难的游戏 求合体 神将传奇 刀塔世界 国际足球大联盟 准游泳 真实赛车3 三国杀 雷霆 智龙迷城 天天酷跑 电魂统军令 部落冲突 时空猎人 天天风之旅 疯狂猜成语2 迷你帝国 酷酷爱魔兽);
$mergeArray[49]=@KeywordsGameSecond;
#---------------------------------
#第三方
@Keywords3PartySecond = qw(金山快盘 煲汤大全 中华万年历 方正行书 facebook 雅思听力宝 老虎地图 谷歌电子市场|谷歌电子商店 谷歌服务 谷歌键盘 合地图 乐视 导航犬 扣扣 qq 微信 腾讯 陌陌 旺信 微话 影院 迅雷看看 YY语音 土豆 酷狗 快牙 新浪 银行 证券 网易 搜狗 唱吧|IMAC 京东 google.{0,18}play 美拍 阿里通 墨迹 天天动听 中国象棋 ireader 银河玖乐 爱奇艺 PPTV 百度 搜狐 象棋 暴风 DIY主题大师 掌阅 淘宝 优酷 360 糗事百科 迅雷 微博 滴滴打车 谷歌地球 360相机 美颜相机 美人相机 es文件浏览器 铁友火车票软件 掌上猫扑 UC浏览 别踩白块 91助手 豌豆荚 建行客户端|建行手机支付 酷我音乐 皮皮 小影 支付宝钱包 京东商城 谷歌商店 play商店 炫耀字体 潮百搭 悠悠导航 天气通 cntv wifi万能钥匙|wife万能|wifi万能|wifi万能解锁 百度视频 高德 建设银行 梦森林 芒果tv wifi伴侣 谷歌市场 钱盒商户通 音悦台);
$mergeArray[50]=@Keywords3PartySecond;
#---------------------------------
#云服务
my @KeywordsCloudServiceSecond = qw(密码.{0,18}丢|密码.{0,18}忘|忘.{0,18}密码|丢.{0,18}密码 打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}用|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|启动报错|用不了|无法启动 云备份.{0,18}(不|无法).{0,18}备份.{0,18}相册 云备份.{0,18}(还原|恢复).{0,18}(失败|故障|不成功) 云备份.{0,18}(失败|不成功|失效));
$mergeArray[51]=@KeywordsCloudServiceSecond;
#---------------------------------
#充电
my @KeywordsChargeSecond = qw((充|冲|).{0,18}(慢|几.{0,18}小时)|(一|1).{0,18}(夜|晚上).{0,18}(充|冲)|充电.{0,18}消失|充.{0,18}電.{0,18}只有|充电.{0,18}%.{0,18}还是% 充.{0,18}不.{0,18}满|无法.{0,18}充满|(没|木有).{0,18}充满|99%|只能.{0,18}充 屏幕.{0,18}(常|一直).{0,18}亮 充电器.{0,18}拔.{0,18}显示 满.{0,18}(没|木有).{0,18}提示|满.{0,18}无.{0,18}提示|满.{0,18}提示.{0,18}(没|木有)|((没|木有)|无).{0,18}满.{0,18}提示|完成.{0,18}((没|木有)|无).{0,18}提示|充满电.{0,18}提示音 (充电.{0,18}拔|拔.{0,18}充电).{0,18}显示 电.{0,18}满.{0,18}在.{0,18}充电|电.{0,18}饱.{0,18}在.{0,18}充电 充电.{0,18}异常 (充|冲).{0,18}(不了|不进|不起|不尽)|(不能|无法|没法)充 漏电 断电|停止|停掉|不.{0,6}充了 (充电.{0,18}满|(没|木有).{0,18}充电).{0,18}指示.{0,18}灯.{0,18}(亮|闪烁) 关机.{0,18}(自动.{0,18}开机|自.{0,18}启) 拔.{0,18}(无|(没|木有)).{0,18}提示.{0,18}(声|音) (无法|不).{0,18}(移动电源|充电宝).{0,18}充电 充.{0,18}满.{0,18}只.{0,18}显示 插.{0,18}数据线.{0,18}漏电 充电.{0,18}进.{0,18}存储模式 充电.{0,18}绿);
$mergeArray[52]=@KeywordsChargeSecond;
#---------------------------------
#截屏
my @KeywordsScreenShotSecond = qw(摇动手机.{0,18}(不|无法).{0,18}截屏|摇动手机.{0,18}无法.{0,18}截屏 ((没|木有)|要是|怎|如何|(没{0,18}法)|无法|能够).{0,18}(截图|截屏|截圖|捕捉屏幕)|(截图|截屏|截圖|捕捉屏幕).{0,18}(方法|办法|怎|如何|是哪个)|(增|加|快弄个).{0,18}(截屏|截图|截圖|捕捉屏幕)|不.{0,18}截|截.{0,18}不|无法.{0,18}用|截屏键是哪个|咋截|(没|木有).{0,18}截图|怎么.{0,18}截|截不了图|有截屏 白屏|白图|空白 (截屏|截图|載屏|載图|截圖).{0,18}画质.{0,18}低 此图已截);
$mergeArray[53]=@KeywordsScreenShotSecond;
#---------------------------------
#闹钟
my @KeywordsAlarmSecond = qw((无|(没|木有)|不).{0,18}(语音|播报)|(语音|播报).{0,18}(不行|不.{0,18}(播|放)|失效|无法|坏|(没|木有)|失灵)|(语音|播报).{0,18}(不|无法).{0,18}播报 无.{0,18}天气数据|(没|木有).{0,18}天气数据|天气预报.{0,18}(不|无法)|不.{0,18}天气 开机.{0,18}(不|无法).{0,18}自.{0,18}启 画.{0,18}(不|无法).{0,18}显示 自选铃声.{0,18}响铃.{0,18}短|(铃声|响铃).{0,18}(短|歌.{0,18}(完|结束))|分钟 正点.{0,18}闹钟.{0,18}(不|无法)会报时 闹钟铃声.{0,18}小 不响|不闹|响.{0,18}响 贪睡.{0,18}怎么.{0,18}(关|弄掉) (怎么|如何|独立|单独|不能|不可以|无法|没法).{0,18}(调|设置).{0,18}(声|音) (铃声|闹铃|响铃).{0,18}(选择|自选|自定义) 语音播报.{0,18}(声|音).{0,18}(不能|不可以|(没|木有)|没法|无法|怎么|怎样|如何).{0,18}调 闹钟.{0,18}(((不|无法).{0,18}用)|(打.{0,18}不开)|(用不了)|(启动不起)|((不|无法).{0,18}启动)|(运行不)|(进不去)|(无法打开)|不能打开|(打.{0,18}(不|无法))|(进.{0,18}不)|禁止运行)|(((不|无法).{0,18}用)|(打.{0,18}不开)|(用不了)|(启动不起)|((不|无法).{0,18}(启动|运行))|(运行不)|(进不去)|(无法打开)|不能打开|(打.{0,18}(不|无法))|(进.{0,18}不)|不能玩|禁止运行).{0,18}闹钟 闹钟.(0,18)(语音|播报).{0,18}开 闹钟.{0,18}自动关闭);
$mergeArray[54]=@KeywordsAlarmSecond;
#---------------------------------
#PHOTO+
my @KeywordsPhotojiaSecond = qw(((不|无法)|删除).{0,18}重新.{0,18}安装|删.{0,18}(下载|安装)|哪.{0,18}下載 像素.{0,18}低 跳.{0,18}加载 无法.{0,18}编辑|(不|无法).{0,18}编辑 (不|无法).{0,18}用摩棒|无法.{0,18}用摩棒 录视频.{0,18}剪切 photo.{0,18}一直.{0,18}数据连接|photo.{0,18}老.{0,18}数据连接 使用不了|打不开|进不去|无法使用|(不|无法).{0,18}用|功能不|用不了|用不起 上传.{0,18}(不|失败)|(不|无法).{0,18}上传 卸载.{0,18}恢复 视频.{0,18}自动.{0,18}删除|自动.{0,18}删除.{0,18}视频 (软件商店|应用商店).{0,18}((没|木有)|无).{0,18}photo\+ 不.{0,18}支持.{0,18}100M.{0,18}视频 photo\+.{0,18}视频.{0,18}(不能|无法|不可以|(没|木有))(保存|存储|储存|存到));
$mergeArray[55]=@KeywordsPhotojiaSecond;
#---------------------------------
#I主题
my @KeywordsiThemeSecond = qw(主题.{0,18}少|更多|不.{0,18}丰富|新.{0,18}主题|增加.{0,18}主题|能.{0,18}多|多.{0,18}点主题 (没|木有).{0,18}分类|无.{0,18}分类 更新.{0,18}慢 丑 图片.{0,18}打开.{0,18}慢 按键.{0,18}(不|无法).{0,18}返回 切换.{0,18}不|(不|无法).{0,18}切换|(不|无法).{0,18}退出|删.{0,18}不|不.{0,18}删|回到|恢复到|换不回|换回来 (汉字|汉子).{0,18}字体.{0,18}(不|无法|只能).{0,18}(汉字|汉子).{0,18}字体 全局主题.{0,18}(不.{0,18}更新|少)|多.{0,18}全局主题|说好的.{0,18}全局主题|在.{0,18}多|再.{0,18}多|只.{0,18}一个.{0,18}全局主题 壁纸.{0,18}加载.{0,18}慢 原.{0,18}(无法|不).{0,18}恢复 (不|无法).{0,18}(同步.{0,18}通话记录|通话记录.{0,18}同步) 简约风.{0,18}(((没|木有))|找不到|消失) (不能|无法|没法|不可以).{0,18}下载.{0,18}.主题|主题.{0,18}(不能|无法|没法|不可以).{0,18}下载 (不能|无法|没法|不可以).{0,18}(连接|链接|联接)在线);
$mergeArray[56]=@KeywordsiThemeSecond;
#---------------------------------
#HIFI
my @KeywordsHIFISecond = qw(((没|木有)).{0,18}hifi|无.{0,18}HIFI (不|无法).{0,18}支持.{0,18}(第三方|播放器));
$mergeArray[57]=@KeywordsHIFISecond;
#---------------------------------
#锁屏 
my @KeywordsLockScreenSecond = qw(锁.{0,18}屏.{0,18}(不|无法).{0,18}灵敏 锁.{0,18}屏.{0,18}(壁纸|墙纸).{0,18}((不|无法)|无法|取消|换) 锁.{0,18}屏.{0,18}(没|木有).{0,18}天气|锁.{0,18}屏.{0,18}音乐.{0,18}天气.{0,18}界面|锁.{0,18}屏.{0,18}动态天气.{0,18}图案|锁.{0,18}屏.{0,18}天气.{0,18}音乐.{0,18}界面|锁.{0,18}屏.{0,18}界面.{0,18}天气预报|锁.{0,18}屏.{0,18}音乐.{0,18}天气.{0,18}挂件|锁.{0,18}屏.{0,18}天气.{0,18}音乐.{0,18}挂件|锁.{0,18}屏.{0,18}天气.{0,18}(没|木有)|左滑.{0,18}天气.{0,18}音乐.{0,18}(不见|消失|找不到|失踪|(没|木有)了) 锁屏.{0,18}(不|无法).{0,18}小屏 自动锁屏.{0,18}(不|无法)|自动锁屏.{0,18}无法|无法.{0,18}自动锁屏|(不|无法).{0,18}自动锁屏 
锁屏.{0,18}样式.{0,18}无法|锁屏.{0,18}样式.{0,18}(不|无法) 无法锁屏 锁屏.{0,18}播放.{0,18}音乐 锁屏.{0,18}音乐.{0,18}停止 竖.{0,18}锁屏 锁屏.{0,18}声音.{0,18}大 锁屏.{0,18}无反应 锁屏.{0,18}头像.{0,18}更换 一键加速.{0,18}自动锁屏 锁屏.{0,18}屏幕.{0,18}自动.{0,18}亮|锁屏.{0,18}亮屏 
横屏.{0,18}锁屏 竖.{0,18}锁屏 锁屏.{0,18}(没|木有)声|锁屏.{0,18}无声 锁屏.{0,18}(不|无法)解锁 锁屏.{0,18}小键盘 锁屏时间.{0,18}(不|无法)准确 锁屏.{0,18}(没|木有).{0,18}唤醒 皮套解锁 密码锁屏.{0,18}问题 锁屏.{0,18}断网|锁屏.{0,18}(没|木有)信号|锁屏.{0,18}(不|无法).{0,18}信号 异常锁屏|无缘无故.{0,18}锁屏 
人脸锁屏.{0,18}黑屏 锁屏.{0,18}信息.{0,18}(不|无法).{0,18}接收|锁屏.{0,18}(不|无法).{0,18}信息 锁屏.{0,18}(不|无法)兼容 上划.{0,18}解.{0,18}(不|无法)|上滑.{0,18}解.{0,18}(不|无法) ((锁屏.{0,18}节日.{0,18}壁纸)|(节日.{0,18}锁屏.{0,18}壁纸)).{0,18}((找.{0,18}(不|无法))|(无法.{0,18}找)) ((锁.{0,18}屏)|(屏.{0,18}锁)).{0,18}失效|(不|无法).{0,18}锁屏 ((锁屏.{0,18}短信)|(短信.{0,18}锁屏)).{0,18}提示 
(合|盖|关).{0,18}套.{0,18}不.{0,18}(锁.{0,18}屏|息屏|熄屏) 下拉.{0,18}((拍照.{0,18}(不|无法))|((不|无法).{0,18}相机)) 壁纸.{0,18}被.{0,18}天气.{0,18}盖 锁.{0,18}屏.{0,18}(不.{0,18}亮|打.{0,18}不.{0,18}开)|开锁键.{0,18}黑屏 锁.{0,18}屏.{0,18}解锁.{0,18}花屏 密码.{0,18}忘记 图案解锁.{0,18}错误.{0,18}(无限|不).{0,18}次 一键锁屏.{0,18}(不|无效|失效|不灵) 下.{0,18}滑.{0,18}(开|进).{0,18}(摄像头|相机) 滑动解锁.{0,18}(不|无法)|划不屏 锁屏.{0,18}自动关机 (昵称|smile).{0,18}(改|换|编辑) 两.{0,18}手机.{0,18}一起.{0,18}解锁 解锁.{0,18}(不|无法|没法).{0,18}(显示|显现|出现));
$mergeArray[58]=@KeywordsLockScreenSecond;
#---------------------------------
#相册
my @KeywordsGallerySecond = qw((加密|隐私|私密空间).{0,18}((不|无法).{0,18}开.{0,18}(照片|相片|图片))|(无法|没法|不能|不可以).{0,18}打开.{0,18}隐私.{0,18}(照片|相片|图片) ((设置.{0,18}壁纸)|(壁纸.{0,18}设置)).{0,18}慢 蓝牙.{0,18}图.{0,18}(找不|不.{0,18}找|无法.{0,18}找) 截图.{0,18}((没|木有)|找.{0,18}不)
微视频.{0,18}显示.{0,18}不|显示.{0,18}不.{0,18}微视频|不.{0,18}显示.{0,18}微视频 (照片|相片|图片|存储).*((没|木有)了|(没|木有)了|消失|失踪|找不到)|存.*不.*(照片|相片|图片)|文件.*丢失 相册.{0,18}(打.{0,18}不开|进.{0,18}(不|无法)|(不|无法).{0,18}启|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起)
隐私空间.{0,18}((不|无法).{0,18}进|进.{0,18}(不|无法)) 加密.{0,18}(找不到|失踪|消失|((没|木有))了|在哪) 微信.{0,18}((图片|照片|相片|相册).{0,18}(保存|存储)|(保存|存储).{0,18}(图片|照片|相片|相册|找不到|消失了|(没|木有)了|(没|木有)了|不见了))|((图片|照片|相片|相册).{0,18}保存|保存.{0,18}(图片|照片|相片|相册)).{0,18}微信 (不能|不行|不可以|(没|木有)).{0,18}gif|gif.{0,18}(不能|不行|不可以|(没|木有)).{0,18}(看|打开) (图片|照片|相片|相册).{0,18}(保存|存储|保到|存不上|存不)|(保存|存储).{0,18}(图片|照片|相片|相册|找不到|消失了|((没|木有))了|((没|木有))了|不见了)|下载.{0,18}(图片|照片|相片).{0,18}(怎么|怎样|如何).{0,18}(放|保存|存储)(相册|手机)|(图库|相册).{0,18}(看不到|找不到|((没|木有))).{0,18}(图片|照片|相片)|(不能|不可以|没法|无法).{0,18}存.{0,18}(图片|照片|相片)|文件.{0,18}(不见了|没了)|(不能|无法|没法|不可以).{0,18}(存储|储存).{0,18}(文件|图片) 裁剪 (图片|照片|相片).{0,18}(没法|无法|不能|不可以).{0,18}(查看|打开)|看不了.{0,18}(图片|照片|相片) 图片.{0,18}加载.{0,18}(慢|卡顿|迟钝) (没有|么有|至少有|至少要有).{0,18}文件夹排序 (隐私空间|隐藏选项|加密).{0,18}(没了|没有了|找不到) 珍藏相册.{0,18}(没了|取消了|找不到|消失) (照片|图片|照片).{0,18}(不能|无法|没法|增加).{0,18}移动);
$mergeArray[59]=@KeywordsGallerySecond;
#---------------------------------
#手电筒
my @KeywordsFlashlightSecond = qw((手电|电筒).{0,18}(自己|自动).{0,18}(灭|关) (不|无法|(没|木有)).{0,18}后台 震动模式.{0,18}短信.{0,18}(自己|自动|).{0,18}(亮|开) 手电.{0,18}(没了|没有了|找不到)|(没了|没有了|找不到).{0,18}手电);
$mergeArray[60]=@KeywordsFlashlightSecond;
#---------------------------------
#FM
my @KeywordsFMSecond = qw(打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 (((没|木有))|无|找不到|要是有|自带).{0,18}(FM|收音机)|(FM|收音机).{0,18}(((没|木有))|无|找不到|在哪)|安装.{0,18}.(FM|收音机).{0,18}就好 (搜|收).{0,18}不);
$mergeArray[61]=@KeywordsFMSecond;
#---------------------------------
#字体
my @KeywordsFontSecond = qw((英文|数字).{0,18}无效 少|不.{0,18}多|再出.{0,18}字体 工美彩刷 ((没|木有)|无).{0,18}字体.{0,18}(分格|分割) 字.{0,18}小 (无|(没|木有)|建议).{0,18}(繁体|繁體)|(繁体|繁體).{0,18}(无|(没|木有)) (怎么|怎样|如何|不能|不可以|(没|木有)|无法).{0,18}换.{0,18}字体|字体.{0,18}换 ((没|木有)|无|要是有|加入).{0,18}正楷);
$mergeArray[62]=@KeywordsFontSecond;
#---------------------------------
#SD卡
my @KeywordsSDSecond = qw((SD|存储|储存|卡|内存|U盘).{0,18}(不|无法|未).{0,18}(读|无效|显示|现实|正常运行|可用|使用)|(不|无法).{0,18}(读|无效|显示|现实).{0,18}(SD|存储|储存|卡|内存|U盘)|(SD|存储|储存|卡|内存|安装的|U盘).{0,18}(未挂载|未挂件|读.{0,18}不出|没了|不见了|找不到|消失了|不存在)|(不能|没法|不可以|无法).{0,18}软件搬家|未插入|程序移.{0,18}不.{0,18}内存|看不到.{0,18}(SD|存储|储存|卡|内存|U盘)|不能安装软件|显示无(SD|存储|储存|卡|内存|U盘)|读不出 
(U盘|SD|存储卡|储存卡|储存设备|内存卡|存储设备).{0,18}(坏|错|不能用) 内存.{0,18}坏 (买|售货|宣传).{0,18}G.{0,18}(((没|木有))|才|只|仅).{0,18}G|(((没|木有))|才|只).{0,18}G.{0,18}(买|售货).{0,18}G|内存.{0,18}g.{0,18}(实际|用起来).{0,18}g (读.{0,18}卡|卡.{0,18}读).{0,18}(慢|迟钝|迟缓) (显示|现实|突然).{0,18}(存储卡|储存卡|内存卡|SD).{0,18}(拔出|移除)|(存储卡|储存卡|内存卡|SD).{0,18}(显示|现实|突然).{0,18}(拔出|移除) 存储状态.{0,18}(不|没法|无法).{0,18}用 (移动|移到).{0,18}(SD|内存卡|存储卡|储存卡) 运.{0,8}存.{0,18}(比以前|变).{0,18}大 手机U盘.{0,18}(应用|程序).{0,18}卸载SD.{0,18}图标.{0,18}(丢失|消失|找不到|没了|没有了));
$mergeArray[63]=@KeywordsSDSecond;
#---------------------------------
#屏幕亮度调节
my @KeywordsScreenBrightSecond = qw(屏幕.{0,18}亮度|手机.{0,18}亮度|忽亮忽暗|时亮时暗|自动亮.{0,18}暗|时.{0,18}(暗|亮).{0,18}时.{0,18}亮|忽明忽暗|时亮.{0,18}时暗|屏幕.{0,18}明.{0,18}暗 滑屏.{0,18}暗一下 屏幕常亮 (夜间|夜晚|晚上).{0,18}屏.{0,18}不.{0,18}亮 (视频|电影|电视|电视剧|美剧).{0,18}(屏幕|亮度).{0,18}暗 自动调节.{0,18}(不.{0,18}(调|动)|失效|无效) 相机.{0,18}相册.{0,18}(亮度.{0,18}调|调.{0,18}亮度));
$mergeArray[64]=@KeywordsScreenBrightSecond;
#---------------------------------
#震动
my @KeywordsVibrationSecond = qw((声|音).{0,18}小 无缘无故|莫名其妙);
$mergeArray[65]=@KeywordsVibrationSecond;
#---------------------------------
#vivo语音助手
my @KeywordsVivoiceSecond = qw((添加|(没|木有)|无).{0,18}武汉话);
$mergeArray[66]=@KeywordsVivoiceSecond;
#---------------------------------
#日历
my @KeywordsCalendarSecond = qw((少|(没|木有)).{0,18}节气|节气.{0,18}(少|(没|木有)) 日程.{0,18}(不能|不可以|(没|木有)|无法|(没|木有)).{0,18}农历|日程.{0,18}农历.{0,18}(无效|(没|木有)效) 农历.{0,18}(无法|不能|不可以|(没|木有)|不行).{0,18}设.(0,12)(提醒|备忘录));
$mergeArray[67]=@KeywordsCalendarSecond;
#---------------------------------
#NFC
my @KeywordsNFCSecond = qw(怎么.{0,18}用);
$mergeArray[68]=@KeywordsNFCSecond;
#---------------------------------
#ROOT
my @KeywordsROOTSecond = qw((不支持|不能|不可以|无法|怎么|怎样|如何|没有).{0,18}root|root.{0,18}权限不.{0,18}获取|root.{0,18}权限|root.{0,18}不知道);
$mergeArray[69]=@KeywordsROOTSecond;
#---------------------------------
#游戏中心
my @KeywordsGameCenterSecond = qw(游戏中心.{0,18}后台.{0,18}运行);
$mergeArray[70]=@KeywordsGameCenterSecond;
#---------------------------------
#访客模式
my @KeywordsVisitorPatternSecond = qw(访客模式.{0,18}(不见|消失|找不到|失踪) smart.{0,18}Wake.{0,18}(失效|无效|不灵) 突然.{0,18}(安全模式|访客模式) 访客模式.{0,18}((不能|无法|没法).{0,18}显示|没有).{0,18}小插件);
$mergeArray[71]=@KeywordsVisitorPatternSecond;
#---------------------------------
#USB
my @KeywordsUSBSecond = qw((怎么|如何|怎样).{0,18}(连|联).{0,18}电脑 (USB.{0,18}(连接|联接|链接)|(连接|联接|链接).{0,18}USB).{0,18}漏电);
$mergeArray[72]=@KeywordsUSBSecond;
#---------------------------------
#vivo社区
my @KeywordsVivoCommunitySecond = qw(不.{0,18}(登录|登陆).{0,18}(可以|能|进|).{0,18}社区 (登陆|登录).{0,18}(开.{0,18}不|不.{0,18}开|进.{0,18}不|).{0,18}网);
$mergeArray[73]=@KeywordsVivoCommunitySecond;
#---------------------------------
#天籁K歌
my @KeywordsKMusicSecond = qw((无|(没|木有)).{0,18}耳返|耳返.{0,18}(无效|不行|失效|(没|木有)效|(没|木有)用) (怎么|怎样|如何|不能|不行|不可以|(没|木有)).{0,18}(连接|链接|联接).{0,18}(麦克风|音响|音箱) (怎么|怎样|如何|不能|不行|不可以|(没|木有)).{0,18}(录.{0,18}(歌|曲)) 插.{0,18}耳机.{0,18}时好时坏 作品.{0,18}(停止运行|进不去|关闭) 删.{0,18}(哪下|下载|回复|恢复) 音效.{0,18}(无效|没用|没效|没有用) (听不到|听不见).{0,18}自己.{0,18}(声|音)|不.{0,18}出(声|音)|没.{0,18}(声|音)|(耳反|耳返)失真 闪退|直接退出|秒退 (不能|不会).{0,18}(唱|K歌)|k不了 (不能|不会|不可以|没法|无法).{0,18}听.{0,18}作品 (声|音).{0,18}小 (没|不像|无法|没法).{0,18}KTV.{0,18}(效果|感觉|音效) 怎么|怎样|如何 歌.{0,18}卡|卡.{0,18}歌 伴奏.{0,18}(低|小) 直播间.{0,18}((无|没)耳(返|反)|(听不到|听不见).{0,18}自己.{0,18}(声|音)|不.{0,18}出(声|音)|没.{0,18}(声|音)));
$mergeArray[74]=@KeywordsKMusicSecond;
#---------------------------------
#录音
my @KeywordsSoundRecordSecond = qw(((没|木有)|(要是|如果).{0,18}有|赶紧加).{0,18}录音);
$mergeArray[75]=@KeywordsSoundRecordSecond;
#---------------------------------
#掉漆
my @KeywordsDiaoqiSecond = qw(边框|边缘|边上|边|四周 充电口 丝印 侧 (一|1)个月 外壳|外观|vivo标志.{0,18}掉 中框 两端 USB|充电插口 耳机 天|月|新.{0,18}买 );
$mergeArray[76]=@KeywordsDiaoqiSecond;
#---------------------------------
my @KeywordsSuggestionSecond = qw();
$mergeArray[77]=@KeywordsSuggestionSecond;
#---------------------------------
my @KeywordsQuestionSecond = qw((怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(显示|查看|现实).{0,18}(手机.{0,18}型号|版本) (怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(设置).{0,18}(时间)|(时间).{0,18}(怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(设置) (恢复|回复).{0,18}出厂设置|出厂设置.{0,18}(恢复|回复) 多屏.{0,18}(怎么|怎样|如何|不会).{0,18}用|(怎么|怎样|如何|不会).{0,18}用.{0,18}多屏 (有|支持|是否|可以).{0,18}联通.{0,18}4G|联通.{0,18}4G.{0,18}(有|支持|是否|可以) 大型游戏.{0,18}(不能|不可以|不行|没法|无法|没办法).{0,18}(玩|用|进)|(不能|不可以|不行|没法|无法|没办法).{0,18}(玩|用|进).{0,18}大型游戏 (是不是|是否|判断).{0,18}旗舰机 photo+.{0,18}(怎么|怎样|如何|不会).{0,18}用 (5|五)模.{0,18}(3|三)模|(3|三)模.{0,18}(5|五)模 出厂.{0,18}(程序|软件|应用).{0,18}下载 怎么把.{0,18}(放到|移到));
$mergeArray[78]=@KeywordsQuestionSecond;
#---------------------------------
my @KeywordsComplainSecond = qw();
$mergeArray[79]=@KeywordsComplainSecond;
#---------------------------------
my @KeywordsSatisfiedSecond = qw();
$mergeArray[80]=@KeywordsSatisfiedSecond;
#---------------------------------
$totolRow=600;
$numDRow=MM.$totolRow;#600行对应的excel长宽   #modify  kongqiao


%columnMap = (); #记录 "相机" 和 "第三方软件" 的反馈量不为 0 的列数

main();





sub main{
	Process();	#过滤处理，处理完后进行版本筛选，筛选策略：先找到版本个数，按照个数拷贝相同的份数，进行删除操作。	
}


sub Process{
		foreach (@PHONEMODELS) {
										print $_."\n";
										$getName=$_=~ /(\S+)Detail/ig;
										$docName=$1;
										$moduleTempNum=0;
										#打开x3t
										$filePath = $dir."\/".$docName.".xlsx";	# 表格路径
										$workbook = $Excel->Workbooks->Open($filePath);
										$newSheet = $workbook->Worksheets->Add;
										$newSheet->{name} = "前八位严重模块具体现象描述";
										#$selectSheet = $workbook->Sheets($pageNum);
																				
										$detailSheet = $workbook->Worksheets->Add;
										$detailSheet->{name} = "所有模块具体现象统计";
									
												
										#读出x3tEXCEL数据到数组
										$DataArray = $newSheet->Range("A1:$numDRow")->{'Value'};
										$DataLength=@$DataArray-1;
										
									
										$detailDataArray = $detailSheet->Range("A1:$numDRow")->{'Value'};
										$detailDataLength = @$detailDataArray-1;
					
										$totolSheet=$workbook->Sheets("统计");
										#$selectSheet = $workbook->Sheets($pageNum);
										#读出x3tEXCEL数据到数组
										$DataTotolArray = $totolSheet->Range("A1:$numDRow")->{'Value'};


										#打开Detail
										$filePathDetail = $dir."\/".$_.".xlsx";	# 表格路径
										$workbookDetail = $Excel->Workbooks->Open($filePathDetail); 
										$tempName=$docName."投诉";
										#print $1."\n";
										$selectSheetDetail = $workbookDetail->Sheets($tempName);
					
										#读出Detail的EXCEL数据到数组
						  			$rowCountDetail = $selectSheetDetail->usedrange->rows->count;       #最大有效行数
										$totolRowDetail = $rowCountDetail;
										$numDRowDetail = AYG.$totolRowDetail;
										$DataArrayDetail = $selectSheetDetail->Range("A1:$numDRowDetail")->{'Value'};
										$DataLengthDetail = @$DataArrayDetail;
																				
							
										# modify kongqiao 20150724
										# 获取本周所有模块细分数据
										$moduleArray = $$DataTotolArray[0];
										foreach $temp (1..$colMax){
											$getmodule[$temp-1] = $$DataTotolArray[0][$temp];
											
										}
																			
										$moduleNumtotal = @getmodule;
										
										$allNum=0;
										foreach $value(@getmodule){
											
												$tempFirstData = $$detailDataArray[0+$allNum];
												$lineValue = @$tempFirstData;
												$$tempFirstData[0] = $docName."投诉";
												
												$tempSecondtData=$$detailDataArray[1+$allNum];
												$lineValueSecond=@$tempSecondData;
												$secondValueName=$value."投诉量";
												$$tempSecondtData[0]=$secondValueName;
																			
												$tempFirstDataDetail=$$DataArrayDetail[0];
												$lineValueDetail=@$tempFirstDataDetail;
												
												$tempLastDataDetail=$$DataArrayDetail[$DataLengthDetail-1];
												$lineValueLastDetail=@$tempLastDataDetail;
												
												$markPosition=0;#整个数组位置信息
												$markModulePosition=0;#获取到得哪个模块名在模块数组的位置
												$tempNum=0;
												$numInsert=1; #每个模块的每列位置信息
												
											
												foreach $valueDetail(0...$lineValueDetail-1){
													#print $valueDetail."\n";
														if($$tempFirstDataDetail[$valueDetail] eq $value){
															if($$tempFirstDataDetail[$valueDetail] eq "系统性能"){
																#print "可以匹配系统性能的\n";
															}
															$markPosition=$valueDetail;#记录整个细分数组中的位置信息
															#print "匹配到了记录位置为：";
															#print $markPosition."\n";
															last;
														}
					
												}
												
												
												#获取TAGSERIES模块内的位置，从而得到该模块长度
												foreach(@TAGSERIES){
														if($_ eq $value){
																$markModulePosition = $tempNum;
																last;
														}
														$tempNum++;
												}
												
												$positionModule[$moduleTempNum] = $markModulePosition;
												$moduleTempNum++;
												
												foreach $tempNum($markPosition...$markPosition+$mergeArray[$markModulePosition]-1){		
														#print $tempNum."\n";
														$$tempFirstData[$numInsert]=$$tempFirstDataDetail[$tempNum+1];#将X3T1的数据放到X3T里面去
														$$tempSecondtData[$numInsert]=$$tempLastDataDetail[$tempNum+1];#将X3T1的数据放到X3T里面去
														$numInsert++;			
												}

												# 相机或第三方软件只显示不为 0 的部分
												if($value eq "相机" || $value eq "第三方软件"){
												
													for ($i = 1; $i < $numInsert; $i++){
												
														for($j = 1; $j < $numInsert - $i; $j++){
															$jNum = $$tempSecondtData[$j];
															$jNumP = $$tempSecondtData[$j + 1];
															$jName = $$tempFirstData[$j];
															$jNameP = $$tempFirstData[$j + 1];
															if($jNum < $jNumP){
																$$tempSecondtData[$j] = $jNumP;
																$$tempSecondtData[$j + 1] = $jNum;
																$$tempFirstData[$j] = $jNameP;
																$$tempFirstData[$j + 1] = $jName;
															}
														}
													}
												
													$countNonZero = 0;
													for($i = 1; $i < $numInsert; $i++){
														if($$tempSecondtData[$i] > 0){
															$countNonZero ++;
														} else {
															$$tempSecondtData[$i] = '';
															$$tempFirstData[$i] = '';
														}
													}
													$columnMap{$value} = $countNonZero;
												}
												
																					
												$allNum=$allNum+3;   
																																																				
										}
										
										#获取上周细分模块数据				
																				
					          #打开Detaillast
										$filePathDetailLast = $dir."\/".$_."Last".".xlsx";	# 表格路径
										$workbookDetailLast = $Excel->Workbooks->Open($filePathDetailLast); 
										$tempNameLast = $docName."投诉";
										#print $1."\n";
										$selectSheetDetailLast = $workbookDetailLast->Sheets($tempNameLast);
					
										#读出Detaillast的EXCEL数据到数组
						  			$rowCountDetailLast = $selectSheetDetailLast->usedrange->rows->count;       #最大有效行数
										$totolRowDetailLast = $rowCountDetailLast;
										$numDRowDetailLast = AYG.$totolRowDetailLast;
										$DataArrayDetailLast = $selectSheetDetailLast->Range("A1:$numDRowDetailLast")->{'Value'};
										$DataLengthDetailLast = @$DataArrayDetailLast;
										
																		
										$allNumLast = 240;
										foreach $value(@getmodule){
											
												$tempFirstDataLast = $$detailDataArray[0 + $allNumLast];
												$lineValueLast = @$tempFirstDataLast;
												$$tempFirstDataLast[0] = $docName."投诉";
												
												$tempSecondtDataLast = $$detailDataArray[1 + $allNumLast];
												$lineValueSecondLast = @$tempSecondDataLast;
												$secondValueNameLast = "上周".$value."投诉量";
												$$tempSecondtDataLast[0] = $secondValueNameLast;
																			
												$tempFirstDataDetailLast = $$DataArrayDetailLast[0];
												$lineValueDetailLast = @$tempFirstDataDetailLast;
												
												$tempLastDataDetailLast = $$DataArrayDetailLast[$DataLengthDetailLast - 1];												
												$lineValueLastDetailLast = @$tempLastDataDetailLast;
												
												
												$markPositionLast = 0;  #整个数组位置信息
												$markModulePositionLast = 0; #获取到得哪个模块名在模块数组的位置
												$tempNumLast = 0;
												$numInsertLast = 1; #每个模块的每列位置信息
												
											
												foreach $valueDetailLast (0...$lineValueDetailLast-1){
													#print $valueDetail."\n";
														if($$tempFirstDataDetailLast[$valueDetailLast] eq $value){
															if($$tempFirstDataDetailLast[$valueDetailLast] eq "系统性能"){
																#print "可以匹配系统性能的\n";
															}
															$markPositionLast = $valueDetailLast;  #记录整个细分数组中的位置信息
															
															last;
														}
					
												}
												
												
												#获取TAGSERIES模块内的位置，从而得到该模块长度
												foreach(@TAGSERIES){
														if($_ eq $value){
																$markModulePositionLast = $tempNumLast;
																last;
														}
														$tempNumLast++;
												}
												
												$positionModuleLast[$moduleTempNumLast] = $markModulePositionLast;
												$moduleTempNumLast++;
												
												foreach $tempNumLast($markPositionLast...$markPositionLast + $mergeArray[$markModulePositionLast]-1){		
														#print $tempNum."\n";
														$$tempFirstDataLast[$numInsertLast] = $$tempFirstDataDetailLast[$tempNumLast + 1];   
														$$tempSecondtDataLast[$numInsertLast] = $$tempLastDataDetailLast[$tempNumLast + 1]; 
														$numInsertLast++;			
												}

												# 相机或第三方软件只显示不为 0 的部分
												if($value eq "相机" || $value eq "第三方软件"){
												
													for ($i = 1; $i < $numInsertLast; $i++){
												
														for($j = 1; $j < $numInsertLast - $i; $j++){
															$jNum = $$tempSecondtDataLast[$j];
															$jNumP = $$tempSecondtDataLast[$j + 1];
															$jName = $$tempFirstDataLast[$j];
															$jNameP = $$tempFirstDataLast[$j + 1];
															if($jNum < $jNumP){
																$$tempSecondtDataLast[$j] = $jNumP;
																$$tempSecondtDataLast[$j + 1] = $jNum;
																$$tempFirstDataLast[$j] = $jNameP;
																$$tempFirstDataLast[$j + 1] = $jName;
															}
														}
													}
												
													$countNonZeroLast = 0;
													for($i = 1; $i < $numInsertLast; $i++){
														if($$tempSecondtDataLast[$i] > 0){
															$countNonZeroLast ++;
														} else {
															$$tempSecondtDataLast[$i] = '';
															$$tempFirstDataLast[$i] = '';
														}
													}
													$columnMapLast{$value} = $countNonZeroLast;
												}
												
																					
												$allNumLast = $allNumLast + 3;   
																																																				
										}
										
										
										$detailSheet->Range("A1:$numDRow")->{'value'} = $detailDataArray;
					
	
													
										#获取本周排名前八位数据
										$tempCount=0;
										foreach $temp(135..142){
													$tempArray=$$DataTotolArray[$temp-1];
													$getLine[$tempCount]=$$tempArray[8];
															
													$tempCount++;													
										}
										
										
										$allNum=0;								
										$ModuleNum=@getLine;
										foreach $value(@getLine){						#按得到的字符依次做数据
											
																							
												$tempFirstData = $$DataArray[0+$allNum];											
												$$tempFirstData[0]=$docName."投诉";
												
												$tempSecondtData = $$DataArray[1+$allNum];												
												$secondValueName = $value."投诉量";
												                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 foreach $num (0...$colMax){
                        	if($secondValueName eq $$detailDataArray[$num*3 +1][0]){
                        		#print "ene $secondValueName \n"; 
                        		$$DataArray[0+$allNum] = $$detailDataArray[$num*3 +0];
                        		$$DataArray[1+$allNum] = $$detailDataArray[$num*3 +1];
                        		
                        	}
                        }                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         														          $allNum = $allNum + 35;   																																																			
										}
										         
										$newSheet->Range("A1:$numDRow")->{'value'} = $DataArray;
									
										
=pod										
										# modify kongqiao 20150715
 										# 复制并解析上周数据
 										
			    				  my @allfilePathLast = <*.xlsx>;
	  								foreach $path (@allfilePathLast){
	  										if($path =~ /ROM2.0_$docName_.*用户反馈/){
	  	 
	  											$filePathLast = $dir."\/".$path;
	  											print "上周数据路径是： $filePathLast \n";
	  										}
	  								}
 								
	  								
	  								$workbookLast = $Excel->Workbooks->Open($filePathLast);
	 
										
										#读出上周统计 sheet EXCEL数据到数组									 
										$selectSheetLast = $workbookLast->Sheets("统计");
										$DataArrayLast = $selectSheetLast->Range("A1:$numDRow")->{'Value'};
										
										#获取上周排名前八位数据
										$tempCountLast=0;
										foreach $tempLast(135..142){
													$tempArrayLast = $$DataArrayLast[$tempLast-1];

													$getLineLast[$tempCountLast] = $$tempArrayLast[8];														
													$tempCountLast++;
													
										}
																												
										#读出上周前八位sheet  EXCEL数据到数组									 
										$selectSheetLast = $workbookLast->Sheets("前八位严重模块具体现象描述");
										$DataArrayLast = $selectSheetLast->Range("A1:$numDRow")->{'Value'};
										
										my @nocount;   # 未匹配到的数目
										$allNum=0;
										$ModuleNum=@getLineLast;
										
										print "上周前八： @getLineLast \n";
									 
=cut
									  # 为避免，本周前八数据与上周前八数据不同，我们对上周 所有的细分模式数据中，进行匹配	
									  									  
									  $allChartNum = 1;																
										foreach $row (1..$ModuleNum){		
											foreach $row1 (1..$colMax){											
												if($getLine[$row-1] eq $getmodule[$row1 -1]){     # 匹配到了
													#print "$getLine[$row-1] \n";
													#print "$row1 \n";
														
													if($getLine[$row-1] eq "相机" || $getLine[$row-1] eq "第三方软件"){														
													# 获取上周数据, 相机或第三方软件
												
											 							
														$$DataArray[$allChartNum +($row-1)*35+1][0] =  $$detailDataArray[240 +1 +($row1-1)*3][0];												
																						
																	 															
														# 将上周数据，一一对应的复制至本周，
														# 先处理，能在上周数据中匹配到相应数值的
														$count = @{$$DataArray[$allChartNum -1 + ($row-1)*35+0]};
														$countLast = @{$$detailDataArray[240 + ($row1-1)*3]};												
												
														for ($i = 1; $i<$count; $i++){
														#	print "enen $temp \n";
															for ($j =1;$j < $countLast; $j++){
															#	print "haha $tempLast \n";
																if(($$DataArray[$allChartNum -1 + ($row-1)*35+0][$i] eq $$detailDataArray[240+($row1-1)*3][$j]) && 
																		!($$DataArray[$allChartNum -1 + ($row-1)*35+0][$i] eq "")){
															
																$$DataArray[$allChartNum +($row-1)*35+1][$i] = $$detailDataArray[240 + 1 +($row1-1)*3][$j];															
																												 																													
																}																																			
													
												 			}											  													
														}
														# 上周未匹配到
														for ($i = 1; $i<$count; $i++){
															if(!($$DataArray[$allChartNum -1 + ($row-1)*35+0][$i] eq "") && !($$DataArray[$allChartNum + ($row-1)*35+0][$i] eq "")
													 				&& ($$DataArray[$allChartNum +1 + ($row-1)*35][$i] eq "")){
													 
													 			$$DataArray[$allChartNum +($row-1)*35+1][$i] = 0;
															}
													 
														}
														my $first = 0;
														# 找到本周数据中，不为空白的第一项
														for ($i = 0; $i<$count; $i++){
															if(($$DataArray[$allChartNum -1 + ($row-1)*35+0][$i] eq "") ){
													 
													  		$first = $i;
													  		last;
															}
													 
														}
														print "不为空的第一项： $first \n";
																								
														# 上周存在，但本周没有
												
														LINE: for($i = 1; $i < $countLast; $i++){
															if(!($$detailDataArray[240 +($row1-1)*3][$i] eq "")){
																for ($j = 1; $j < $count; $j++){
																	if($$detailDataArray[240 +($row1-1)*3][$i] eq $$DataArray[$allChartNum -1+($row-1)*35+0][$j]){
																		#存在匹配的
																		next LINE;																																																
																	}
																																										
																}
														
																# 未找到 匹配的项
																print "无匹配项：$$detailDataArray[240 +($row1-1)*3][$i] \n";
														
																$$DataArray[$allChartNum -1+($row-1)*35+0][$first + $nocount[$row-1]] = $$detailDataArray[240+($row1-1)*3][$i];														
																$$DataArray[$allChartNum +($row-1)*35+0][$first + $nocount[$row-1]] = 0;
																$$DataArray[$allChartNum + 1+($row-1)*35+0][$first + $nocount[$row-1]] = $$detailDataArray[240+1+($row1-1)*3][$i];
														
																$nocount[$row-1] ++;
													
															}
													
														}		
												
														$tempDataArray = $$DataArray[$allChartNum  +($row-1)*35];
												
														$$DataArray[$allChartNum  +($row-1)*35] = $$DataArray[$allChartNum  +($row-1)*35+1];
														$$DataArray[$allChartNum  +($row-1)*35+1] = $tempDataArray;
																																																																			
												
													}else{						
												
														$$DataArray[$allChartNum  +($row-1)*35+1] = $$DataArray[$allChartNum  +($row-1)*35];
														$$DataArray[$allChartNum  +($row-1)*35] = $$detailDataArray[240 + 1 + ($row1-1)*3];
													#	$$DataArray[$allChartNum  +($row-1)*35][0] = "上周".$$DataArrayLast[($row-1)*30+1][0];
												
													}
												}
											
											
											}
										}
										
									
										$newSheet->Range("A1:$numDRow")->{'value'} = $DataArray;
							
										#开始制图
									  $getNum=0;
										$allChartNum = 1;
										for(1..$ModuleNum){
											for $row(0..$colMax-1){
												if($getLine[$getNum] eq $getmodule[$row]){
																												
															$rangeStart = A.$allChartNum;
															if($getLine[$getNum] eq "通话"){
																$rangeEnd = getColumnName($mergeArray[$positionModule[$row]]+1-1).($allChartNum+2);
															
															}elsif($getLine[$getNum] eq "相机" || $getLine[$getNum] eq "第三方软件"){
																
																$countindex = $columnMap{$getLine[$getNum]} + 1;
																$rangeEnd = getColumnName($columnMap{$getLine[$getNum]} + 1+ $nocount[$getNum]).($allChartNum+2);
																
																
															}else{
																
																$rangeEnd = getColumnName($mergeArray[$positionModule[$row]]+1).($allChartNum+2);
															}
															#print "$rangeStart \n";
															#print "$rangeEnd \n";
															if($getLine[$getNum] eq "第三方软件"){
																$chartWidth=2000;
															}elsif($getLine[$getNum] eq "游戏"){
																$chartWidth=1500;
															}elsif($getLine[$getNum] eq "相机"){
																$chartWidth=1500;
															}elsif($getLine[$getNum] eq "系统性能"){
															  $chartWidth=1500;
															}else{
																$chartWidth=1000;
															}
															
															$chartX=0;
															$chartY=($allChartNum+5)*13.5;
															$chartHeight = 13.5*23;
															
														  $chart_range = $newSheet->Range( "$rangeStart:$rangeEnd" );        # 数据源范围
														  
														  $Chart[$getNum]=$newSheet->ChartObjects->Add($chartX, $chartY, $chartWidth, $chartHeight)->Chart;              #13.5一个格子
															$Chart[$getNum]->SetSourceData(
															        {
															                Source =>$chart_range,                                #　数据源RANG
															                PlotBy =>xlRows,                    # 以源数据库横向还是竖向为标准生成图表 xlRows eq 1
															        }
															);
														  $Chart[$getNum]->{ChartType} = xlColumnClustered;												
															$Chart[$getNum]->ChartArea->Format->ThreeD->{'RotationX'}=0;
															$Chart[$getNum]->ChartArea->Format->ThreeD->{'RotationY'}=90;
														  $tempChartName = $$DataArray[$allChartNum+1][0];
														 # print "$tempChartName \n";
														  $Chart[$getNum]->{'HasTitle'} = 1;
														  $Chart[$getNum]->ChartTitle->Characters->{Text} = $tempChartName;																														
												}	
																														
											}			
																								
												$getNum++;
											  $allChartNum = $allChartNum + 35;
										}
																												
									 	# modify kongqiao0712 20150717
									  
									 	#新建 sheet
									 	$newSheetSta = $workbook->Worksheets->Add;
										$newSheetSta->{name} = "前八位严重模块比例描述";
										
										$moduleTempNum=0;									
										$workSheet = $workbook->Sheets("统计");	
										$totolRownew = 77;
										$numDRownew = MM.$totolRownew;
																											
																			
										$allChartNum = 1;
										
										# 计算总数
										foreach $row (1..$ModuleNum){		
											$$DataArraySta[   ($row-1)*10] = $$DataArray[$allChartNum -1  +($row-1)*35];
											$$DataArraySta[1+ ($row-1)*10] = $$DataArray[$allChartNum  +($row-1)*35];
											$$DataArraySta[2+ ($row-1)*10] = $$DataArray[$allChartNum + 1  +($row-1)*35];
											
											
											$count = @{$$DataArraySta[  ($row-1)*10]};
											@countno = qw(0,0);    # 最后一项的下标
											@totalNum = qw(0,0);
											foreach $num(0..1){
												for($i = 1; i<$count; $i++){
												 if($$DataArraySta[ ($row-1)*10][$i] eq ""){
												 	$countno[$num]++;
												 	last;
												 	 													
												 }else{
												 	
												 	 $totalNum[$num] += $$DataArraySta[1+ $num + ($row-1)*10][$i];
												 	 $countno[$num]++;
												 }
												 																				 												
											  }
											  
											  $$DataArraySta[1 + $num + ($row-1)*10][$countno[$num]] = $totalNum[$num];	
											  
											  #求，比例
											  for($i = 1; $i<$countno[$num]; $i++){	
											  	if($$DataArraySta[1 + $num +  ($row-1)*10][$i] == 0)
											  	{
											  		$$DataArraySta[5 + $num + ($row-1)*10][$i] = 0;
					
											  	}else{
											  		$$DataArraySta[5+ + $num + ($row-1)*10][$i] = $$DataArraySta[1 + $num + ($row-1)*10][$i]/$$DataArraySta[1 + $num + ($row-1)*10][$countno[$num]]*100;
											  		$$DataArraySta[5+ + $num + ($row-1)*10][$i] = $$DataArraySta[5+ + $num + ($row-1)*10][$i]."\%";
											  	}											  
											  	
											  }												 					 
											
										  }
										  
										  $$DataArraySta[4 +  ($row-1)*10] = $$DataArraySta[ ($row-1)*10];										
									 									 	
									  }
									  
									  $row = 1;
									  foreach $value(@getLine){
									  	
									  	$$DataArraySta[5 + 0 + ($row-1)*10][0] = "上周".$value."投诉比";
									  	$$DataArraySta[5 + 1 + ($row-1)*10][0] = $value."投诉比";
									  	
									  	$row++;									  										  	
									  }
									  								  
									  $newSheetSta->Range("A1:$numDRownew")->{'value'} = $DataArraySta;
									  
									  
									  # 在统计sheet 中画出 比例图
									  #开始制图, 比例图
									  $getNum=0;
										$allChartNum = 5;
										for(1..$ModuleNum){
											for $row(0..$colMax-1){
												if($getLine[$getNum] eq $getmodule[$row]){
																												
															$rangeStart = A.$allChartNum;
															if($getLine[$getNum] eq "通话"){
																$rangeEnd=getColumnName($mergeArray[$positionModule[$row]]+1-1).($allChartNum+2);
															
															}elsif($getLine[$getNum] eq "相机" || $getLine[$getNum] eq "第三方软件"){
																
																$rangeEnd = getColumnName($columnMap{$getLine[$getNum]} + 1 + $nocount[$getNum]).($allChartNum+2);
																
																
															}else{
																
																$rangeEnd = getColumnName($mergeArray[$positionModule[$row]]+1).($allChartNum+2);
															}
														
															print "$rangeEnd \n";
															
															$chartX = 0;
															$chartY = 145*13.5 + $getNum*420;

															$chartWidth = 1000;
															$chartHeight = 405;
															
														  $chart_range = $newSheetSta->Range( "$rangeStart:$rangeEnd" );        # 数据源范围
														  
														  $Chart[$getNum] = $workSheet->ChartObjects->Add($chartX, $chartY, $chartWidth, $chartHeight)->Chart;              #13.5一个格子
															$Chart[$getNum]->SetSourceData(
															        {
															                Source =>$chart_range,                                #　数据源RANG
															                PlotBy =>xlRows,                    # 以源数据库横向还是竖向为标准生成图表 xlRows eq 1
															        }
															);
														  $Chart[$getNum]->{ChartType} = xlColumnClustered;												
															$Chart[$getNum]->ChartArea->Format->ThreeD->{'RotationX'}=0;
															$Chart[$getNum]->ChartArea->Format->ThreeD->{'RotationY'}=90;
														  $tempChartName = $$DataArraySta[$allChartNum+1][0];
														
														  $Chart[$getNum]->{'HasTitle'} = 1;
														  $Chart[$getNum]->ChartTitle->Characters->{Text} = $tempChartName;
															
												}
											}			
											$getNum++;
											$allChartNum = $allChartNum + 10;
																														
															
										}
										
									  $workbookDetailLast->Save();
									  $workbookDetailLast->Close();
									  														 							
										$workbookDetail->Save();
										$workbookDetail->Close();					
																		
										$workbook->Save();
										$workbook->Close();		
										
							 
		}
																						
		
}



#获取数字转换成大写字母
sub getColumnName{  
    $first;  
    $lastvalue;  
    $columnNum=$_[0];
    #print "column的值为".$columnNum."\n";
    $result = "";  

    $first = int($columnNum / 27);  
    $lastvalue = $columnNum - ($first * 26);  
  	
  	#print "看一下".$first."            ".$lastvalue."\n"; 
  	$temp;
    if ($first gt 0){ #lt小于 gt大于 ne不等于 
    		$temp=$first+64;
    		#print $temp."\n";
        $result = chr($temp);  
      }
  
    if (lastvalue gt 0){
    		$temp=$lastvalue+64;
    		#print $temp."\n";
        $result = $result.chr($temp); 
      } 
 			#$result=$result;
      #print "暂时值为：".$result."\n"; 
  
} 
 
