
use Cwd;
use Time::HiRes qw(gettimeofday);
use Win32::OLE qw(in with);
use Win32::OLE::Const 'Microsoft Excel';
$Win32::OLE::Warn = 3;  

my $Excel = Win32::OLE->GetActiveObject('Excel.Application')|| Win32::OLE->new('Excel.Application', 'Quit');   

my @PHONEMODELS = qw(XplayDetail Xplay3sDetail XshotDetail X5MaxLDetail X5Max+Detail Y29LDetail X5LDetail X5MaxVDetail X5ProDDetail X5MDetail);  # 机型 for test

my @keywordNull = qw();
my @PAGENAME = qw(全部数据 系统性能 发热投诉 耗电投诉);
#------------------ K(11) L    M  ....................................................
@TAGSERIES = qw(耗电 发热 系统性能 死机 重启 自动关机 触屏 桌面 黑屏 升级 vivo乐园 屏幕发黄 闪屏 场景桌面 小挂件 相机 通话 无响应 停止运行 闪退 兼容性 
i音乐 i视频 音频 i管家 浏览器 软件商店 状态栏 联系人 短信 电子邮件 文件管理 输入法 天气预报 便签 计算器 超清影院 电子书 
网络信号 WIFI GPS 蓝牙 指纹 OTG 智能体感 流量监控 时间不准 帐号 小屏 游戏 第三方软件 云服务 充电 截屏 闹钟 photo+ i主题 HIFI 锁屏 相册 手电筒 收音机 字体 内存和SD卡 屏幕亮度 震动 vivo语音助手 
日历 NFC ROOT 游戏中心 访客模式 USB vivo社区 天籁K歌 录音 眼球识别 掉漆 建议 问题 抱怨 满意);
my $filterOthers=qw(耗电|发热|系统性能|死机|重启|自动关机|触屏|桌面|黑屏|升级|vivo乐园|屏幕发黄|闪屏|场景桌面|小挂件|相机|通话|无响应|停止运行|闪退|兼容性|i音乐|i视频|音频|i管家|浏览器|软件商店|状态栏|联系人|短信|电子邮件|文件管理|输入法|天气预报|便签|计算器|超清影院|电子书|网络信号|WIFI|GPS|蓝牙|指纹|OTG|智能体感|流量监控|时间不准|帐号|小屏|游戏|第三方软件|云服务|充电|截屏|闹钟|photo+|i主题|HIFI|锁屏|相册|手电筒|收音机|字体|内存和SD卡|屏幕亮度|震动|vivo语音助手|日历|NFC|ROOT|游戏中心|访客模式|USB|vivo社区|天籁K歌|录音);
my $filterData=qw(问题|建议|其他|抱怨);
my $totalNum = 81;
my $startCol = 12+5;
#-----------------1---------------
my @KeywordsBattery = qw(用电 没有电 放电很快 优化电池 电池.{0,18}弱 电.{0,18}降.{0,18}快 不住电 电池.{0,18}差劲 电太费 电跑的.{0,18}快 电用.{0,18}快 电.{0,18}不耐用 电池用不.{0,18}天 电池.{0,18}用.{0,18}快 电量不足 电量.{0,18}迅速.{0,18}少 电.{0,18}不经用 不耐电 续航 电量 耗电 费电 費電 耗電 费点 电池垃圾 用电快 掉电 电池太差 电池.*(不|无法)耐用 没电 充满电.*只剩 去.*%.*电 用电.*快 电掉.*快 百分之.*电 电池消耗 电(不|无法)耐用 电.*耗.*(块|快) 不存电 电.*流逝 电.*多 百分比.*电量 晚上.*电|电.*晚上 电.*吊.*快 电池.*短 电.*不耐用 电池.*抗使 电.*耗 电池.*不 电.*用不 电池.*没.*电 不保电 電池.*不 电池续航);
my @KeywordsBatteryExcl = qw(电子邮件 想要的电量 看电量 显示电量 电量充足 百分比电量 电量显示 电量.*百分比 数字电量 电量.*数字 电池.*百分比 免费电话 电池容量 避免.*耗电 电池发热 白费电 只看到充电(不|无法)能上传 
电池很热 伤电池 没电话 改善 售后电话);
#---------------------------------
my @KeywordsHeat = qw(热 烫 温度 燙 熱 发烧 发汤 发炀 很汤 烧的);
my @KeywordsHeatExcl = qw(个人热点 发烧友 热重启 比如 歌软 热爱 热点 比任 既然 等软 度然 先权 內容 热感应 天气.*温度 热插播 热插拔);   #很奇怪，比如居然被识别成热，在这里过滤一下
#---------------------------------
my @KeywordsPerf = qw(不敏感 开机.*时间.*(长|久) 性能.{0,18}(不.*好|差) 顿一下 慢 卡 流畅 迟钝 没反应 没反映 迟缓 么有反应 迟滞 卡顿 (不|无法).*顺畅 放映.*慢 没.*反应快);
my @KeywordsPerfExcl = qw(迷你卡 SMI卡 S1M卡 安卡 储蓄卡 Sd.{0,4}卡 装内容卡 装上卡 卡退不出 卡.{0,6}识别 识别.{0,6}卡 两卡 吃卡 慢下载 无手机卡 电子书.{0,18}慢 出来手机卡 卡升级成 三G卡 数据传输.{0,18}慢 专享卡 sim卡 用什么卡 卡信号 刷卡 慢慢吃 放当地卡 卡取不出 卡啦ok 卡不好装 插入卡 位置卡 卡是3g 卡在手机 二卡 1卡 散热.{0,18}慢 4g.{0,18}慢 汽车之家 WLAN sm卡 保修卡 卡托 慢慢恢复 扩展卡 不是卡 存储卡 支付宝钱包 反馈.{0,18}没反应 手机卡.{0,18}放进去 手机卡怎么插 拖卡 脱卡 慢快门 扣扣 没到.{0,18}速度.{0,18}慢 存卡 两张卡 定位慢 现代战争 刷卡机 狂野飆車 卡白 S卡 GLOBE卡 卡片 卡有问题 剪卡 4.{0,18}g卡 卡l 俩卡 卡哇伊 卡上的 副卡 主卡 上网.{0,18}不.{0,18}流畅 电子反馈卡 手机卡.{0,5}小 最慢的.{0,18}网 s.{0,18}i.{0,18}m卡 卡老是松 用4G手机卡 下载.{0,18}卡 上卡栏 送的卡 系统越升级越(垃圾|差|烂|搓) 换了卡 我的卡 看不到卡 卡二 卡一 慢慢.{0,18}摸索 卡是4G 卡1 卡2 保俢卡 (声控接听|智能暂停|智能拨号|(保护盖|保护套|手机套).{0,18}亮屏.{0,18}(失效|不.{0,18}灵)|smart.{0,18}wake|语音接听|语音挂断|划m|划o|划w|智能通话|智能窗口接电话|智能接听|双击|智能亮屏|摇一摇|画o|画m|画w|隔空|体感|智能感应|手套模式|喚醒|熄屏手势|屏幕换.{0,18}醒|智能唤醒|多屏互动|隔空操作|空中轨迹|语音唤醒|air.{0,18}wake|隔空操作).{0,18}(没反应|不响应) uid卡 选择卡 断开手机卡 手机消消乐 gif快手 (画v|画o|画m|画w).{0,18}没反应 开卡针 天猫 建设银行 换手机卡 卡也是4G DC卡 慢速回放 还原卡上 GPS.{0,18}慢 明明有卡 把卡拿 在卡上 皮卡丘 跑跑卡丁车 换了一下卡 上原来的卡 cd卡 退卡 2G.{0,5}慢 退卡 卡号 卡里 电影卡 流畅上网 去吧皮卡丘 在卡上 删.{0,18}慢 卡里 慢.{0,4}镜头 明明有卡 咔咔声 uim 没有卡 移动.{0,7}卡 联通.{0,7}卡 手机卡上 手机卡里 和包刷卡 显示什么卡 插上卡 换了个卡 凤凰视频 捕鱼达人 兴业优理宝 两个卡 慢动作 信号.{0,18}(差|次) 卡是2g slm卡 脱网 推送.{0,18}慢 不.{0,18}顺畅.{0,18}4g.{0,18}3g 移动的卡 联通的卡 卡一 手机卡里 两张卡 连接.{0,18}慢 收.{0,18}短信.{0,18}慢 发.{0,18}短信.{0,18}慢 短信.{0,18}收.{0,18}慢 短信.{0,18}发.{0,18}慢 原来卡上 雷霆战机 时空猎人 部落冲突 电魂统军令 天天酷跑 智龙迷城 cntv 天气通 悠悠导航 潮百搭 炫耀字体 imac 唱吧 play商店 京东商城 谷歌商店 k歌达人 斗鱼 雷霆战机 酷我 开心消消乐 慢慢想 手机卡放 樱花卡 触.{0,18}屏.{0,18}没.{0,18}反应 (键|健).{0,18}(不灵|没反应) sim 网络 網絡 网速 網速 wifi 移动卡 联通卡 银行卡 t卡 sd卡 拉卡拉 信号卡 3g.{0,3}卡 4g.{0,3}卡 掉卡 ViP电影卡 国外的卡 换卡 明明有卡 把卡拿 在卡上 皮卡丘 跑跑卡丁车 换了一下卡 上原来的卡 cd卡 退卡 咔咔声 uim 没有卡 移动.{0,7}卡 联通.{0,7}卡 手机卡上 手机卡里 和包刷卡 显示什么卡 插上卡 换了个卡 凤凰视频 捕鱼达人 兴业优理宝 两张卡 手机卡里 触.{0,18}屏.{0,18}没.{0,18}反应 (键|健).{0,18}(不灵|没反应) (3G|三G)b sim 网络 網絡 网速 網速 wifi 移动卡 联通卡 银行卡 t卡 sd卡 拉卡拉 信号卡 (3G|三G).{0,3}卡 (4G|四G).{0,3}卡 掉卡 ViP电影卡 国外的卡 换卡 充電.{0,18}慢 充电.{0,18}慢 更新慢 慢镜头 下载慢 双卡 卡刷 3D卡 更新.{0,18}慢 电信卡 网络卡 售后.{0,18}速度.{0,18}慢 信号.{0,18}慢 会员卡 上网.{0,18}慢 日本卡 我机卡 卡通 时间.{0,18}慢 最慢.{0,18}调至 手机卡.{0,18}存储 TF卡 识别.{0,18}内存.{0,18}卡 外置内存卡 内置内存卡 电话卡 内存卡 卡拉ok 流量.{0,18}慢 电话卡 插卡 拔卡 效率.{0,18}慢 下.{0,18}慢 外置卡 卡乐付 时钟|时间.{0,18}变慢 网速|网页.{0,18}慢 下载.{0,18}慢 显卡 wifi|wlan.{0,18}流畅 流畅版 流畅性 门禁卡 慢录像 卡在下载 双卡 2卡 3卡 4卡 单卡 读卡 网.{0,18}慢 网.{0,18}卡 换一张卡 VIP卡 金士顿卡 电信的卡 服务.{0,18}慢 上网.{0,18}迟钝 公交卡 声卡 储存卡 电.{0,18}冲.{0,18}慢 在线视频.{0,18}卡 无线连接.{0,18}慢 卡槽 网页.{0,18}加载 上網反映.{0,18}慢 聯通 无卡 升级.{0,18}慢 散热.{0,18}慢 (4G|四G).{0,18}慢 WLAN sm卡 保修卡 卡托 慢慢恢复 扩展卡 (不|无法)是卡 存储卡 反馈.{0,18}没反应 手机卡.{0,18}放进去 手机卡怎么插 拖卡 脱卡 慢快门 存卡 定位慢 取卡针);
#---------------------------------
my @KeywordsDie = qw(开机.*vivo 死机 假死 死了几次机 死機);
my @KeywordsDieExcl = qw(以为.*死机);
#---------------------------------
my @KeywordASZestart = qw(重启 自动从起 重复启动 就重启 自动开关机 自动重新启动 从新启动 自动关机开机 自动重起 自动开关机 重复启机 自动从启 自动重启 重复启机 反复开关机 自行开机 出现.*开机现象 关机.*又开机 自动关机.*开机 突然.*重.*启 无故重启 异常重启 老是重启 经常.*重启 无限重启 出现自动重启 自己.*重启 咋会重启 死机重启);
my @KeywordASZestartExcl = qw(自动重启播放 重.*启.*没.*用);#要重.*启 开机键.*重启 重启无效 需要重啟 换机重启 必须重新启动 要是重启 重启.*没事 下载好重启 重启没用 重启后才 重启后就);
#---------------------------------
my @KeywordsPoweroff = qw(出现关机 一.*就.*关机 玩.*关机 总是关机 自动关机 常关机 异常关闭 无缘无故关机 自己关机 突然.*关机 自己关机 动(不|无法)动关机 自行关机);
my @KeywordsPoweroffExcl = qw(重启 开机 没电自动关机 设置.*自动开关机);
#---------------------------------
my @KeywordsTouchPanel = qw(划屏幕 屏幕.*没.*反应 定屏 屏幕.*不.*灵 触屏.*(不|无法)灵 触摸 误触碰 滑动屏幕 划动屏幕 触屏 屏幕失灵 键(不|无法)灵敏 屏幕触控 屏幕.*(不|无法)受控制 屏幕.*失效 屏幕.*失灵 屏幕乱跳);
my @KeywordsTouchPanelExcl = qw(增加.*触屏.*震动 增加.*触摸 能触摸);
#---------------------------------
my @KeywordsLauncher = qw(屏幕.{0,18}条纹斑 昵称 壁纸 屏幕.{0,18}图标 开机.{0,16}头像 开机.{0,16}昵称 壁纸 乐享极致 時間桌面 时间桌面 时光轴 3D壁纸 (没|不|无法).*自动.*桌面壁纸 (换.*不|不.*换).*壁纸 壁纸库 (无|没)壁纸 横屏壁纸 待机时间 场景模式 桌面 launcher 时间轴 timeline 壁纸.*(不|无法)能换 动态壁纸 手机壁纸);
my @KeywordsLauncherExcl = qw(快捷方式 场景桌面 挂件 最好 能(不|无法)能 希望 改进 强烈要求 多来点 出多点 可(不|无法)可以 人性化一些 跪求 能否增加);
#---------------------------------
my @KeywordsblackScreen = qw(屏幕.*黑 黑屏 屏黑 屏幕.*变黑 );
my @KeywordsblackScreenExcl = qw(黑屏的情况下);
#---------------------------------
my @KeywordsupGrade = qw(升级在哪.{0,18}升 没法升级 无法更新系统 不能更新最新版本 更新了版本 root.*不.*更新 更行系统.*失败 系统.*更新.*不 昇级.*不 手机.*更新.*不 系统.*(无法|不).*更新 版本.*(更新.*不|不.*更新) 升级不.*系统 系统更新.*不 更新.*不.*版本 系统.*更新.*不 不.*自动升级 (如何|怎么)升级 系统.*不.*更新 更新失败 更新不.*系统 升级.*不 升不了级 無法.*升級 怎么.*升级 不.*升级 升级，升级.*不.*成功 升级.*失败 (不|无法).*升级 升级.*失效 升级(不|无法)了 升级(不|无法)成功 升级慢 升级升(不|无法)了 升(不|无法)了伋 无法.*升级 更新(不|无法)了.*系统 系统.*升(不|无法)了级 系统.*更新失败 刷机(不|无法)成 (不|无法)能.*升.*級 升级.*后 升完级 升级完);
my @KeywordsupGradeExcl = qw();
#---------------------------------
my @KeywordsvivoSpace = qw(vivo.*乐园 vivo.*家园 乐园);
my @KeywordsvivoSpaceExcl = qw();
#---------------------------------
my @KeywordASZellowScreen = qw(屏幕.*黄 黄屏);
my @KeywordASZellowScreenExcl = qw();
#---------------------------------
my @KeywordsflickerScrren = qw(闪.*屏 屏.*闪);
my @KeywordsflickerScrrenExcl = qw(闪退);
#---------------------------------
my @KeywordsScene = qw(场景桌面 虚拟桌面 x空间);
my @KeywordsSceneExcl = qw();
#---------------------------------
my @KeywordsWidget = qw(挂件 widget);
my @KeywordsWidgetExcl = qw();
#---------------------------------
my @KeywordsCamera = qw(人脸美妆 快门键 相機 水印 燥点 照像 拍视频 闪光灯.*(失效|打不开) 专业模式 全景照片 照片 像素 拍摄 全屏.*拍 拍照 相机 连拍 照相 录像 摄像 摄影 拍.*照 自拍 对焦 背景虚化 盲拍 美颜 光学防抖 照片.*虚影 夜景模式 极速忙拍 极速盲拍 噪点 视频录像);
my @KeywordsCameraExcl = qw(照片上传 照片下载 介绍.*拍照 360相机 美颜相机 美人相机);
#---------------------------------
my @KeywordsPhone = qw(电话界面 号码归属地 拨号 电话响 电话.{0,18}打不进 电话.{0,18}接通 号码归属地.*不.*识别 一键拔号 视频通话 视频同话 (来.*电|来.*电).*报号 视频聊天 通电话 通话 打电话 呼叫 接電話 打電話 来电话 免提 打.*电话 接.*电话 来电 电话.*打.*出去 来电 去电 视频语音 挂电话 电话.*异常 电活 电话打进来 电话.*拨.*出去 打电话);
my @KeywordsPhoneExcl = qw(来电通 阿里通 微话 来电话闪光灯 通话.*没.*问题 来电秀 进去电 通话界面 打.*电话.*拦截 来电提醒.*怎.*关闭 打电话.*售后 来电背景.*难看 来电背景.*丑 出去电压);
#---------------------------------
my @KeywordsANR = qw(无反应 无响应 没反映);
my @KeywordsANRExcl = qw();
#---------------------------------
my @KeywordsStopRunning = qw(被停用 自己弹出来 频繁停止 突然.*停止 老是停止 已停用 打开就停止 退出运行 反弹出去 提示.*已停止 无限弹出 运行停止 停止運行 停止应行 强制停止 停止工作 停止运 崩掉 停止运用 停行 自己关闭 自动弹出来 为什么停止 一.*就.*关 停止使用 无缘故结束 直动关了 自动推出 突然停止 亭止运行 意外停止 自行退出 停运 告诉vivo 终止 崩溃 LOG LOG.*system 中止 自动关闭 软件.*强行关闭 sog.*system 停止运行 停止退出 自动强退 强制关闭 异常退出 直接退出 强行关闭 无故退出 自己退出 自动关闭 自动退出 软件.*停止 强行停止 意外关闭 异常关闭);
my @KeywordsStopRunningExcl = qw(暂停功能 崩溃啊 自动关闭bbe音效);
#---------------------------------
my @KeywordsExceptionQuit = qw(闪退 秒退 就退出);
my @KeywordsExceptionQuitExcl = qw(要退出 玩完退出 然后退出);
#---------------------------------
my @KeywordsCompatible = qw(兼容 软件(不|无法)能用);
my @KeywordsCompatibleExcl = qw();
#---------------------------------
my @KeywordsiMusic = qw(歌曲.{0,18}(切歌|暂停) 音乐播放器 切歌.*播放 下载.*歌曲  音乐 歌曲.*播放 听歌 音乐播放器 mp3.*系统播放器);
my @KeywordsiMusicExcl = qw(音乐关 音乐.*更新 音乐.*更丰富 音乐文件夹 制作音乐 酷狗音乐 天天动听 天天静听 QQ音乐 酷我音乐 百度音乐 多米音乐 千千静听 虾米音乐 音乐信息 音乐图片 imic google音乐播放器);# 音乐手机);
#---------------------------------
my @KeywordsiVideo = qw(自带.{0,18}播放器.{0,18}(播|放).{0,18}MV 电影 视频 视屏 拷贝视频 720p.*mkv.*系统播放器);
my @KeywordsiVideoExcl = qw(拍视频 优酷视频 传视频 编辑视屏 超清影院 视频电话 百度视频 搜狐视频 PPS 爱奇艺 暴风影音 迅雷看看 上网.*视频 视频语音 开讯视频 视频聊天 视频通话 接视频 录视频 合成视频 (photo+).*视频 下载视频 腾讯 qq 视频歌 720视频 视频录像);
#---------------------------------
my @KeywordsAudio = qw(双麦降噪 双麦消噪 暴音 静音模式 听筒 好小声 耳机 电波声 喇叭 聽不.*聲音 聲音 srs 蓝牙.*声音 回音 耳机.*发声 语音.*问题 扬声器 铃声渐强 发.*语音 破声 电流声 没有声音 爆音 听(不|无法)清 没声 音量底 无声 无音 声小 声大 卡音 杂音 破音 底燥 底噪 噪音 声音(不|无法)清晰 音质 听(不|无法)清楚 刺耳 没有声音 时小时大 没声音 声音.*小 声音.*大 通话音 铃音 音量 声音 外音 听简 喇叭音杂 低音 滋滋.*声);
my @KeywordsAudioExcl = qw(音量键 选择音质 音量调节键);
#---------------------------------
my @KeywordsiGuard = qw((弹|出现).*广告 网购保护 系统.*缓存.*删 拦截.*号码 省点模式 省电模式 i管家 一键清理 一键加速 白名单 加速黑名单 超级省点 自带.*管家 管家 超级省电);
my @KeywordsiGuardExcl = qw(腾讯.*管家 360.*管家 百度.*管家 别说用.*管家);
#---------------------------------
my @KeywordsBrowser = qw(浏览器 流览器 游览器);
my @KeywordsBrowserExcl = qw(QQ浏览器 百度浏览器 UC浏览器 猎豹浏览器 es文件浏览器);
#---------------------------------
my @KeywordsAppStore = qw(软件商店 应用商店);
my @KeywordsAppStoreExcl = qw();
#---------------------------------
my @KeywordsStatusBar = qw(顶栏图标 下拉 快捷栏 流量显示 快捷键 下拉栏 下拉菜单 屏幕旋转 取消横屏 电量.{0,18}显示 重力感应 设置横屏 关闭横屏 切换横屏 横竖切换 移动旋转 转屏 关闭屏幕旋转 关掉横屏 自动旋转屏幕 显示.{0,18}电量 电量显示 竖屏.*锁定 没.*电量.*显示|电量.*百分比|电量.*百分百|电量.*现实|百分数.*显示|百分比.*电量|电池.*百分比|電量顯示|电源百分比 竖屏.*无效 快捷方式 下拉悬停 自动.*横屏 状态栏 通知栏 横屏上.*拉 任务栏 横屏下.*拉 上拉菜单 上划起来 底栏 提示栏);
my @KeywordsStatusBarExcl = qw();
#---------------------------------
my @KeywordsContact = qw(联系人 通讯录 谷歌服务);
my @KeywordsContactExcl = qw();
#---------------------------------
my @KeywordsMMS = qw(已读 未读 信息.*语音播报 短信 重复收 信息悬浮窗  sim卡信息 信息应用 加密短信 彩信 信息.{0,18}顺序.{0,18}乱);
my @KeywordsMMSExcl = qw(使用信息 (QQ)*.*微信.*信息 天气信息 设备信息 电话.*信息 短信.*拦截 信息弹窗 信息停止运行 信息流 短信加密 音乐信息 短信设置 希望短信 短信界面 短信闪光灯 优化.*短信 如果短信 允许.*短信 短信.*棒 短信呼 短信通知);
#---------------------------------
my @KeywordsEmail = qw(邮件 email 电子邮箱 gmail 邮箱);
my @KeywordsEmailExcl = qw(QQ邮箱);
#---------------------------------
my @KeywordsFileManager = qw(文件管理 存储模式 文件夹);
my @KeywordsFileManagerExcl = qw();
#---------------------------------
my @KeywordsIME = qw(打字 五笔 输入法 输入.*问题 键盘 文字.*输入 打不出字 数学符.*(乘号|除号));
my @KeywordsIMEExcl = qw(讯飞输入法 必应输入法 搜狗输入法 百度输入法 更换皮肤 必应输入法  讯飞输入法);
#---------------------------------
my @KeywordsWeather = qw(天气 weather);
my @KeywordsWeatherExcl = qw(天气插件 墨迹天气 "天气" 天气通);
#---------------------------------
my @KeywordsNotes = qw(便签);
my @KeywordsNotesExcl = qw();
#---------------------------------
my @KeywordsCalc = qw(计算器 计数器.*(加|减|乘|除));
my @KeywordsCalcExcl = qw();
#---------------------------------
my @KeywordsCinema = qw(超清影院 VIP电影 高清电影 VIP卡);
my @KeywordsCinemaExcl = qw();
#---------------------------------
my @KeywordsEbook = qw(电子书 电纸书 電子書);
my @KeywordsEbookExcl = qw(掌阅电子书);
#---------------------------------
my @KeywordsNetSignal = qw(sim卡.{0,8}识别 识别.{0,8}sim卡 网页.{0,18}打不开 网.{0,18}掉 数据连接不 网咯 sim卡不可用|sim卡不能用 信號.{0,18}差 联网 信号.*差 联网.*断 不联网 上网.*断 数据流量.*慢 信号差 GPR.*S 上网 沒.*信號 网络不稳定 网.*连.*(不|无法)上 上网.*漫 段网 信号 网速 網速 網絡 (2G|两G|二G) (3G|三G) (4G|四G) 三g 掉线 网络 没有网 移动网络 丢网 断线 CMCC 弹网 上(不|无法)了网 玩(不|无法)上网 上.*网.*打(不|无法)开 下载.*慢 下裁.*慢 网页打(不|无法)开 (不|无法)能联网 进网.*慢数据无联接 上网.*慢 断网 网页.*慢 联(不|无法)上网 没有讯号 卡在下载 掉网 (不|无法).*上网 上网.*(不|无法) (不|无法).*上网 下载(不|无法)了 打开网络.*设置 连(不|无法)了网 蜂窝数据网 联网失败 网上连接错误 无法连接服务器 连接(不|无法)上服务器);
my @KeywordsNetSignalExcl = qw(信号图标 网购保护 网络格式 wifi.*信号 16G 3(2G|两G|二G) 6(4G|四G) (2G|两G|二G)内存 (3G|三G)内存 (4G|四G)内存 网络科技 显示网速 网络切换 23g);
#---------------------------------
my @KeywordsWifi = qw(无线信号 waifi wlife wlan连.*(不|无法)上 wifi wlan 无线网 wiflan Wi－Fi wi.*fi wf信号 无线 wife);
my @KeywordsWifiExcl = qw(OK wifi万能钥匙 wifi万能解锁  wifi.*快捷按钮 便捷开关.*wifi  wifi伴侣 只能用无线 wife万能);
#---------------------------------
my @KeywordsGps = qw(gps 导航 定位 实景导航 AR.{0,18}navi);
my @KeywordsGpsExcl = qw(导航栏 软件(不|无法)见了.*导航 高德导航 悠悠导航 老虎地图);
#---------------------------------
my @KeywordsBluetooth = qw(bluetooth 蓝牙);
my @KeywordsBluetoothExcl = qw(便捷开关.*蓝牙);
#---------------------------------
my @KeywordsFingerprint = qw(指纹 后.*触.*解锁 指紋);
my @KeywordsFingerprintExcl = qw();
#---------------------------------
my @KeywordsOTG = qw(otg);
my @KeywordsOTGExcl = qw();
#---------------------------------
my @KeywordsSmart = qw(皮套.{0,18}亮屏 手势拨号 智能声控 悬浮多任务 双点屏幕 (划|画|滑).{0,18}(m|o|w) 声控接听 智能暂停 智能拨号 (保护盖|保护套|手机套).*亮屏.*(失效|不.*灵) smart.*wake 语音接听 语音挂断 智能通话 智能窗口接电话 智能接听 双击 智能亮屏 摇一摇 隔空 体感 智能感应 手套模式 喚醒 熄屏手势 屏幕换.*醒 智能唤醒 多屏互动 隔空操作 空中轨迹 语音唤醒 air.*wake);
my @KeywordsSmartExcl = qw(双击放大 双击熄屏 双击现象);
#---------------------------------
my @KeywordsLightTuning = qw(亮度 暗 忽暗忽亮);
my @KeywordsLightTuningExcl = qw();
#---------------------------------
my @KeywordsFlowrate = qw(流量监控);
my @KeywordsFlowrateExcl = qw(要是有.*流量 流量.*下载.*软件);
#---------------------------------
my @KeywordsTime = qw(显示时间 日期.{0,18}不相符 (时间|日期).{0,18}自动修改 自动对时.*不 时钟.{0,8}慢 时钟.*(不|无法)准 时间.{0,8}慢 时间.*(不|无法)准 自动对时.*(不|无法)准 时间.*(不|无法)对 时间.*错 时问.*慢);
my @KeywordsTimeExcl = qw();#时间长 时间短 时间太短 短时间 一段时间 时间轴 长.*时间 时间.*长 月时间 年时间 第一时间 等待时间 时间.*缩短 只显示时间 总时间 没有.*对时 时间条 歌曲时间 延长.*时间 时间模式 月的时间 年的时间 换机时间 时间(不|无法)够 时间水印);
#---------------------------------
my @KeywordsAccount = qw(密码.*忘 帐号 账户 用户名 帐户 账号 忘记密码 密码.*改.*不 密码.*不.*改);
my @KeywordsAccountExcl = qw(给个帐号 建行客户端);
#---------------------------------
my @KeywordsMiniscreen = qw(小屏);
my @KeywordsMiniscreenExcl = qw();
#---------------------------------
my @KeywordsGame = qw(使命召唤 神秘之剑 汤姆猫 天天风之旋 火线指令 密室逃脱 开心消消乐 小小帝国 狂野飙车 刀塔传奇 暖暖环游世界 海岛奇兵 崩坏学院|崩坏学园 仙剑奇缘 去吧皮卡丘 跑跑卡丁车 狂野飙车8 古树旋律 连连看 糖果传奇 玩现代战争5 天天风之旅 疯狂猜成语2 迷你帝国 酷酷爱魔兽 时空猎人 部落冲突 电魂统军令 天天酷跑 智龙迷城 雷霆 三国杀 真实赛车3 准游泳 国际足球大联盟 刀塔世界 神将传奇 求合体 史上最难的游戏 放开那三国 葡萄游戏厅 布丁怪兽 游戏 极品飞车 酷跑 飞机 时空猎人 爱消除 天天 格斗 背刺 全民 地主 神魔 飞车 节奏大师 僵尸 麻将 时空腊人 梦幻西游 红警 侠盗 nba 剑魂之刃 雷霆战机 无尽之剑 部落战争 我的世界 小黄人快跑 小黄人 消灭星星);
my @KeywordsGameExcl = qw(快捷方式 游戏中心 天天动听 天天面对);
#---------------------------------
my @Keywords3Party = qw(金山快盘 煲汤大全 中华万年历 方正行书 facebook 雅思听力宝 老虎地图 wifi万能解锁 谷歌电子市场 谷歌电子商店 建行手机支付 谷歌键盘 wife万能 风云直播 imic 自带录音棚 豆瓣 谷歌 单词锁屏 讯飞输入法 全国违章查询 易汇通 大姨妈 茄子快传 天猫 偶像祭 元贝驾考 cntv 来电通 必应输入法 挂q google 电子市场 google星空地图 凤凰新闻 网易新闻 拉卡拉 快播 百度云盘 wifi万能钥匙 百度视频 高德 建设银行 梦森林 芒果tv wifi伴侣 谷歌市场 钱盒商户通 音悦台 cntv 天气通 悠悠导航 潮百搭 炫耀字体 imac 唱吧 play商店 京东商城 谷歌商店 合地图 乐视 导航犬 扣扣 qq 微信 腾讯 陌陌 旺信 微话 影院 迅雷看看 YY语音 土豆 酷狗 快牙 新浪 银行 证券 网易 搜狗 唱吧 京东 google.*play 美拍 阿里通 墨迹 天天动听 中国象棋 ireader 银河玖乐 爱奇艺 PPTV 百度 搜狐 象棋 暴风 DIY主题大师 掌阅 淘宝 优酷 糗事百科 迅雷 微博 滴滴打车 谷歌地球 360相机 美颜相机 美人相机 es文件浏览器 铁友火车票软件 掌上猫扑 UC浏览 别踩白块 91助手 豌豆荚 建行客户端 酷我音乐 皮皮 小影 支付宝钱包);
my @Keywords3PartyExcl = qw(快捷方式 qq版 qq游戏 超清影院);
#---------------------------------
my @KeywordsCloudService = qw(云备份 云服务 云盘 云同步);
my @KeywordsCloudServiceExcl = qw();
#---------------------------------
my @KeywordsCharge = qw(充不满 充.*電 充电 充.*电 冲.*电 电.*充(不|无法)满 电冲(不|无法)满);
my @KeywordsChargeExcl = qw();
#---------------------------------
my @KeywordsScreenShot = qw(截.{0,18}屏 截.{0,18}图 載.{0,18}屏 載.{0,18}图 截.{0,18}圖 怎么截 捕捉.{0,18}屏幕 此图已截);
my @KeywordsScreenShotExcl = qw();
#---------------------------------
my @KeywordsAlarm = qw(闹钟 闹铃 语音播报);
my @KeywordsAlarmExcl = qw();
#---------------------------------
my @KeywordsPhotojia = qw(photo.*\+ photo的那个应用 phto.*\+ photo.*数据连接 Phopo+ poto+);
my @KeywordsPhotojiaExcl = qw();
#---------------------------------
my @KeywordsiTheme = qw(i主题 主题);
my @KeywordsiThemeExcl = qw();
#---------------------------------
my @KeywordsHIFI = qw(HIFI fihi);
my @KeywordsHIFIExcl = qw();
#---------------------------------
my @KeywordsLockScreen = qw(解锁 锁屏 锁屏.{0,18}头像 划不屏 (保护盖|保护套|手机套).{0,18}(熄屏|灭屏|锁.{0,18}屏) 锁.*屏.*解锁.*花屏 开锁.*黑屏 解锁.*密码 锁屏.*下拉.*(相机|拍照) 图案解锁 锁屏界面 锁屏.*天气.*没 (锁屏|黑屏).*拍照 (合|盖).*套.*不.*(锁屏|息屏|熄屏) 锁屏.*提示 锁.*屏.*失效 屏.*锁.*失效 锁屏.*节日.*壁纸 锁屏.*天气 锁屏.*(不|无法).*灵敏 锁屏壁纸 锁屏.*音乐.*天气.*界面 锁屏.*动态天气.*图案 锁屏.*天气.*音乐.*界面 锁屏.*(不|无法)会.*小屏 自动锁屏.*(不|无法) 自动锁屏.*无法 无法.*自动锁屏 (不|无法).*自动锁屏 锁屏.*样式.*无法|锁屏.*样式.*(不|无法) 锁屏.*播放.*音乐 锁屏.*音乐.*停止 竖.*锁屏 锁屏.*声音.*大 锁屏.*无反应 锁屏.*头像 一键加速.*自动锁屏 锁屏.*屏幕.*自动.*亮 横屏.*锁屏 竖.*锁屏 锁屏.*壁纸 锁屏.*没声 锁屏.*无声 锁屏.*(不|无法)解锁 锁屏.*小键盘 锁屏.*亮屏 锁屏时间.*(不|无法)准确 锁屏.*自动 锁屏.*没.*唤醒 锁屏.*换(不|无法)了 皮套解锁 密码锁屏.*问题 锁屏.*断网 异常锁屏 锁屏.*播放 锁屏.*(不|无法).*信号 锁屏.*没信号 无缘无故.*锁屏 密码锁屏.*锁(不|无法)上 人脸锁屏.*黑屏 锁屏.*信息.*(不|无法).*接收 锁屏.*(不|无法).*信息 自动锁屏 锁屏.*(不|无法)兼容 锁屏.*反应);
my @KeywordsLockScreenExcl = qw();
#---------------------------------
my @KeywordsGallery = qw(图库 相册 照片 图片 文件.*丢失 隐私空间 私密空间 存储.{0,18}(找不到|失踪|消失|没了) 相片 文件.{0,18}不见了);
my @KeywordsGalleryExcl = qw(相机);
#---------------------------------
my @KeywordsFlashlight = qw(手电 电筒);
my @KeywordsFlashlightExcl = qw();
#---------------------------------
my @KeywordsFM = qw(FM 收音机);
my @KeywordsFMExcl = qw();
#---------------------------------
my @KeywordsFont = qw(字体 字.{0,12}小);
my @KeywordsFontExcl = qw();
#---------------------------------
my @KeywordsSD = qw(SD 存储卡 储存卡 U盘 内存 储存设备 存储设备 软件搬家 安装);
my @KeywordsSDExcl = qw();
#---------------------------------
my @KeywordsScreenBright = qw(调节亮度 调节亮度 太亮 屏幕.*(亮度|忽明忽暗|亮.*暗|暗.*亮) 手机.*(亮度|忽明忽暗|亮.*暗|暗.*亮) 滑屏.{0,18}暗一下 时亮.{0,18}时暗);
my @KeywordsScreenBrightExcl = qw();
#---------------------------------
my @KeywordsVibration = qw(震动 振动);
my @KeywordsVibrationExcl = qw();
#---------------------------------
my @KeywordsVivoice = qw(vivoice vivo.*语音助手 智能语音 语音助手);
my @KeywordsVivoiceExcl = qw();
#---------------------------------
my @KeywordsCalendar = qw(日历);
my @KeywordsCalendarExcl = qw();
#---------------------------------
my @KeywordsNFC = qw(NFC);
my @KeywordsNFCExcl = qw();
#---------------------------------
my @KeywordsROOT = qw(root);
my @KeywordsROOTExcl = qw();
#---------------------------------
my @KeywordsGameCenter = qw(游戏中心);
my @KeywordsGameCenterExcl = qw();
#---------------------------------
my @KeywordsVisitorPattern = qw(访客模式 安全模式);
my @KeywordsVisitorPatternExcl = qw();
#---------------------------------
my @KeywordsUSB = qw(USB UXB 手机.{0,18}连.{0,18}电脑);
my @KeywordsUSBExcl = qw();
#---------------------------------
my @KeywordsVivoCommunity = qw(vivo社区);
my @KeywordsVivoCommunityExcl = qw();
#---------------------------------
my @KeywordsKMusic = qw(天籁 K歌);
my @KeywordsKMusicExcl = qw(K歌之王);
#---------------------------------
my @KeywordsSoundRecord = qw(录音);
my @KeywordsSoundRecordExcl = qw();
#---------------------------------
my @KeywordsEyeRecognition = qw(眼球 眼睛.{0,18}(识别|解锁|认别|加密) 人眼.{0,18}(识别|认别|加密|解锁));
my @KeywordsEyeRecognitionExcl = qw();
#---------------------------------
my @KeywordsDiaoqi = qw(漆 边框 脱色 掉色 掉.*颜色 退色 褪色 vivo标志.{0,18}掉);
my @KeywordsDiaoqiExcl = qw(换边框);
#---------------------------------
my @KeywordsSuggestion = qw(期待加入 弄个.*什么的 情添加 请添加 我觉得 4.4 最好 如果有.*就好了 能(不|无法)能 希望 改进 强烈要求 多来点 出多点 想取消 可(不|无法)可以 人性化一些 跪求 能否增加 应显示 自定义 希望采纳 有.*就.*完美 能否 期望增加 可以增加 能.*就完美了 要求 要是有.*就好了);
my @KeywordsSuggestionExcl = qw(希望.*改进);#希望解决 耗电 发热 性能 死机 重启 自动关机 无响应 停止运行 闪退 兼容性 网络信号 WIFI GPS 时间(不|无法)准 HIFI 掉漆);
#---------------------------------
my @KeywordsQuestion = qw(什么意思 怎么去掉 怎么搞 怎么办 在哪 如何 干什么的 哪里 有没有 请问 原因 是什么 问问 区别 可以.*吗 能.*吗 怎样 咋用 这么用 忘记 \? 是哪个.*啊 要注意点什么 怎么样才能 什么意思 怎么);
my @KeywordsQuestionExcl = qw();
#---------------------------------
my @KeywordsComplain = qw(垃圾 差 烂 mlgb 他娘的 (不|无法)好 遗憾 很少 太少 太小 无爱 严重 你妈 (不|无法)人性化 难看 失望 (不|无法)给力 太丑了);
my @KeywordsComplainExcl = qw();
#---------------------------------
my @KeywordsSatisfied = qw(赞 满意 手机可以 很棒 加油);
my @KeywordsSatisfiedExcl = qw();
#---------------------------------
my $dir = getcwd;
my $workbook;
my @editionArray = qw(0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0);	#预留了20个版本
my $arrSize = $#editionArray;	#the size of array, arraysize-1;
my $pageNum = 2;	


 
#二级分类TAG
@TAGSERIESSecond = qw(耗电 看视频耗电 听歌耗电 玩游戏耗电 耗电异常快 待机比正常使用更耗电 晚上睡觉耗电严重 电量显示不准 媒体服务器晚上自启动导致耗电非常快 电量显示跳变到很小重启后又跳变到很大(比如85%到5%重启到80%)
发热 新闻发热 上网发热 听筒发热 听音乐发热 屏幕发热 游戏热 充电热 看视频热 保护套发热 下载视频发热 电池后盖发热 前摄像头发热 发热很快 指纹识别器经常发热 相机使用很快发热
系统性能 切歌慢 vivoice慢 相机专业模式卡 i视频卡 相机聚焦卡 触屏卡 上滑通知栏进程序卡 开机卡 关机卡 升级卡 OTG卡 听歌卡 横屏卡 收音机卡 来电没反应 安装慢 划屏卡 打开文件夹卡 看视频卡 重力感应没反应 联系人拨号卡 删照片卡 相机打开卡 后台下载时手机变卡 桌面滑动卡顿 i管家内存清理时卡顿 i音乐播放卡顿 玩游戏卡顿 闹钟使用时卡顿 输入法卡顿  相册打开照片慢 内存占用率高清理也没用 壁纸滚动卡顿 亮屏迟钝 超级省电功能开关迟缓 锁屏后解锁迟钝好久才反应 一个界面文件夹打开多了会卡 自带浏览器浏览网页卡顿 锁屏界面天气全屏闪电会卡 图库看gif很卡 从相机直接到相册卡 相机拍照反应迟钝 卸载软件画面迟缓 语音助手启动太慢 手势拨号迟钝 320mp3格式i音乐播放卡顿 状态栏流畅度不好 打开软件变慢 点击发短信迟钝 手机开机时间长 打开短信卡死 解锁卡顿 电子书显示画面不流畅 智能接听迟钝 4K播放卡顿 访客模式切换明显卡顿
死机 触屏死机 i音乐死机 插数据线 听歌死机 玩游戏 拍照死机 photo+死机 视频死机 录像死机 闹钟响时一键加速死机 通话时死机 桌面待机死机 接电话触发死机 解锁的时候死机 打完电话死机 系统升级时死机 相机打开死机 开机死在开机vivo画面 充电一会就死机黑屏 闹钟响黑屏死机
重启 点关机图标重启 锁屏重启 u盘损坏重启 开数据连接重启 手电筒重启 通话重启 看视频重启 下载视频重启 开关数据连接时手机自动关机重启 音乐播放器重启 重启后停留在开机界面 拍照时手机重启 摄像时手机重启 看视频锁屏触发手机重启 蓝牙连接车载会重启 重启后下载的数据丢失 SD卡重启(非手机重启) 手机重启后软件丢失 开WAY重启 手机重启后游戏没了
自动关机 视频自动关机 通话自动关机 桌面开程序自动关机 玩游戏自动关机 手电筒自动关机 来电关机现象 使用VIVO闪传自动关机 听歌自动关机 自动关机后充电没反应 
触屏 屏幕有抖动现象 触屏桌面图标跳屏 触屏短时间间隔连续自动动作 触屏出错会多次点击 触屏太灵敏 触屏灵敏度差 触屏不校准 触屏失灵 打开护屏 触屏延迟 手机右边部分触屏无法使用 桌面滑屏抖动 触屏左侧绿点 玩游戏不支持多点触屏 屏幕下面按键按了没有震动声 有定屏现象 
桌面 动态桌面丑 timeline签名不能换 timeline壁纸不能换 壁纸不滑动 经典桌面切不回去 桌面便捷开关没有 timeline打不开 动态壁纸用不了 桌面场景切换不了 桌面图标误删怎么找回 主题桌面不返回 无法关闭桌面场景 桌面无法建立文件夹 不显示运营商 设置桌面循环不行 多余未读信息显示 手机壁纸不能全屏 桌面滑屏抖动 滑屏桌面时暗时亮 节日没有自动换壁纸 桌面壁纸换不了 壁纸库有壁纸但显示没有壁纸 桌面横屏壁纸不能用 没有timeline 手机待机时间短 时间轴没反应 3D壁纸用不了 重启后壁纸被换了 桌面的乐享极致怎么修改 Timeline怎么关 横屏游戏退出桌面也是横屏 不能设置滚动壁纸 桌面图标在锁屏解锁后会变位置 桌面滑屏闪屏 timeline丑
黑屏 打开图片黑屏 听语音贴黑屏 手机看到黑色方块显示不正常 玩游戏时黑屏 photo+打开黑屏 听歌黑屏 蓝牙连接汽车会黑屏 相机使用时黑屏 
升级 升级失败 升级后会曝出问题 升级慢 升级完不会自动重启 系统怎么升级 升级重启出现乱码再重启就好了
vivo乐园 vivo乐园或社区内不能注册同用户名账户 vivo乐园密码不能找回 vivo乐园账号无法登录 vivo乐园会自动退出 vivo乐园帖子打不开 vivo乐园论坛上不去 vivo乐园更新版本后原有账号不能登录 vivo乐园登录密码怎么修改 vivo乐园图片加载不了 vivo乐园打不开有网状态下提示无网络 vivo乐园不能发帖 vivo乐园进不去 vivo乐园不能注册 
屏幕发黄 最下面横条发黄 屏幕上下黄屏 屏幕有黄线 屏幕底端发黄 屏幕右上方黄条 屏幕白色底页面发黄 
闪屏 通话时闪屏 插充电器触发屏幕闪 闪屏后按键不好用 屏幕中间闪黑色或者蓝色 滑动屏幕会闪屏 
场景桌面 不能下载场景桌面 黑色的桌面不好看 不能取消场景桌面 
小挂件 小挂件日历不显示农历 日历挂件太丑了 
相机 相机夜景效果不好 相机照片模糊 前摄像打不开 莫名其妙拍照 相机水印花哨 相机没有变焦 前摄像头图片反 相机没有构图线 相机多噪点 相机专业模式不能放大 前摄像头有色点 相机全景也不能显示全条 相机全景照片不能储存 相机启动失败 美颜怪 相机无法调感光度 相机mov文件没有声音 相机对焦不准 相机HDR 相机录像会删其他照片 相机无法全屏 颜色失真 相机照片涂抹严重 相机照片黑斑 相机闪光灯失效 相机自动曝光不稳定 拍照不能横拍 相机近距离对焦不行 相机拍照照片自动删除 相机背景虚化快门延迟 相机背景虚化难对焦 极速盲拍太慢 相机不支持3D 相机4k摄像不亮 相机拍照夜间红眼 720视频摄像头无法关闭 语音拍照不灵敏 照相绿色 相机盲拍不能用 相机不能五连拍 相机的摄像麦克风灵敏度低 4K视频录像拖影 相机散光 相机前置拍照发白 相机前置颜色不真 视频录像无声音 后置摄像头抖动 相机专业模式进不了 相机打不开 相机拍摄的视频不能观看 美颜模式拍出的照片无美颜效果 拍照不能调整焦距 相机白平衡偏红 相机启动速度慢 相机前置美颜效果不给力 相机不能触屏拍照 黑线 摄像功能用不了 拍照变形很严重 前摄像头成像不好 点摄像直接卡死不动 相机有黑点 语音拍照不灵敏 相机自动白平衡不稳定 相机不能全屏拍摄 相机相册里面的照片会消失 前置摄像头正常拍摄出现哈哈镜效果 相机防抖功能效果不好 相机拍照键不灵敏 拍照完进不去相册 相机拍照闪光灯长亮关不掉 相机盲拍按两下不灵敏 照片不能多选后在上面打字只能一张一张的选 摄像头打开嗡嗡响并且画面浮动 相机像素低 相机拍照有浮点 拍照开不了补光灯 相机拍照摄像抖动严重呈现波浪图像 拍照效果不好 相机不能拍照 拍照完相册无照片 相机没有专业模式 相机拍照照片日期错误 手机不能摄像 相机摄像效果不真实 拍照的照片不显示时间 相机拍照不能拍gif图片 相机花屏 拍视频模糊 夜拍模式没有闪光灯 相机曝光功能怎么用 专业拍照模式怎么进去 相机侧按键拍照不灵 相机左下角偶尔要点两次才能进入 专业拍照模式怎么切回正常模式 相机进不了相册 前置摄像头对焦慢 相机拍出来照片上传后图片有明显美图痕迹 相机水印不能用 相机没有儿童模式，文档矫正，背景虚化，运动模式中的几种 相机不停重启用不了 微距拍摄在哪里 拍照有眩光 相机启动无画面 相机美颜不能用了 相机照相差 相机开启最大亮度后亮度暗 相机手动对焦失败 相机视频拍摄不能追焦要一直手动对焦
通话 无热感应 来电显示不好看 通话无来电语音播报 免提不能通电话 通话时断时续 通话打完屏幕一直是黑 通话打不出 通话无来电闪光灯 通话断线 通话不能自动拨号 不能拨打视频电话 来电不能识别联通185 不能取消来电语音提示  通话屏幕时亮时不亮 怎么设置来电大头贴 通话后不能转屏 拨电话黑屏 接电话黑屏 通话完挂不掉 接不到电话 不能设置通话背景 通话有回音 通话自动录音会自动停止 免提打电话会自动切换到听筒 戴手机套的时候不能接打电话 经常性来电会提示对方自己手机已关机 视频聊天摄像头效果差 通话设置不能拒接所有来电 来电呼叫转移不能用 通话时对方听不清楚 来电没有LED灯 没有电话信号 手机偶尔不能拨号没反应 通话时自动挂掉 拨电话自动挂机 很多来电不识别来电归属地 怎么关掉电话语音播报 听筒听不到对方说话只能按免提 通话记录部分不显示 一键拔号无效 无来电报号开关 怎么视频通话 来电没有显示号码 蓝牙耳机通话断断续续 通话对方听不见 通话记录不能单独删除一条记录 通话没接通但是会继续显示通话时间 没有通话记录 通话时间太长后屏幕不亮不好挂 通话完显示无SIM卡 所有来电都不显示号码 通话记录显示乱了 来电黑屏 通话有回声 来取点不显示名字 通话插耳机耳机键无效
无响应 插TF卡无响应 浏览器无响应 相机无响应 
停止运行 logSystem停止运行 i音乐停止运行 玩游戏停止运行 电子书停止运行 i主题停止运行 浏览器停止运行 手机管家隐私空间停止运行 相机停止运行 谷歌服务停止运行 音乐播放器停止运行 vivo乐园停止运行 换壁纸触发停止运行 升级时停止运行 状态栏停止运行 输入法停止运行 手电筒停止运行 天气预报停止运行 i管家停止运行 短信停止运行 联系人停止运行 i视频停止运行 隐私加密图片打开崩溃 i视频在线点播停止运行 google停止运行 点击设置中的个性搭配停止运行 场景桌面点在线停止运行 切换专业模式停止运行 软件商店停止运行 photo+录制完视频停止运行 相册停止运行 vivo闪传停止运行 photo+退出运行 日历停止运行 录音暂停一会就自动退出 桌面停止运行
闪退 I管家闪退 浏览器闪退 文件管理闪退 相机专业模式闪退 i管家在清理垃圾时闪退 一键加速后浏览器闪退 玩游戏闪退 相机闪退 手电筒闪退 天气预报闪退 相册闪退 i视频点击在线视频闪退 进入我的u盘闪退 i主题闪退 i音乐闪退
兼容性 锁屏和数字密码锁屏不兼容 耳机线不兼容 解锁样式密码不兼容 下载的主题和系统不兼容 线控不兼容 不能支持智能手环
i音乐 i音乐不支持QRC格式歌词 i音乐歌词显示不完整  i音乐铃声剪辑不行 i音乐播放延迟 i音乐歌词不能在桌面 i音乐歌词与歌曲不关联 i音乐歌曲搜不到 i音乐不能检索本地歌曲 i音乐播放自动斩停了 i音乐会自启 i音乐不能记忆播放 i音乐无损音乐卡顿 i音乐拍照完不能继续播放 i音乐BBE模式不能自启 i音乐bbe失效 i音乐音效设置会自动重置 i音乐歌曲重启播放 i音乐打不开歌曲 插上耳机触发自动播放音乐 I音乐会自动启动 i音乐经常自动关闭bbe音效 i音乐不能换肤 i音乐不能调整歌词 拍照的时候不能听歌 i音乐没有srs模式 i音乐不能批量处理 i音乐不能修改专辑图片 i音乐歌曲因为码率问题无法播放 i音乐扫描不出歌曲 下载后的音乐与I音乐同步触发重启 i音乐搜索歌曲没反应 i音乐不能播放 i音乐不能播放手机录音 i音乐无法分享给朋友圈 i音乐有些在线歌曲搜不到 下载后的歌曲关机后消失了 i音乐后台运行清理后自启 i音乐图标没了 i音乐下载的歌曲找不到 i音乐的歌曲太少了 i音乐没有主题 歌词不支持trc i音乐列表乱码 i音乐没有桌面歌词 i音乐不能自动下载歌词 设置退出i音乐会还原重新进入需要重新设置 i音乐不能淡入淡出 i音乐怎么添加音乐 一键清理i音乐重新播放 i音乐不能按字母快速查询
i视频 i视频的视频莫名消失 I视频会自动暂停 I视频不能显示mkv封装字幕 旧的flv格式视频播放一直黑屏 DTS音效打不开 I视频的rmvb无记忆播放 i视频打不开视频 i视频播放1G以上RMVB视频不能快进 不能播放哔哩哔哩视频 不能播放视频 I视频不支持外挂字幕 i视频播放时屏幕变暗 视频播放时屏幕忽暗忽亮 i视频不能播放MP4格式视频 i视频看视频不能亮度调节 i视频播放断断续续 悬浮窗视频看不了视频 i视频亮度低并且不能调节 i视频一开视频就变暗 720pmkv格式i视频播放花屏 缓存好的视频不能看 出厂视频删掉了怎么办 看电影时声音和图像不同步 facebook下载的视频打不开 RMVB格式视频无法快进 i视频播放本地视频快进会卡 看视频声音和画面不同步 i视频应用程序删掉了怎么恢复 隐藏后的视频在哪
音频 音质不好 声音太大 听筒没声音 话筒没声音 杂音 外放声音不好 扬声器无声音 电波声 mov文件没有声音 耳机有噪音 无低音 听筒声音小 喇叭有噪音 播放多媒体没有声音 通话声音小 通话没声音 手机声音小 声音时有时无 手机没有声音 耳机两边音量不一样 通话时声音断断续续 通话时对方听不清楚 开关机没有声音 耳机不能音量调节 听筒声音小老年人听不到 声音自动调到最高 喇叭没声音 重低音听不出来声音好尖 铃声渐强关闭功能无效 通电话时对方会听到男声或者女声周围没人 视频快进咔咔声 多媒体音量小 耳机只有一个响换了也一样状态 语音时出现偶尔听不到现象 通话时有杂音 声音从听筒而不是从喇叭上放 扬声器不能开启 开HIFI高音太高有齿音 手机不能发语音 SRS低音音效需改进 蓝牙声音延迟 耳机拔掉仍显示连接 音效不能调 静音模式没有了 短信铃声有暴音 多媒体音量调节有时失效
i管家 I管家通话拦截不行 I管家短信拦截不行  I管家一键清理会关微信等必须应用 I管家一键加速会关微信等应用 I管家白名单失效 I管家黑名单不能用 I管家超级省电无效 I管家软件卸载无效 I管家无法获取root权限 I管家打不开 i管家下载第三方软件会提示SD卡异常 I管家的空间清理无法清理成功 i管家限制联网功能无效 i管家不能禁止自启动 i管家超级省电开启仍能上网 手机会自动弹出广告 i管家没有网购保护功能 i管家系统缓存删不掉 i管家能删掉吗 i管家一键加速时间很长 I管家内存清理界面点返回直接到桌面了 i管家不能隱藏圖片
浏览器 浏览器不缓存图片 浏览器下载提示退出失灵 浏览器连接失败 浏览器图片模糊 浏览器无痕浏览无效 浏览器不能下载图片 浏览器打不开 自带浏览器浏览网页慢 浏览器不支持断点续传 自带浏览器不显示图片 浏览器显示出现错误 浏览器自动下载东西 浏览器不支持中文网址 浏览器不支持COOkie
软件商店 软件商店关不了自动开 软件商店停止通知 软件商店自动启动 软件商店极度恶心 软件商店下载的应用不能安装 软件商店打不开 清除缓存后打开软件商店一直载入 软件商店更新不了软件 软件商店下载完不显示下载 软件商店总是在后台运行清理不掉 软件商店下载东西会自动停掉不下载 软件商店应用下载失败 软件商店打开白屏反应慢
状态栏 状态栏快捷操作按钮太少了 状态栏没有电量百分比 状态栏底部有阴线 状态栏阴阳屏 状态栏长按HOME键无上拉菜单 状态栏没有GPS便捷开关 下拉上通知栏不方便 通知栏下滑不下来 状态栏顶部没有快捷开关 全屏模式无法拉动状态栏 玩游戏状态栏不能下拉 状态栏没有竖屏锁定 单手模式下拉通知栏不方便 通知栏网络显示不准确 上拉菜单太灵敏 状态栏不随应用颜色变 状态栏没有下拉悬停 竖屏锁定无效很多页面都会横屏 GPS之类的快捷方式怎么打开 上滑没有开关机快捷图标 通知栏图标显示为… 横屏上滑通知栏关闭应用不方便 上拉菜单屏幕闪烁 通知栏图标丑
联系人 联系人里面不显示联系人 联系人的人名查询不出 联系人数量忽多忽少 联系人编辑不能全屏手写 联系人查询号码无效 联系人姓名排序混乱 联系人不支持蓝牙导入 联系人谷歌服务被删除了 联系人号码丢失 联系人显示一直更新 联系人打不开 关机后SIM卡上联系人号码丢失 联系人图标没有了 通讯录的号码不能点击拨出去 联系人不能显示全部联系人 联系人丢失 联系人无法编辑 通讯录不能批量操作 怎么添加手机联系人 联系人可以加入公司职位吗 本地联系人删除了云备份的联系人也被删除了 联系人不能云端同步
短信 短信收不到 短信发不出  短信悬浮多任务删除不完全 短信延迟 短信无法批量删除 短信读不了 短信自动亮屏看短信并关闭没提示 短信重复接受 短信自动发送两条 无短信气泡 短信铃声不能用 短信不能用 写短信点不出输入法键盘 短信列表排序不正确 手机发不出彩信 手机下载不了彩信 发短信迟缓 短信图标消失 短信已读图标还在 怎么关短信语音播报 没有短信提示音 短信怎么设置背景 怎么删除云端短信备份 短信接收慢 短信第六行输入看不到被输入法键盘遮挡
电子邮件 电子邮件不能粘贴邮件地址 电子邮件不能同步自动删除 电子邮件打不开附带的.xls  电子邮件打不开附件 电子邮件收件人不能粘贴 电子邮件无法使用 电子邮件不能设置 gmail的exchange连不上 电子邮箱刷新不了 收件箱不能下拉收取邮件只能单独一个个收取
文件管理 文件夹大小排列不对 文件管理显示内存没有出厂说明的大 文件管理不能左右滑动 文件管理没有批操作 文件管理存储模式下不可用 不连接电脑会进入存储模式
输入法 输入法不能连续输入英文 输入法隐私信息无法输入 输入法中英转换状态无显示 输入法插入充电器键盘失灵 输入法字体太小 输入法没有清除功能 输入法无夜间模式 输入法有错别字 输入法无法切换第三方输入法 输入法点不出来 输入法联想功能太差 输入法打不出字 输入法数学符号无乘除号 输入法没有云输入 不兼容其他输入法经常切换回vivo输入法  vivo输入法和支付宝不兼容 默认输入法不能换皮肤 输入法字母乱跳
天气预报 天气预报没有语音 天气预报不准 天气预报无法更新数据 天气预报定位异常 天气无可用数据 闹钟天气预报地点不对 天气预报天气城市删除不了
便签 便签没有云端同步 
计算器 计算器没有乘号 计算器格式显示很假 计算器无历史记录功能 计算器没悬浮功能 计算器无双行显示 计算器丑
超清影院 超清影院离线下载不行 超清影院不能全屏  超清影院蓝光电影无法播放 超清影院vip收费 高清片源太少 
电子书 电子书无法启动 电子书自己就息屏 电子书删除数据才能才能再次使用 电子书打不开 电子书设置书签再进去无效 切换主题电子书图标一直不变 
网络信号 网络信号差 网络信号不显示网络标志 网络信号上网慢 网络信号掉线 网络信号无法连接 不支持4G 网络信号差电话不能用 有4G网络上不了4G 信号满格但是上网超级慢 没有2G模式 是否支持联通3G 3G网经常自动切换到2G网 4G网经常自动切换到2G 数据连接下下载很慢 如何用USB线共享电脑网络 3G网络差 4G网络在香港各区域皆不可用 打开数据网络右上角无显示 不能用联通4G 能否用4G 移动网络下载歌曲只能下载一半 大陆香港两地信号不能自动切换 手机无法显示sim卡 插3G卡显示2G流量 可以用联通卡吗
WIFI WIFI信号差 WIFI网络慢 WIFI连不上 WIFI会中断掉线 WIFI打不开 信号满格但是上网超级慢 wifi下比其他品牌加载图片慢 没有5G的wifi 
GPS GPS定位慢 GPS不准 GPS不能定位 GPS搜星慢 实景导航出错 ARNavi地图不准 
蓝牙 蓝牙耳机不能连接 蓝牙鼠标无法配对 蓝牙收不到设备 蓝牙不能听歌 车上蓝牙无法接听 蓝牙连接车载系统不同步联系人 蓝牙不能连接 蓝牙耳机搜索不到 蓝牙耳机连上不能听歌 蓝牙不能连接车载导航 蓝牙耳机无法智能声控 蓝牙耳机怎么用 蓝牙关闭后仍然显示连接 蓝牙开关在哪里 蓝牙没有智能声控
指纹 指纹解锁不灵敏  指纹怎么用 能不能用指纹解锁 
OTG OTG无法使用 OTG接64G显示USB设备损坏电脑连接正常 OTG插鼠标没输入键盘 otg连不上 
智能体感 智能体感摇一摇打开手电筒无效 智能窗口接电话无效 智能接听无效 智能体感无效 双击亮屏无效 智能亮屏无效 智能体感画o无效 智能体感画m无效 智能体感画w无效 智能感应无效 手套模式无效 智能唤醒无效 熄屏手势无效 屏幕唤醒无效 多屏互动无效 隔空操作无效 语音唤醒无效 智能体感上划解锁不灵敏 双击亮屏不灵敏 AirWake识别成功率低 摇一摇打开应用失灵 保护盖亮屏失效 声控接听无效 智能暂停功能不灵敏 双击亮屏有黑框 智能拨号怎么关掉 smartWake唤醒应用无效 语音接听无效 语音挂断无效 挂断电话双击唤醒屏幕不灵 手势拨号无法使用
流量监控 每月清零 流量监控不准 
时间不准 时间不准 开网络无法自动对时 自动对时不准 
帐号 谷歌账户登不上 游戏帐号忘记找不回 重复注册账号账户名显示不正确 账号密码找不回 账号密码忘了后不能修改 vivo账户注册不上 
小屏 小屏显示后背景不是原来的大屏 小屏不能调整大小 设置了不使用小屏小屏还是会跑出来 打开悬浮多任务没有小屏 悬浮窗口不能调节大小 小屏滑出概率低 小屏怎么打开 
游戏 玩游戏忽明忽暗的 游戏退出时屏幕有一半是黑的 不能安装游戏 游戏和谷歌不兼容 使命召唤 神秘之剑 汤姆猫 天天风之旋 火线指令 崩坏学院 海岛奇兵 小小帝国 暖暖环游世界 刀塔传奇 开心消消乐 狂野飙车 放开那三国 葡萄游戏厅 布丁怪兽 游戏 极品飞车 酷跑 飞机 时空猎人 爱消除 天天 格斗 背刺 全民 地主 神魔 飞车 节奏大师 僵尸 麻将 时空腊人 梦幻西游 红警 侠盗 nba 剑魂之刃 雷霆战机 无尽之剑 部落战争 我的世界 小黄人快跑 小黄人 消灭星星 斗地主 史上最难的游戏 求合体 神将传奇 刀塔世界 国际足球大联盟 准游泳 真实赛车3 三国杀 雷霆战机 智龙迷城 天天酷跑 电魂统军令 部落冲突 时空猎人 天天风之旅 疯狂猜成语2 迷你帝国 酷酷爱魔兽 
第三方软件 金山快盘 煲汤大全 中华万年历 方正行书 facebook 雅思听力宝 老虎地图 谷歌电子市场 谷歌服务 谷歌键盘 合地图 乐视 导航犬 扣扣 qq 微信 腾讯 陌陌 旺信 微话 影院 迅雷看看 YY语音 土豆 酷狗 快牙 新浪 银行 证券 网易 搜狗 唱吧 京东 googleplay 美拍 阿里通 墨迹 天天动听 中国象棋 ireader 银河玖乐 爱奇艺 PPTV 百度 搜狐 象棋 暴风 DIY主题大师 掌阅 淘宝 优酷 糗事百科 迅雷 微博 滴滴打车 谷歌地球 360相机 美颜相机 美人相机 es文件浏览器 铁友火车票软件 掌上猫扑 UC浏览器 别踩白块 91助手 豌豆荚 建行客户端 酷我音乐 皮皮 小影 支付宝钱包 京东商城 谷歌商店 play商店 炫耀字体 潮百搭 悠悠导航 天气通 cntv wifi万能钥匙 百度视频 高德 建设银行 梦森林 芒果tv wifi伴侣 谷歌市场 钱盒商户通 音悦台 
云服务 云服务密码丢失找不回来 云服务启动报错 云备份不能自动备份相册和便签 云备份还原信息不成功 云备份失败
充电 充电慢 充电充不满 充电时屏幕常亮 充电器拔掉显示 充电后满电没有提示 充电拔掉还显示充电中 电充满了还在显示充电 显示充电异常 充电充不进去 充电时发生漏电现象 充电过程中会停止充电 没充电时指示灯也会亮 关机充电有自动开机现象 充电拔掉没有提示音 无法使用移动电源充电 充满电不显示100% 插数据线充电漏电 怎么充电充电会进入存储模式 充电变绿色了不习惯
截屏 摇动手机不能截屏 手机怎么截图 截屏显示白屏 截屏画质变低 偶尔弹出此图已截
闹钟 闹钟语音播报功能失效 闹钟播放无有效天气数据 闹钟设置后开机不能自动启动 闹钟画面不显示 闹钟自选铃声响铃太短 正点闹钟不会报时 闹钟铃声太小 闹钟到时间不响 闹钟贪睡设置怎么关 怎么调闹钟声音 闹钟铃声怎么选择以及可以自定义吗 闹钟语音播报声音怎么调节 闹钟不能打开 闹钟语音播报在哪开 闹钟自动关闭
photo+ photo+不能重新安装 photo+像素低 photo+一直跳加载 photo+无法编辑 photo+不能用摩棒 photo+录视频剪切不了 photo+一直数据连接 photo+使用不了 photo+不能上传 photo+卸载了怎么恢复 photo+视频没上传会自动删除视频 软件商店里面没有photo+ photo+不支持100M视频 photo+拍的视频不能保存到手机 
i主题 I主题主题太少了 I主题没有分类 I主题更新慢 I主题丑到爆 I主题图片打开缓慢 I主题按键不返回 I主题切换不了 i主题字体应用只能改变汉字字体而字母数字改变不了 全局主题太少了不更新 i主题壁纸加载慢 i主题原始主题无法恢复 i主题不能和通话记录同步 i主题的简约风主题没了 i主题下载不了主题 i主题无法连接在线内容
HIFI 没有HIFI HIFI不支持第三方播放器 
锁屏 锁屏不灵敏 锁屏壁纸不能换 锁屏没有音乐天气界面 小屏状态锁屏不会小屏 不能自动锁屏 锁屏样式不能改 无法锁屏 锁屏会自动播放音乐 锁屏音乐会停止 竖着不能锁屏 锁屏后声音变大 锁屏没反应 锁屏头像不能换 一键加速后会自动锁屏 锁屏后屏幕自动亮 横屏会锁屏 竖屏会锁屏 锁屏无声音 锁屏后不能解锁 锁屏小键盘错位 锁屏时间不准确 锁屏不能唤醒 皮套解锁不行 密码锁屏不行 锁屏断网 异常锁屏 人脸锁屏黑屏 锁屏不接受信息 锁屏不兼容 上滑不解锁 锁屏节日壁纸在手机里面找不到 屏幕锁屏失效 来短信锁屏界面无提示 保护套盖上不熄屏 锁屏下拉拍照无法进入相机 打开锁屏壁纸被天气覆盖 锁屏后点不亮 锁屏解锁花屏 锁屏解锁密码忘记 图案解锁时错误解锁无限次 一键锁屏无效 锁屏状态下滑打开摄像头不灵敏 滑动解锁不能解锁 自动锁屏后自动关机 锁屏界面的昵称修改不了 两个手机贴一起自动解锁 亮屏时解锁图标不能显示
相册 加密相册打不开照片能打开视频 相册图片设置壁纸很慢 蓝牙传的图片在图库找不到 相册里面的截图没了 相册显示不出微视频 相册里面的照片突然没有了 相册打不开 相册的隐私空间进不了 照片加密后找不到了 微信图片保存后没有 相册不能看gif图片 图片保存后手机相册里面没有 相册裁剪在哪里 照片不能查看 图片加载慢 相册没有文件夹排序 相册的隐私空间没了 相册珍藏相册没了 相册照片不能移动
手电筒 手电筒自己灭掉 手电不能后台运行 震动模式下来短信手电筒自己亮 手电筒没了
收音机 FM不能用 没有FM FM收不到台 
字体 更换字体英文数字无效 字体少 没有工美彩刷字体 没有字体分格 字体小 字体没有繁体 怎么换字体 字体没有正楷体
内存和SD卡 SD卡无法读取 系统手机U盘或者SD卡经常损坏需要格式化 内存损坏组需要格式化 买的时候16G或者32G实际没有这么多内存 读卡慢 偶尔显示存储卡已拔出 存储状态不可用 怎么移动软件或者文件到SD卡 运行内存变大了 手机U盘应用卸载SD卡图标丢失
屏幕亮度 屏幕亮度不稳定 滑屏屏幕亮度暗一下 怎么关掉屏幕亮度调节 夜间屏不亮 看视频屏幕变暗 屏幕自动调节不会自动调 相机进入相册亮度不能调节
震动 震动声太小 无缘无故震动 
vivo语音助手 vivo语音助手没有武汉话 
日历 日历有些节气没有 日历日程不能选农历 日历农历无法设置提醒
NFC NFC怎么用 
ROOT 系统无法root 
游戏中心 游戏中心一直后台运行 
访客模式 访客模式不见了 访客模式smartWake失效 访客模式怎么退出 访客模式不能显示小插件
USB USB怎么连接电脑 USB连接漏电
vivo社区 不登陆账号可以浏览社区 登陆账号打不开网页 
天籁K歌 天籁K歌无耳返(开关已打开) 天籁K歌怎么连接麦克风 天籁K歌怎么录歌 天籁K歌插耳机时好时坏 天籁K歌点我的作品会停止运行 天籁K歌删了在哪下 天籁K歌音效无效 天籁K歌听不到自己声音 天籁K歌闪退 天籁K歌不能唱歌 天籁K歌不能听作品 天籁K歌声音小 天籁K歌没有KTV效果 天籁K歌怎么用 天籁K歌会卡歌 天籁K歌伴奏声音低 天籁K歌直播间没有耳返
录音 没有录音功能
眼球识别 眼球识别不能锁屏解锁 眼球识别如何使用 眼球识别应用太少 眼球识别信息如何更改 眼球识别失败 眼球识别密码怎么改 眼球识别不能用QQ
掉漆 边框掉漆 充电口掉漆 丝印掉漆 侧边掉漆 一个月就掉漆 外壳掉漆 中框掉漆 两端掉漆 插USB口的地方掉漆 插耳机的地方掉漆 没多久就掉漆  
建议 
问题 怎么样显示手机型号版本号 怎么设置时间? 怎么恢复出厂设置 多屏怎么用 支持联通4G吗 大型游戏不能玩 是不是旗舰机 photo+怎么使用 5模和3模的区别 出厂自带程序在哪里下载 怎么移动文件内容
抱怨 
满意);

#

#二级分类匹配字符串数组
#耗电
my @KeywordsBatterySecond = qw(影音|电影|电视|视频|连续剧|美剧 听歌|音乐|歌曲 游戏 满.{0,18}电.{0,18}(没|木有).{0,18}电|电.{0,18}快|耗电.{0,18}快|小时.{0,18}(耗|用).{0,18}电|电.{0,18}厉害|真是耗电|电量.{0,18}掉|电.{0,18}不.{0,18}耐用|充满电.{0,18}只剩|去.{0,18}%.{0,18}电|用电.{0,18}快|电掉.{0,18}快|百分之.{0,18}电|电池消耗|电不耐用|耗电.{0,18}大|掉电.{0,18}严重|不存电|电.{0,18}流逝|费电|电.{0,18}多|耗电严重|(没|木有)电|耗电|电(没|木有)了|电.{0,18}不够用|电.{0,18}自己.{0,18}光|电.{0,18}用.{0,18}不|电.{0,18}吊.{0,18}快|电池.{0,18}短|电.{0,18}不耐用|电池.{0,18}抗使|电.{0,18}耗|电池.{0,18}不|电.{0,18}用不|电池.{0,18}(没|木有).{0,18}电|不保电|電池.{0,18}不|电池续航|不耐电|电.{0,18}不经用|电量.{0,18}迅速.{0,18}少|电池.{0,18}用.{0,18}快|电池用不.{0,18}天|电.{0,18}不耐用|电量.{0,18}不行|电用.{0,18}快|电量.{0,18}差|电跑的.{0,18}快|电太费|电池.{0,18}差|放电很快|优化电池|电池.{0,18}弱|电.{0,18}降.{0,18}快|不住电|用电 待机.{0,18}(更|还|非常|特别) 晚上 电量.{0,18}显示.{0,18}(不准|异常不正确|不对) 媒体服务器.{0,18}(自.{0,18}启|自己.{0,18}开) %.*%重.{0,18}启.*(%|正常|回复|恢复));
$mergeArray[0]=@KeywordsBatterySecond;
#---------------------------------
#发热
my @KeywordsHeatSecond = qw(新闻 上.{0,18}网 听筒 音乐|听.{0,18}歌|歌曲  屏幕 游戏 (充.{0,18}电|冲.{0,18}电).{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的|发烫|发热|发熱) 影音|电影|电视|视频|连续剧|美剧 保护套|手机套|手机壳 下载.{0,18}(影音|电影|电视|视频|连续剧|美剧) 电池|背面|背部|后盖|后背|后面 前.{0,18}摄像头 (分钟|小时).{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的)|发热.{0,18}快 指纹.{0,18}(热|烫|温度|燙|熱|发烧|发汤|发炀|很汤|烧的) 相机|拍照|录像|照相);
$mergeArray[1]=@KeywordsHeatSecond;
#---------------------------------
#性能 34
my @KeywordsPerfSecond = qw(切.{0,18}歌 vivoice 相机.{0,18}(专业模式|专业拍照) (影音|电影|电视|视频|连续剧)|自带.{0,18}播放器.{0,18}(播|放).{0,18}MV 相机.{0,18}聚焦 触.{0,18}屏|点.{0,18}屏|屏.{0,18}触|屏.{0,18}点 上滑.{0,18}通知栏.{0,18}进.{0,18}程序|上滑 开机.{0,18}(慢|卡|迟钝) 关机.{0,18}(慢|卡|迟钝) 升级.{0,18}时 OTG (听|播|放).{0,18}(音乐|歌) 横屏 (收音机|FM).{0,18}(卡|迟钝|迟缓|(没|木有)反应|不响应) 来电.{0,18}(没|木有)反应 安装 划屏|滑屏 (开|进).{0,18}文件夹 视频|播放.{0,18}摄像|电影|电视|影像|连续剧|美剧 重力感应|重力传感器 (联系人|通讯录).{0,18}(拨号|拨.{0,18}电话|打.{0,18}电话) 删.{0,18}(照片|图片|图像|相片) (开|进).{0,18}相机|相机.{0,18}(开|进) 下载.{0,18}卡 桌面.{0,18}滑|桌面.{0,18}移动|滑.{0,18}桌面 i管家.{0,18}内存.{0,18}清理.{0,18}卡 i音乐|自带.{0,18}音乐.{0,18}播放器 游戏 闹钟 输入法|中英文.{0,18}切换|数字.{0,18}切换|打.{0,18}字|输.{0,18}字|写.{0,18}字 打开.{0,18}(照片|图片|图像|相片) 内存.{0,18}(%|高) 壁纸.{0,18}滚动 亮.{0,18}屏|唤醒.{0,18}屏|屏.{0,18}亮|屏.{0,18}唤醒 省电.{0,18}开.{0,18}关 锁.{0,18}屏.{0,18}解.{0,18}锁|锁.{0,18}屏键 ((文件夹.{0,18}打开)|(打开.{0,18}文件夹)).{0,18}多 浏览器|流览器 锁屏.{0,18}全屏.{0,18}(闪电|雷电) (图库|相册).{0,18}gif 相机.{0,18}(进|入|到).{0,18}(相册|图库) 拍照|用.{0,18}相机 (卸载|删除).{0,18}(软件|应用程序) 语音助手.{0,18}(启动|打开|进)|(启动|打开|进).{0,18}语音助手 手势拨号 320mp3.{0,18}系统播放器 状态栏|通知栏 开软件|进.{0,18}(应用|程序) 发.{0,18}(短信|信息) 开机.{0,18}时间.{0,18}(长|久) (开|进).{0,18}短信|短信.{0,18}(开|进) 解锁 电子书.{0,18}(显示|现实).{0,18}(卡顿|迟钝|不.{0,18}(流畅|顺畅)) (智能接叫|智能接听|命令接听).{0,18}(迟钝|迟缓|卡|不敏感) 4K 访客模式.{0,18}正常模式.{0,18}(转换|切换)|访客模式.{0,18}(转换|切换));
$mergeArray[2]=@KeywordsPerfSecond;
#---------------------------------
#死机
my @KeywordsDieSecond = qw(触屏|点.{0,18}屏 i音乐|自带.{0,18}音乐.{0,18}播放器 (插|连|联).{0,18}(数据线|USB) (听|播|放).{0,18}(音乐|歌) 游戏 拍照|照相|相机 photo+ 影音|电影|电视|视频|连续剧|美剧 录像|摄像|拍摄|录影 闹钟.{0,18}(响|闹|叫).{0,18}(一键加速|一键清理) 通话|打电话|电话.{0,18}聊天|电话粥 桌面.{0,18}待机|待机.{0,18}桌面 (接|听).{0,18}电话 解锁 打.{0,18}(完.{0,18}电话|电话.{0,18}完)|(电话|通话).{0,18}完 (升级|更新.{0,18}系统|系统.{0,18}更新|升.{0,18}版本).{0,18}死机 相机.{0,18}(开|进)|(开|进).{0,18}相机 开机.{0,18}vivo 充电.{0,18}死机 闹钟.{0,18}响.{0,18}死机);
$mergeArray[3]=@KeywordsDieSecond;
#---------------------------------
#重启
my @KeywordASZestartSecond = qw(点.{0,18}关机 锁屏 u盘.{0,18}损坏 (开|进).{0,18}数据连接 手电|电筒 通话|打电话|电话.{0,18}聊天|电话粥 (看|播|放).{0,18}(影音|电影|电视|视频|连续剧|美剧) 下载.{0,18}(影音|电影|电视|视频|连续剧|美剧) 开.{0,18}关.{0,18}数据连接 音乐播放器|(听|播|放).{0,18}(音乐|歌) 开机.{0,18}界面 拍照|照相|相机 录像|摄像|拍摄|录影 (影音|电影|电视|视频|连续剧|美剧|片).{0,18}锁.{0,18}屏 蓝牙.{0,18}(汽车|车载) 数据.{0,18}((没|木有)了|丢失|找不到|消失|失踪) SD|存储卡|储存卡 (软件|应用|程序).{0,18}(丢失|找不到|消失|失踪|(没|木有)了) (开|运行).*WAY 重启.{0,18}游戏.{0,18}(没了|消失了|找不到|没有了));
$mergeArray[4]=@KeywordASZestartSecond;
#---------------------------------
#自动关机
my @KeywordsPoweroffSecond = qw(影音|电影|电视|视频|连续剧|美剧 通话|打电话|电话.{0,18}聊天|电话粥 桌面.{0,18}(开|进).{0,18}(程序|应用)|(开|进).{0,18}桌面.{0,18}(程序|应用) 游戏 手电|电筒 来电|打.{0,18}来|给.{0,18}我.{0,18}打|接.{0,18}电话 vivo.{0,18}(闪传|互传) (听|播|放).{0,18}(音乐|歌) (关机|自动死机).{0,18}(充电|冲电|接电源).{0,18}((没|木有)反应|不响应|不显示));
$mergeArray[5]=@KeywordsPoweroffSecond;
#---------------------------------
#触屏
my @KeywordsTouchPanelSecond = qw(屏.{0,18}(抖动|跳)|跳.{0,18}屏 桌面.{0,18}图标.{0,18}(屏.{0,18}(抖动|跳)|跳.{0,18}屏) 短时间.{0,18}连续 出错.{0,18}多次.{0,18}|乱了|乱跳 太灵敏|灵敏.{0,18}(高|过)|过.{0,18}灵敏 灵敏度.{0,18}(差|不好|不行|烂)|误触|不好使|(没|木有).{0,18}应|不准|失灵|(没|木有).{0,18}敏|不.{0,18}好.{0,18}用|屏幕.{0,18}(没|木有).{0,18}反应|不.{0,18}稳|不好 (不|无法).{0,18}校准|(没|木有).{0,18}校准 失灵|(不|无法).{0,18}灵|(没|木有).{0,18}灵|(失|(没|木有)|无)效|失败|不.{0,18}成功|(不|(没|木有)).{0,18}(反应|响应) 开.{0,18}护屏 延迟|滞后 右.{0,18}用不|右.{0,18}(无法|不).{0,18}使用 桌面.{0,18}滑屏.{0,18}抖动 左.{0,18}绿 游戏.{0,18}(不|无法).{0,18}多点.{0,18}(触屏|触控) 底.{0,18}键.{0,18}(无|(没|木有)).{0,18}(声|音) 定屏);
$mergeArray[6]=@KeywordsTouchPanelSecond;
#---------------------------------
#桌面
my @KeywordsLauncherSecond = qw(动态桌面.{0,18}(丑|难看|不好看|恶心) (timeline|时间轴|时间桌面|时光轴).{0,18}签名 (timeline|时间轴|时间桌面|时光轴).{0,18}(壁纸|背景) 壁纸.{0,18}(不|无法).{0,18}滑动|壁纸.{0,18}(不|无法).{0,18}移动|壁纸.{0,18}动不了 经典桌面 桌面.{0,18}便捷开关 (timeline|时间轴|时间桌面|时光轴).{0,18}打.{0,18}开 动态壁纸 场景切换 图标.{0,18}删|删.{0,18}图标 主题桌面.{0,18}(不|无法).{0,18}回 (关闭|退出).{0,18}(桌面场景|场景模式) 建.{0,18}文件夹 (不|无法).{0,18}显示.{0,18}运营商 设置.{0,18}桌面循环 未读信息显示 壁纸.{0,18}(不|无法).{0,18}全屏 ((滑.{0,18}屏)|(屏.{0,18}滑)).{0,18}(抖|跳) (滑屏|屏滑).{0,18}(亮.{0,18}暗|暗.{0,18}亮) ((没|木有)|不|无法).{0,18}(节日|过节).{0,18}壁纸|(节日|过节).{0,18}壁纸.{0,18}((没|木有)|不|无法) (换.{0,18}不|不.{0,18}换).{0,18}壁纸|壁纸.{0,18}(换.{0,18}不|不.{0,18}换) 显示.{0,18}(无|(没|木有)|不).{0,18}壁纸|(无|(没|木有)|不).{0,18}显示.{0,18}壁纸 横屏.{0,18}壁纸.{0,18}(不|无法|(没|木有)).{0,18}用 ((没|木有)|无).{0,18}(timeline|时间轴|时间桌面|时光轴) 待机.{0,18}(时间|时长).{0,18}(短|不.{0,18}长) (timeline|时间轴|时间桌面|时光轴).{0,18}((没|木有)反应|不响应) 3D壁纸.{0,18}(用不了|不能用|(没|木有)效|无效|不能使用|不行) 重.{0,18}启.{0,18}壁纸.{0,18}换 乐享极致.{0,18}(改|替换|删除|哪.{0,18}改) (timeline|时间轴|时间桌面|时光轴|時間桌面).{0,18}(怎么|怎样|如何|不能|不可以|((没|木有))|没法|无法).{0,18}(关|切回) (横屏.{0,18}游戏|游戏.{0,18}横屏).{0,18}桌面.{0,18}横屏 (不能|没法|无法|不可以).{0,18}设.{0,18}滚动壁纸 图标.{0,18}变.{0,18}位置 (滑屏|翻页).{0,18}闪屏 (timeline|时间轴|时间桌面|时光轴|時間桌面).{0,18}(丑|难看|不好看));
$mergeArray[7]=@KeywordsLauncherSecond;
#---------------------------------
#黑屏
my @KeywordsblackScreenSecond = qw(开.{0,18}(图片|相片|照片|图像) 听.{0,18}语音贴 黑.{0,18}(块|点) 游戏 photo+ 听.{0,18}(歌|音乐)|音乐播放器 蓝牙.{0,18}(汽车|车载) 相机|拍照|摄像|拍摄|录像|摄影);
$mergeArray[8]=@KeywordsblackScreenSecond;
#---------------------------------
#升级
my @KeywordsupGradeSecond = qw(不.{0,18}升级.{0,18}Android|升级.{0,18}失败|(不能|不可以|无法).{0,18}升级|升级.{0,18}失效|升级不了|升级(不|无法)成功|升级慢|升级升(不|无法)了|升(不|无法)了伋|无法.{0,18}升级|更新(不|无法)了.{0,18}系统|系统.{0,18}升(不|无法)了级|系统更新失败|刷机(不|无法)成|升级不.{0,18}系统|系统更新.{0,18}(不成功|不行|不了|不有效)|更新.{0,18}不.{0,18}版本|系统.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|不.{0,18}自动升级|系统.{0,18}不.{0,18}更新|更新失败|更新不.{0,18}系统|升级.{0,18}(不成功|不行|不了|不有效)|升不了级|升级.{0,18}不.{0,18}成功|更行系统.{0,18}失败|系统.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|昇级.{0,18}(不成功|不行|不了|不有效)|手机.{0,18}更新.{0,18}(不成功|不行|不了|不有效)|(不|无法).{0,18}更新|版本.{0,18}(更新.{0,18}不|不.{0,18}更新)|升级不到|不能更新最新版本|无法更新系统|没法升级 升级.{0,18}后|升完级|升级完|更新版本.{0,18}后|更新后就不行|更新了版本 升级.{0,18}慢|系统更新去哪啦 (不|(没|木有)|无法).{0,18}自.{0,18}启 (怎么|如何).{0,18}(升级|更新.{0,18}系统|升.{0,18}版本)|升级在哪.{0,18} 升级.{0,18}重.{0,18}启.{0,18}乱码);
$mergeArray[9]=@KeywordsupGradeSecond;
#---------------------------------
#vivo乐园
my @KeywordsvivoSpaceSecond = qw(乐园.{0,18}社区.{0,18}注册.{0,18}同.{0,18}(账户|账号|帐户|帐号) 密码.{0,18}(找回|取回|不记得)|(取回|找回).{0,18}密码|密码.{0,18}(忘|丢)|(忘|丢).{0,18}密码|注册.{0,18}忘 (无法|不).{0,18}(登录|登陆) (自动|自己).{0,18}退出 (帖子|贴子).{0,18}(打不开|进不去|上不了)|(打不开|进不去|上不了).{0,18}(帖子|贴子) 论坛.{0,18}上.{0,18}不|论坛.{0,18}(不|无法).{0,18}进|(不|无法|(没|木有)).{0,18}(上|进).{0,18}论坛. (更新|升级).{0,18}后.{0,18}(不|无法).{0,18}(登入|登录|登上) 怎么.{0,18}改.{0,18}密码 图片.{0,18}(加载.{0,18}不|不.{0,18}加载)|(没|木有).{0,18}图片|看.{0,18}不.{0,18}图片|图片.{0,18}看.{0,18}不 打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|用不了 (不|无法|(没|木有)).{0,18}发.{0,18}(贴|帖) 乐园.{0,5}(打不开|进不去|上不了)|(打不开|进不去|上不了).{0,5}乐园 (不能|不可以|无法|(没|木有)|没法).{0,18}注册|注册.{0,18}失败);
$mergeArray[10]=@KeywordsvivoSpaceSecond;
#---------------------------------
#屏幕发黄
my @KeywordASZellowScreenSecond = qw(最下.{0,18}横条 上下.{0,18}黄屏 黄线 底端|下方|地下 (又上|右上).{0,18}黄 白.{0,18}页);
$mergeArray[11]=@KeywordASZellowScreenSecond;
#---------------------------------
#闪屏
my @KeywordsflickerScrrenSecond = qw((通话|电话).{0,18}闪.{0,18}屏|(通话|电话).{0,18}屏.{0,18}闪 插.{0,18}充电器 (键|健|建).{0,18}(不|无法) 中间.{0,18}(黑|蓝) 滑.{0,18}屏|划.{0,18}屏);
$mergeArray[12]=@KeywordsflickerScrrenSecond;
#---------------------------------
#场景桌面
my @KeywordsSceneSecond = qw((不|无法).{0,18}下载 黑色.{0,18}桌面 (取消|撤销|删除|关不了|换掉|去除|切换|关|换不了).{0,18}(场景桌面|虚拟桌面|x空间)|关闭|退出|(场景桌面|虚拟桌面|x空间).{0,18}(取消|撤销|删除|关不了|换掉|去除|切换|关|换不了));
$mergeArray[13]=@KeywordsSceneSecond;
#---------------------------------
#小挂件
my @KeywordsWidgetSecond = qw(日历.{0,18}(无|不|(没|木有)).{0,18}农历 日历.{0,18}(丑|难看|恶心|简陋));
$mergeArray[14]=@KeywordsWidgetSecond;
#---------------------------------
#相机 57
my @KeywordsCameraSecond = qw((夜景|晚上|夜拍|夜间).{0,18}(不|差|烂|模糊) 模糊|(不|无法|((没|木有))).{0,18}(清晰|清楚|清晰)|摸湖|(照片|相片).{0,18}(白内障|花) 前.{0,18}摄像.{0,18}(打不|无法).{0,18}开|(打不|无法).{0,18}开.{0,18}前.{0,18}摄像 莫名其妙.{0,18}拍 水印.{0,18}花哨 ((没|木有)|无法|不).{0,18}变焦|变焦.{0,18}(无效|失效|失败|不)|全景.{0,18}(不能|不可以|(没|木有)|无法).{0,18}对焦 前.{0,18}摄像头.{0,18}反|自拍.{0,18}反 ((没|木有)|无).{0,18}构图线 (多|有).{0,18}(噪点|燥点)|(噪点|燥点).{0,18}(多|大) (专业模式|专业拍照).{0,18}放大 前.{0,18}摄像头.{0,18}色点 全景.{0,18}(不|无法).{0,18}显示.{0,18}全条 全景.{0,18}(照片|图片|相片|图像).{0,18}(不|无法).{0,18}存 启动.{0,18}(失败|失效|不.{0,18}成功) 
美颜.{0,18}怪 (无法|不|(没|木有)).{0,18}调.{0,18}感光度|感光度.{0,18}(无法|不|(没|木有)).{0,18}调 mov.{0,18}(无|(没|木有)|不).{0,18}(声|音) (对焦|聚焦).{0,18}(不|无法).{0,18}(准|精确|行|正确)|(不|无法).{0,18}(对焦|聚焦) HDR 录像.{0,18}删.{0,18}(照片|相片|图片|图像) (不|无法).{0,18}全屏 颜色.{0,18}(失|不).{0,18}真 涂抹 (照片|相片|图片|图像).{0,18}(黑斑|黑团) 闪光灯.{0,18}(失效|不.{0,18}开|无效|不.{0,18}工作)|开不起灯光|闪光灯.{0,18}(无法|没法|不能|不可以)打开 自动曝光.{0,18}(不|无法).{0,18}稳 (不|无法).{0,18}横.{0,18}拍 近距离.{0,18}对焦.{0,18}(不|烂|差|有待.{0,18}(提高|进步)) (照片|相片|图片|图像).{0,18}自动删除 
背景虚化.{0,18}(延迟|迟缓|慢) 背景虚化.{0,18}((难|不).{0,18}对焦|对焦.{0,18}(难|不|差|烂|搓)) (极速盲|侧).{0,18}拍.{0,18}慢 支持.{0,18}3D 4k.{0,18}(摄像|录像|拍摄|录影|拍视频).{0,18}(不|无法).{0,18}亮 (夜间|夜晚|晚上|夜景).{0,18}(红眼|红颜|红眼|狼眼) 720.{0,18}摄像头.{0,18}(不|无法|(没|木有)).{0,18}关闭|(不|无法|(没|木有)).{0,18}关闭.{0,18}720.{0,18}摄像头 (语音拍照|声控).{0,18}((不|无法).{0,18}灵|(没|木有)反应|无效|失效|不响应|差|不|垃圾|很烂|搓) (照相|照片|相片|图片|图像|拍照).{0,18}绿 (盲拍|侧).{0,18}((不|无法).{0,18}用||(没|木有)反应|无效|失效|不响应) (不|无法).{0,18}五连拍|五连拍.{0,18}(不|无法) 麦克风.{0,18}(灵敏度.{0,18}低|不.{0,18}灵|失效|无效|(没|木有)反应|不响应) 
4K.{0,18}(摄像|录像|拍摄|录影|拍视频).{0,18}拖影 散光 前置.{0,18}白 前置.{0,18}((不|无法|失).{0,18}真|涂抹) (摄像|录像|拍摄|录影|拍视频).{0,18}(无|(没|木有)|不|无法).{0,18}(音|声|语音) 后置.{0,18}摄像头.{0,18}(抖|跳) (专业模式|专业拍照).{0,18}(不|无法).{0,18}(进|用)|(不|无法).{0,18}(进|用).{0,18}(专业模式|专业拍照)|(专业模式|专业拍照).{0,18}FC|(专业模式|专业拍照).{0,18}(玩|用).{0,18}不 相机.{0,18}打不开|相机.{0,18}进不去|相机.{0,18}无法.{0,18}开|相机.{0,18}(启动不起|(不|无法).{0,18}运行|用.{0,18}不了|故障|无法.{0,18}用)|(启动不起|(不|无法).{0,18}运行|用.{0,18}不了|故障|无法.{0,18}用).{0,18}相机|相机.{0,18}(无法|没法)(联接|连接)|(无法|没法)(联接|连接).{0,18}相机 (录像|摄像|拍摄|录影).{0,18}(不|无法).{0,18}(看|播|放) 美颜.{0,18}((没|木有)|无).{0,18}美颜 (不|无法).{0,18}调.{0,18}(焦|远近) 
白平衡.{0,18}红 优化.{0,18}(启动|开).{0,18}速度|(启动|开).{0,18}速度.{0,18}慢|(启动|开).{0,18}速度.{0,18}(不|无法) 前置.{0,18}美颜.{0,18}(不|无法|差|烂|搓) (不|无法).{0,18}(触屏|触摸|点.{0,18}屏).{0,18}拍照|(触屏|触摸|点.{0,18}屏).{0,18}拍照.{0,18}(不|无法)|中间.{0,18}圆圈.{0,18}(没用|无效|没效|不行) 黑线|黑团 
(录像|摄像|拍摄|录影).{0,18}用.{0,18}(不|无法)|(摄像|录像|拍摄|录影|拍视频).{0,18}(无法|不).{0,18}用 变形|歪|斜 前.{0,18}摄像.{0,18}(成像|效果|拍照|照片).{0,18}不 摄像.{0,18}(卡|(没|木有)反应|不响应) 黑点 (语音拍照|声控).{0,18}((不|无法).{0,18}灵|(没|木有)反应|无效|失效|不响应|差|不|垃圾|很烂|搓) 自动.{0,18}白平衡.{0,18}不|白平衡.{0,18}问题 (不|无法|(没|木有)).{0,18}全屏.{0,18}拍|全屏.{0,18}拍.{0,18}(不|无法) (图片|相片|照片|图像).{0,18}(消失|不见|失踪|找不到|(没|木有)了)
(前置|前.{0,18}摄像头).{0,18}(哈哈镜|畸变|歪)|歪|扭曲 防.{0,18}抖 拍照.{0,18}不.{0,18}灵 拍照.{0,18}(完|结束).{0,18}(不|无法).{0,18}进.{0,18}相册 闪光灯.{0,18}(长|一直).{0,18}亮 (盲拍|侧|快门键).{0,18}(((没|木有))反应|不|不响应|失灵|不灵)|按两下.{0,18}不 照片.{0,18}(打|写).{0,18}字.{0,18}(多选|批) (打开|开启|启动).{0,18}(响|声|音).{0,18}(画面|界面).{0,18}(浮动|抖动) 像素.{0,18}(低|差|不|烂|垃圾) (拍照|照相).{0,18}浮点 补光灯.{0,18}(不|无法)|(不|无法).{0,18}补光灯 (拍照|摄像).{0,18}抖动|(拍照|摄像).{0,18}抖动.{0,18}波浪.{0,18}图像 不行|不好|烂|搓|你妹|渣|优化.{0,18}相机|质量.{0,18}差 (无法|(没|木有)|不能|不可以).{0,18}(拍照|照相)|(拍照|照相).{0,18}(不了|不行|不能)|拍不了照|照.{0,18}不了|照不成照片|照不成相片|照不了像 相册.{0,18}((没|木有)|无).{0,18}(图片|相片|照片|图像)
(无|(没|木有)|不).{0,18}(专业模式|专业拍照) (图片|相片|照片|图像).{0,18}(日期|时间).{0,18}错 (不|无法).{0,18}(摄像|录像|拍摄|录影|拍视频) (摄像|录像|拍摄|录影|拍视频).{0,18}(不.{0,18}真实|失真) (图片|相片|照片|图像).{0,18}(不|无|(没|木有)).{0,18}时间 (不|无法).{0,18}拍.{0,18}gif
花屏|屏.{0,18}花 (摄像|录像|拍摄|录影|拍视频).{0,18}(模糊|不.{0,18}清) 夜拍.{0,18}(无|(没|木有)|不).{0,18}闪光灯 (怎么|如何).{0,18}用.{0,18}曝光|曝光.{0,18}(怎么|如何).{0,18}用 (专业模式|专业拍照).{0,18}(怎么|如何).{0,18}(开启|打开|进)|(怎么|如何).{0,18}(开启|打开|进).{0,18}(专业模式|专业拍照) 侧.{0,18}键.{0,18}(不|((没|木有)|无).{0,18}反应)|极速盲拍.{0,18}(不|无法).{0,18}进|(不|无法).{0,18}进.{0,18}极速盲拍|进.{0,18}(不|无法).{0,18}极速盲拍 
左下.(两次|多次) (专业模式|专业拍照).{0,18}(正常拍照|正常模式) (相机.{0,18}相册|相册.{0,18}相机).{0,18}(不|无法|(没|木有)).{0,18}(连接|联接|链接)|相机.{0,18}进不了.{0,18}相册|相机.{0,18}(不能|不可以|(没|木有)|无法).{0,18}进.{0,18}相册 (对焦|聚焦).{0,18}慢 (相片|照片|图片|图像).{0,18}(上传|转发|头像).{0,18}(发雾|PS|痕迹) 水印.{0,18}(不能|不可以|没法|无法).{0,18}用|(不能|不可以|没法|无法).{0,18}用.{0,18}水印 (没|无).{0,18}(儿童模式|文档矫正|背景虚化|运动模式) (相机|相機).{0,18}重启 微距 眩光 (启动|打开).{0,18}(无|没有).{0,18}(画面|显示)|不能,{0,18}显示 (美颜|美妆|换妆).{0,18}((不能|没法|无法|不可以).{0,18}(用|打开)|失灵|无效|失效|不出来|用不起) (拍照|照相).{0,18}(差|烂) (亮度|画面|显示|界面).{0,18}(暗|不亮) 手动对焦.{0,18}(失败|失灵|无效|失效) (视频拍摄|拍摄视频).{0,18}((不能|没法|无法|不可以).{0,18}追焦|要.{0,18}手动对焦));
$mergeArray[15]=@KeywordsCameraSecond;
#---------------------------------
#通话
my @KeywordsPhoneSecond = qw(无.{0,18}热感应 来电.{0,18}显示.{0,18}(不.{0,18}好看|丑|难看|不.{0,18}美观) (无|(没|木有)).{0,18}来电.{0,18}语音播报 免提.{0,18}(不|无法) (通话|电话).{0,10}(卡顿|迟钝|断断续续|断续)|时断时续|通话.{0,18}(质量|效果).{0,18}(不行|烂|搓|不怎么样|差|下降) (完|结束).{0,18}屏幕.{0,18}黑 打.{0,18}(不|无法)出|(不|无法)能.{0,18}打电话|拨.{0,18}(不|无法)出|打(不|无法)了|拨.{0,18}不.{0,18}号|拨.{0,18}号.{0,18}不 (无|(没|木有)|不).{0,18}来电.{0,18}闪光|来电.{0,18}闪光.{0,18}(不|(没|木有))闪 断线|断線|中断|掉线|停|(自己|自动).{0,18}(挂|断)|(老是|总是|经常).{0,18}结束 (不|无法|(没|木有)).{0,18}自动拨号|自动拨号.{0,18}(不|无法|(没|木有)) (不|无法).{0,18}拨.{0,18}视频电话|视频电话.{0,18}(不|无法).{0,18}拨|(不|无法).{0,18}视频通话|视频通话.{0,18}(不|无法)|((没|木有)|不|无法).{0,18}视频|((没|木有)|无).{0,18}(视频通话|视频同话|视频电话) 识别.{0,18}联通185 (取消|关|关闭).{0,18}(来电语音提示|语音播报|播报语音|来电播报)|(来电语音提示|语音播报|播报语音|来电播报).{0,18}(无法|不).{0,18}关|(怎么|如何).{0,18}关.{0,18}(来电语音提示|语音播报|播报语音|来电播报)|(来电语音提示|语音播报|播报语音|来电播报).{0,18}(取消|关|关闭|讨厌) 屏幕.{0,18}时亮时不亮 怎.{0,18}设置.{0,18}来电.{0,18}(大头贴|背景墙)|来电大头贴|来电背景墙|(不|无法).{0,18}设置.{0,18}来电大头贴|后.{0,18}壁纸.{0,18}设置 后.{0,18}转屏|后.{0,18}横屏|后.{0,18}竖屏 打.{0,18}黑屏 接.{0,18}黑屏|打.{0,18}来.{0,18}黑屏 挂.{0,18}(不|无法).{0,18}掉|挂.{0,18}失灵|(不能|无法|没法).{0,18}(挂掉|挂断) 接.{0,18}(不|无法).{0,18}电话|电话.{0,18}接.{0,18}(不|无法)|电话.{0,18}打.{0,18}(不|无法).{0,18}进|打.{0,18}(不|无法).{0,18}电话|打来.{0,18}不通|打.{0,18}我.{0,18}(不|无法).{0,18}通|打.{0,18}电话.{0,18}(不能|无法|(没|木有)|没法|不可以).{0,18}接通|电话.{0,18}(不能|无法|(没|木有)|没法|不可以).{0,18}接通|电话.{0,18}打不进 (不|无法|(没|木有)).{0,18}设.{0,18}背景 回音|电话.{0,18}回音 录音.{0,18}停 免提.{0,18}(自己|自动|莫名其妙|会|经常|偶尔).{0,18}(切|变|跳)听筒 (手机套|保护套|皮套).{0,18}不|不.{0,18}(手机套|保护套|皮套) ((打我.{0,18}电话)|来电|(接.{0,18}电)|(电话.{0,18}进)|(进.{0,18}电话)|(对方.{0,18}打.{0,18}电话)).{0,18}关机 视频.{0,18}(差|不好|烂|搓|清楚|模糊) 通话.{0,18}设置.{0,18}(不|无法).{0,18}(拒绝|拒接).{0,18}所.{0,18}(来电|电话) 呼叫转移.{0,18}(不|无法) (对方|别人).{0,18}听.{0,18}不 来电.{0,18}(无|(没|木有)).{0,18}LED.{0,18}灯 (无|(没|木有)).{0,18}信号 电话.{0,18}(拨.{0,18}不|不.{0,18}拨)|(不|无法).{0,18}拨.{0,18}电话 (自动|自己).{0,18}挂|断电话|断开 拨.{0,18}(电话|号).{0,18}自动.{0,18}挂 (不|无法).{0,18}归属|归属.{0,18}(不|无法) 怎么.{0,18}(关.{0,18}语音播报|语音播报.{0,18}关) 听筒.{0,5}不.{0,18}免提 (通话|来电|电话).{0,18}记录.{0,18}(不|无法|(没|木有)).{0,18}显示 一键拔号.{0,18}(无效|不|(没|木有)|失效|不响应) (来.{0,18}电|来.{0,18}电).{0,18}报号.{0,18}(开.{0,18}关|关.{0,18}开) (可以|怎么).{0,18}视频通话 ((没|木有)|无|不).{0,18}显示.{0,18}号|号.{0,18}((没|木有)|无|不).{0,18}显示|号.{0,18}显示.{0,18}不 蓝牙耳机.{0,18}断断续续 (对方|人家).{0,18}听.{0,18}不
记录.{0,18}(不|无法).{0,18}删.{0,18}一条|(不|无法).{0,18}删.{0,18}一条.{0,18}记录 (接.{0,18}(不|无法).{0,18}电话|电话.{0,18}接.{0,18}(不|无法)|电话.{0,18}打.{0,18}(不|无法).{0,18}进|打.{0,18}(不|无法).{0,18}电话|打来.{0,18}不通|打.{0,18}我.{0,18}(不|无法).{0,18}通).{0,18}(走分钟|走时|算时间|计时|(显示|现实).{0,18}时间) ((没|木有)|无|找不到).{0,18}通话.{0,18}记录 时间.{0,18}长.{0,18}屏.{0,18}不亮 ((电话|通话).{0,18}(完|结束)|(完|结束).{0,18}(电话|通话)).{0,18}(显示|现实|出现|看到).{0,18}(无|(没|木有)|找不到).{0,18}SIM (所有|全部).{0,18}((没|木有)|无|不).{0,18}显示.{0,18}号|(所有|全部).{0,18}号.{0,18}((没|木有)|无|不).{0,18}显示|(所有|全部).{0,18}号.{0,18}显示.{0,18}不 (排序|顺序).{0,18}(不|乱) (电话响|来电).{0,18}黑屏 通话.{0,18}(听.{0,18})?回声 (名字|姓名).{0,18}(不|没).{0,18}(显示|显现) 耳机.{0,18}(无效|失效|没效));
$mergeArray[16]=@KeywordsPhoneSecond;
#---------------------------------
#无响应
my @KeywordsANRSecond = qw(TF卡 (浏览器|流览器) (相机|拍照|摄像).{0,18}(无响应|(没|木有)响应));
$mergeArray[17]=@KeywordsANRSecond;
#---------------------------------
#停止运行
my @KeywordsStopRunningSecond = qw(log.{0,18}System|sog.{0,18}System|logsestym i音乐|音乐|i音樂|听音乐 游戏 电子书|电纸书|電子書 i主题 浏览器|流览器|游览器 手机管家.{0,18}隐私空间 相机|拍照|摄像|拍摄|录像|摄影|拍视频 谷歌服务|google服务 音乐播放器|(播|听|放).{0,18}(歌|音乐) 乐园 换.{0,18}壁纸 升级 状态栏|通知栏 输入法|中英文.{0,18}切换|数字.{0,18}切换|打.{0,18}字|输.{0,18}字|写.{0,18}字 手电筒 天气 i管家 短信|信息 联系人|通讯录 i视频 (隐私|加密).{0,18}(图片|相片|照片|图像) i视频.{0,18}(在线.{0,18}点播|点击.{0,18}播放.{0,18}节目|推荐.{0,18}播放) google 个性搭配 场景桌面.{0,18}在线 (换|开).{0,18}专业模式|(开|换).{0,18}专业相机 商店 photo+.{0,18}录.{0,18}视频 相册 闪传 photo+ 日历 录音.{0,18}暂停 桌面);
$mergeArray[18]=@KeywordsStopRunningSecond;
#---------------------------------
#闪退
my @KeywordsExceptionQuitSecond = qw(I管家|自己.{0,18}管家 (浏览器|流览器) 文件管理 相机专业模式 i管家在清理垃圾时 一键加速.{0,18}浏览器 游戏 相机 手电筒 天气 相册 i视频.{0,18}在线视频 进.{0,18}u盘 主题 i音乐);
$mergeArray[19]=@KeywordsExceptionQuitSecond;
#---------------------------------
#兼容性
my @KeywordsCompatibleSecond = qw(锁屏.{0,18}数字密码.{0,18}锁屏 耳机线 解锁样式.{0,18}密码 主题.{0,18}系统 线控 (不|什么时候|没法|无法).{0,18}智能手环);
$mergeArray[20]=@KeywordsCompatibleSecond;
#---------------------------------
#i音乐
my @KeywordsiMusicSecond = qw(QRC.{0,18}歌词 歌词.{0,18}(不|无法).{0,18}完整  铃声.{0,18}剪辑 延迟 歌词.{0,18}桌面|桌面.{0,18}歌词 歌词.{0,18}歌曲.{0,18}关联 歌.{0,18}搜不到 (检索|扫描).{0,18}本地.{0,18}(歌|音乐)|本地.{0,18}(歌|音乐).{0,18}(检索|扫描) 播放.{0,18}自动斩停|播放.{0,18}自动暂停 自.{0,18}启|自己打开|自动运行 (不|无法).{0,18}记忆播放 无损音乐.{0,18}卡顿 拍照.{0,18}(不|无法).{0,18}继续播放 
BBE.{0,18}(不|无法).{0,18}自.{0,18}启 bbe.{0,18}失效 音效设置.{0,18}自动重置 歌曲.{0,18}重.{0,18}播|切歌.{0,18}重.{0,18}播 (音乐|自带播放器|歌曲).{0,18}(打.{0,18}(不开|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|无法运行|不.{0,18}运行|用不了)
 插.{0,18}耳机.{0,18}自动.{0,18}播放 自.{0,18}启 自动.{0,18}关闭.{0,18}bbe.{0,18}音效 (无法|不).{0,18}换肤 (无法|不).{0,18}调.{0,18}歌词 (录像|摄像|拍摄|录影).{0,18}(不|无法).{0,18}听.{0,18}(歌|音乐)|听.{0,18}(歌|音乐).{0,18}(不|无法).{0,18}(录像|摄像|拍摄|录影) ((没|木有)|不).{0,18}srs (不|(没|木有)|无法).{0,18}批量 (无法|不).{0,18}修改.{0,18}专辑.{0,18}图片 码率.{0,18}(无法|不).{0,18}(播|放) 扫描.{0,18}歌曲.{0,18}不|(不|无法).{0,18}扫描.{0,18}歌曲 下载.{0,18}(音乐|歌).{0,18}同步.{0,18}重启 (搜|找).{0,18}歌.{0,18}(没|木有)反应 (不|无法).{0,18}播 录音.{0,18}(不|无法).{0,18}播 
(不|无法).{0,18}(分享.{0,18}朋友圈|朋友圈.{0,18}分享) 不.{0,18}的.{0,18}《.{0,18}》 歌曲.{0,18}关机.{0,18}((没|木有)了|消失了|不见了|找.{0,18}不到|失踪了) 后台运行.{0,18}清理.{0,18}(有|自.{0,18}启) 图标.{0,18}((没|木有)了|找不到|消失|失踪) 下载.{0,18}歌曲.{0,18}((没|木有)了|找不到|消失|失踪) (歌|音乐).{0,18}(少|不.{0,18}多) ((没|木有)|无).{0,18}主题 歌词.{0,18}trc|trc.{0,18}歌词 列表.{0,18}乱码 (无|(没|木有)).{0,18}桌面.{0,18}歌词
(不|无法|(没|木有)).{0,18}自动.{0,18}下载.{0,18}歌词 设置.{0,18}退出.{0,18}(恢复|回复|还原).{0,18}重新 (不能|无法|(没|木有)|不可以).{0,18}淡入淡出 (怎么|怎样|如何).{0,18}.加{0,18}(音乐|歌曲) 一键清理.{0,18}(重头|重新|从头).{0,18}播 字母.{0,18}(查询|查找));
$mergeArray[21]=@KeywordsiMusicSecond;
#---------------------------------
#i视频
my @KeywordsiVideoSecond = qw(视频.{0,18}(消失|找.{0,18}回|(没|木有)了|找不到|消失|失踪)|(找到|找回).{0,18}视频 自动.{0,18}暂停 (不|无法).{0,18}显示.{0,18}mkv.{0,18}封装字幕 flv.{0,18}视频.{0,18}黑屏 DTS.{0,18}(不|无法)|(不|无法).{0,18}DTS rmvb.{0,18}记忆播放 (打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启)|运行.{0,18}(不能|不可以|无法)|(不|无法).{0,18}.{0,18}用|启动不起|无法运行) 1G.{0,18}rmvb.{0,18}(不|无法).{0,18}快进|1G.{0,18}rmvb.{0,18}(不|无法).{0,18}快进 (不|无法).{0,18}(播|放).{0,18}哔哩哔哩|哔哩哔哩.{0,18}(不|无法).{0,18}(播|放) (不|无法).{0,18}(播|放)|看不了|视频.{0,18}打不开|(播|放).{0,18}不|视频.{0,18}打.{0,18}不 (不|无法).{0,18}外挂.{0,18}字幕 (视频|电视|电影|电视剧).{0,18}(变.{0,18}暗|亮度调节) (视频|电视|电影|电视剧).{0,18}((亮.{0,18}暗)|(暗.{0,18}亮)|(明.{0,18}暗)|(暗.{0,18}明)) MP4.{0,18}(不|无法).{0,18}播放|(不|无法).{0,18}播放.{0,18}MP4 视频.{0,18}(不|无法|(没|木有)).{0,18}(亮度.{0,18}调节|调节.{0,18}亮度) 播放.{0,18}断.{0,18}续 悬浮窗.{0,18}(不|无法).{0,18}视频 亮度.{0,18}低.{0,18}(不|无法).{0,18}调 (开|放).{0,18}视频.{0,18}暗 720.{0,18}pmkv.{0,18}花屏 缓存.{0,18}视频.{0,18}(不|无法|(没|木有)).{0,18}(看|播) (出厂|自带|原有|原生|原带).{0,18}视频.{0,18}删|删.{0,18}(出厂|自带|原有|原生|原带).{0,18}视频 声音.{0,18}图.{0,18}(不|无法|(没|木有)).{0,18}同步 (facebook|脸书|面子书).{0,18}下载.{0,18}视频.{0,18}(打.{0,18}不|开.{0,18}不) rmvb.{0,18}((无法|(没|木有)|不能|不可以).{0,18}快进|能快进.{0,18}好) (往后拉|快进).{0,18}卡 (声音|配音).{0,18}(不|(没|木有)|无法).{0,18}(同步|一起|一致) i视频.{0,18}(删除|删了|卸了|卸载).{0,18}(恢复|回复|找回|找到) (隐藏|隐私).{0,18}(哪|怎么找|找不到));
$mergeArray[22]=@KeywordsiVideoSecond;
#---------------------------------
#音频 音质.{0,18}(不|无法)好|音质.{0,18}差|音质.{0,18}(不|无法)行
my @KeywordsAudioSecond = qw(音质.{0,18}(不.{0,18}好|不行|不对|差|烂|搓|一般般)|音质.{0,18}优化|(声|音).{0,18}不好|音质.{0,18}有问题 (声|音).{0,5}大 听筒.{0,18}((没|木有)|无).{0,18}(声|音) 话筒.{0,18}(无|(没|木有)|不).{0,18}(声|音) 杂音|噪音|澡音|燥音|滋滋.{0,18}(声|音)|吱吱.{0,18}(声|音)|破声|破音|刺耳|爆音 外放 扬声器.{0,18}无(声|音)|扬声器.{0,18}((没|木有)).{0,18}(声|音) 电波 mov.{0,18}(没|木有).{0,18}(声|音)|mov.{0,18}无(声|音) 耳机.{0,18}(杂音|噪音|澡音|燥音|滋滋) ((没|木有)|无).{0,18}低音 听筒.{0,18}声.{0,18}小 喇叭.{0,18}噪音|喇叭.{0,18}澡音|喇叭.{0,18}澡音 多媒体.{0,18}((没|木有)|无).{0,18}(声|音)|多媒体.{0,18}(声|音).{0,18}((没|木有)|无) (通话|电话|接听).{0,18}((声|听着).{0,18}(小|轻)|音.{0,18}(小|轻)|小.{0,18}声) ((通话|电话|接听|通話).{0,18}((无|(没|木有)|不).{0,18}(声|音|聲))|(听不见|聽不到))|听不.{0,18}对方|(通话|电话|接听|通話).{0,18}(听.{0,18}不.{0,18}清|不清楚|聽不到)|听.{0,18}不.{0,18}清.{0,18}(通话|电话|接听|通話) (声|音).{0,18}小|好小声 时有时无|飘忽 ((没|木有)|无).{0,18}(声|音) 耳机.{0,18}(两边|两侧).{0,18}不.{0,18}(同|一样) (通话|电话).{0,18}(飘忽|断断续续|时有时无) (通话|电话|来电).{0,18}(对方|别人).{0,18}不清 开.{0,18}关.{0,18}机.{0,18}((没|木有)|无).{0,18}(声|音) 耳机.{0,18}(无|(没|木有)|不).{0,18}((音量.{0,18}调节)|(调节.{0,18}音量)) (听筒|听简).{0,18}(声|音).{0,18}(小|轻) (((自动|自己).{0,18}(声|音))|((声|音).{0,18}(自动|自己))).{0,18}(调|到).{0,18}最高 喇叭.{0,18}((没|木有)|不).{0,18}(声|音) 重.{0,18}低.{0,18}音.{0,18}不 (铃声|铃音|响铃).{0,18}渐强.{0,18}(无效|失灵|不.{0,18}行|不.{0,18}灵|(没|木有).{0,18}用) (听见|有).{0,18}男声|(听见|有).{0,18}女声 (视频|电视|电影|电视剧).{0,18}快进.{0,18}(滋|咔咔|杂).{0,18}(声|音) 媒体.{0,18}音量.{0,18}小|媒体.{0,18}音量.{0,18}加.{0,18}不.{0,18}上 耳机.{0,18}(1|一).{0,18}(响|不响|无.{0,18}声|(没|木有).{0,18}声|发.{0,18}声) 语音.{0,18}问题 (通话|电话).{0,18}(吱吱|滋滋|干扰).{0,18}(声|音) (声|音).{0,18}从.{0,18}听筒.{0,18}不.{0,18}喇叭|听筒.{0,18}发声 扬声器.{0,18}(不|无法|(没|木有)).{0,18}(开启|打开) hifi.{0,18}高音.{0,18}齿音 (不|无法).{0,18}发.{0,18}语音 SRS.{0,18}低音 蓝牙.{0,18}(声|音).{0,18}延 耳机.{0,18}(仍|还).{0,18}显示|没插.{0,18}耳机.{0,18}连接 音效.{0,18}(不能|不可以|没法|无法).{0,18}调|(不能|不可以|没法|无法).{0,18}调.{0,18}音效 静音模式.{0,18}(没有了|没了|找不到) 短信.{0.18}(暴|爆)音 媒体.{0,18}音量调节.{0,18}(有时|偶尔)(失效|无效|没用));
$mergeArray[23]=@KeywordsAudioSecond;
#---------------------------------
#i管家
my @KeywordsiGuardSecond = qw(通话.{0,18}拦截|拦截.{0,18}号码 短信.{0,18}拦截|拦截.{0,18}号码 一键.{0,18}关|一键.{0,18}全退 一键.{0,18}关|一键.{0,18}全退 白名单.{0,18}((没|木有)用|错误|失效|无效|失去|((不|无法).{0,18}见)) 黑名单.{0,18}((没|木有)用|错误|失效|无效|失去|((不|无法).{0,18}见)) 超级省电.{0,18}(无效|(没|木有)效|不行|失效|进不去) 软件卸载.{0,18}(无效|(没|木有)|不|失效) root.{0,18}权限 i管家.{0,18}(打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|不.{0,18}运行)|(打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|无法运行|不.{0,18}运行).{0,18}i管家 下载.{0,18}SD.{0,18}异常 空间清理.{0,18}无效|空间清理.{0,18}(不|无法).{0,18}成功|空间清理.{0,18}(不|无法).{0,18}行 限.{0,18}网.{0,18}(不行|无效|失败|(没|木有)效果|不灵) ((自.{0,18}启)|(开机.{0,18}启动)).{0,18}(禁|关闭)|(禁|关闭).{0,18}((自.{0,18}启)|(开机.{0,18}启动)) 超级省电.{0,18}((能.{0,18}上.{0,18}网)|(网络.{0,18}启动)) (弹|出现).{0,18}广告 (无|(没|木有)).{0,18}网购保护 系统.{0,18}缓存.{0,18}删 i管家.{0,18}(能|可以).{0,18}(删|卸载).{0,18}吗|(能|可以).{0,18}(删|卸载).{0,18}i管家.{0,18}吗 一键加速.{0,18}时间.{0,18}长 内存清理.{0,18}返回.{0,18}桌面 (不能|不可以|无法|没法).{0,18}(藏|隐藏).{0,18}(圖片|图片));
$mergeArray[24]=@KeywordsiGuardSecond;
#---------------------------------
#浏览器
my @KeywordsBrowserSecond = qw((不|无法)缓存图片 下载.{0,18}提示.{0,18}退出.{0,18}失灵 连接.{0,18}失败 图片.{0,18}模糊 无痕.{0,18}浏览 (不|无法).{0,18}下载图片 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 网.{0,18}慢 不.{0,18}(断点|断网).{0,18}(续传|下载) (不|无法).{0,18}显示.{0,18}图|图.{0,18}(不|无法).{0,18}显示 (出|报).{0,18}错 (自己|自动).{0,18}下载 (不能|不可以|不行|不支持|没法|无法|不能支持).{0,18}中文 不.{0,18}COOkie);
$mergeArray[25]=@KeywordsBrowserSecond;
#---------------------------------
#软件商店
my @KeywordsAppStoreSecond = qw(关不.{0,18}(自动开|自.{0,18}启)|总.{0,18}运行 停止通知 自.{0,18}启 恶心 (不|无法).{0,18}安装 打.{0,18}(不开|无法)|(进|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|用不了 清.{0,18}缓存.{0,18}一直.{0,18}加载|清.{0,18}缓存.{0,18}一直.{0,18}载入 更新.{0,18}不.{0,18}软件|不.{0,18}更新.{0,18}软件 (下载好|下载完).{0,18}(不|(没|木有)).{0,18}显示.{0,18}下载|(下载好|下载完).{0,18}显示.{0,18}(不|(没|木有)).{0,18}下载 后台 下载.{0,18}(停|不下) (应用.{0,18}下载|下载.{0,18}应用).{0,18}(失效|失败|不.{0,18}成功) (开启|打开).{0,18}商店.{0,18}白屏);
$mergeArray[26]=@KeywordsAppStoreSecond;
#---------------------------------
#状态栏
my @KeywordsStatusBarSecond = qw(快捷操作.{0,18}按钮.{0,18}(少|不.{0,18}多) ((没|木有)).{0,18}电量.{0,18}显示|电量.{0,18}百分比|电量.{0,18}百分百|电量.{0,18}现实|百分数.{0,18}显示|百分比.{0,18}电量|电池.{0,18}百分比|電量顯示|电源百分比|显示电量.{0,18}哪|没.{0,18}显示.{0,18}电量|没.{0,18}电量.{0,18}显示|电量.{0,18}显示.{0,18}没 底部.{0,18}阴线 阴阳屏 长按.{0,18}HOME GPS.{0,18}显示 下.{0,18}拉上.{0,18}(不|无法) 下滑.{0,18}(不|无法) 顶部.{0,18}(没|木有).{0,18}快捷开关|顶部.{0,18}无.{0,18}快捷开关 全屏.{0,18}(不|无法).{0,18}拉 游戏.{0,18}(不|无法).{0,18}(下拉|拉下)|游戏.{0,18}(下拉|拉下).{0,18}就好 (无|((没|木有))).{0,18}竖屏.{0,18}锁定|自动旋转屏幕|关.{0,18}横屏|关闭.{0,18}屏幕.{0,18}旋转|转屏|竖屏锁定|移动旋转|横竖切换|切换横屏|关闭横屏|屏幕旋转|取消横屏|重力感应|设置横屏 单手模式.{0,18}(不.{0,18}方便|麻烦|困难) 网络.{0,18}显示.{0,18}不.{0,18}(准确|精确)|流量.{0,18}显示.{0,18}不 上拉.{0,18}太.{0,18}灵敏 应用.{0,18}颜色.{0,18}变 下拉.{0,18}悬停 自动.{0,18}横屏|竖屏.{0,18}无效 快捷方式 (没|找不到|添加).{0,18}(开|关)机.{0,18}(图标|快捷)|(加回|添加).{0,18}(开|关)机 (图标|标志).{0,18}… (横屏|横着).{0,18}上滑.{0,18}关闭.{0,18}(应用|程序) 上拉.{0,18}闪 通知栏.{0,18}(丑|难看|简陋|不好看));
$mergeArray[27]=@KeywordsStatusBarSecond;
#---------------------------------
#联系人
my @KeywordsContactSecond = qw((不|无法).{0,18}显示.{0,18}联系人|无法.{0,18}显示.{0,18}联系人|显示.{0,18}不 人名.{0,18}查询.{0,18}不.{0,18}出|拼音.{0,18}汉字|搜.{0,18}不|不.{0,18}搜|搜.{0,18}失效 忽多忽少 全屏.{0,18}手写.{0,18}显示 查询.{0,18}号码 (姓名|人名).{0,18}(排序|顺序).{0,18}乱 (不|无法).{0,18}支持.{0,18}蓝牙.{0,18}导入 (谷歌|google)服务.{0,18}删除|(谷歌|google)服务.{0,18}不|不.{0,18}支持.{0,18}(谷歌|google)服务|((没|木有)).{0,18}(谷歌|google)服务 号码.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 联系人.{0,18}总.{0,18}更新|联系人.{0,18}一直.{0,18}更新 打.{0,18}不开|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 关机.{0,18}SIM.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 图标.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) (联系人|通讯录).{0,18}(不|无法).{0,18}(拨|打) (不|无法).{0,18}(显示.{0,18}全部|全部.{0,18}显示)|读取.{0,18}不出 (联系人|号码|人名|通讯录).{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见|(没|木有)了|变.{0,18}空白) (不|无法).{0,18}编辑 (不|无法).{0,18}批量 (不能|无法|(没|木有)|不行|不可以|怎么|如何|怎样).{0,18}加.{0,18}联系人|加.{0,18}联系人.{0,18}((没|木有)|不行|不可以|无效|(没|木有)效) 职位|职等|职级 (删.{0,18}(联系人|电话本)|(联系人|电话本).{0,18}删).{0,18}(云服务|云备份).{0,18}删 联系人.{0,18}(不能|没法|无法).{0,18}云端.{0,18}同步);
$mergeArray[28]=@KeywordsContactSecond;
#---------------------------------
#短信
my @KeywordsMMSSecond = qw((收|接).{0,18}不|(不|无法).{0,18}(收|接) 发.{0,18}(不|失败)|(无法|不).{0,18}发 悬浮多任务 延迟|延后 (不|无法).{0,18}批量.{0,18}删除 读.{0,18}不|(无法|不).{0,18}读 自动亮屏.{0,18}短信.{0,18}关闭.{0,18}提示 重复.{0,18}(接受|接收|收到)|(同一条|一样的|相同的|同样).{0,18}收|短信.{0,18}重复 自动.{0,18}发.{0,18}两 (无|(没|木有)).{0,18}短信气泡|短信气泡.{0,18}(无|(没|木有)) 短信.{0,18}铃声.{0,18}(没|木有)|无.{0,18}短信.{0,18}铃声|短信.{0,18}铃声.{0,18}不 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 短信.{0,18}键盘|(输入|写字|打字).{0,18}((没|木有)|无).{0,18}反应|点.{0,18}多次.{0,18}输入法 (排序|顺序).{0,18}(不|乱) 彩信.{0,18}((发.{0,18}不)|((不|无法).{0,18}发))|((发.{0,18}不)|((不|无法).{0,18}发)).{0,18}彩信 彩信.{0,18}(不|无法).{0,18}下载|(不|无法).{0,18}下载.{0,18}彩信 发.{0,18}短信.{0,18}(迟缓|慢) 图标.{0,18}(丢.{0,18}了|找不到|消失|(没|木有)了|失踪|丢失|不见) 短信.{0,18}读.{0,18}图标.{0,18}(在|(没|木有)读) (怎么|如何).{0,18}关.{0,18}语音播报 短信.{0,18}提示.{0,18}(声|音) 设.{0,18}背景|背景.{0,18}设 短信备份.{0,18}删除|删除.{0,18}短信备份 (接|收).{0,18}慢 短信.{0,18}(6|5|六|五)行.{0,18});
$mergeArray[29]=@KeywordsMMSSecond;
#---------------------------------
#电子邮件
my @KeywordsEmailSecond = qw((不|无法).{0,18}粘贴.{0,18}邮件地址 (不|无法).{0,18}同步.{0,18}自动.{0,18}删除 打不开.{0,18}附.{0,18}xls  打不开.{0,18}附件 收件.{0,18}(不|无法).{0,18}(粘贴|黏贴) 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 (不|无法).{0,18}设置 gmail.{0,18}(exchange.{0,18}(连|联).{0,18}不|不.{0,18}(连|联).{0,18}exchange) 不.{0,18}刷新|刷新.{0,18}(不|失败) 收件箱.{0,18}(不能|不可以|无法|(没|木有)).{0,18}下拉.{0,18}收.{0,18}邮件);
$mergeArray[30]=@KeywordsEmailSecond;
#---------------------------------
#文件管理
my @KeywordsFileManagerSecond = qw(文件夹.{0,18}大小排列 内存显示|显示内存|内存.{0,18}G.{0,18}G (不|(没|木有)|无法).{0,18}左.{0,18}右.{0,18}滑 ((没|木有)|无).{0,18}(批操作|批处理|批删除) 存储模式.{0,18}(不可用|不能用|不行|无效|((没|木有))效|失效|不可使用|退出)|退出.{0,18}存储模式 (不|没有).{0,18}(连接|联接)电脑.{0,18}存储模式);
$mergeArray[31]=@KeywordsFileManagerSecond;
#---------------------------------
#输入法
my @KeywordsIMESecond = qw((不|无法).{0,18}连续.{0,18}(输入|写).{0,18}英文|无法.{0,18}连续.{0,18}(输入|写).{0,18}英文 隐私信息.{0,18}无法.{0,18}(输入|写)|隐私信息.{0,18}(不|无法).{0,18}(输入|写|打) 中英.{0,18}转换.{0,18}状态 插入.{0,18}充电器.{0,18}键盘.{0,18}失灵 字体.{0,18}小 ((没|木有)|无).{0,18}清除功能 夜间模式 输入法.{0,18}错.{0,18}字 切换.{0,18}第三方|(不|无法).{0,18}用.{0,18}第三方|(不|无法).{0,18}搜狗.{0,18}输入法|(不|无法).{0,18}百度.{0,18}输入法|切换.{0,18}搜狗|切换.{0,18}百度.{0,18}输入法 (输入法|键盘).{0,18}用(不|无法)了|(输入法|键盘).{0,18}点.{0,18}(不|无法)|隐藏|不灵|不见|不能用 联想.{0,18}(差|不好|不行) 文字.{0,18}输入|打不出字 数学符.{0,18}(乘号|除号) ((没|木有)|无).{0,18}云输入 (经常|偶尔|有时|老是|总是).{0,18}(切.{0,18}回|跳.{0,18}回) 支付宝.{0,18}兼容|兼容.{0,18}支付宝 皮肤.{0,18}换|换.{0,18}肤 字母乱跳|乱跳字母);
$mergeArray[32]=@KeywordsIMESecond;
#---------------------------------
#天气预报
my @KeywordsWeatherSecond = qw(((没|木有)|无).{0,18}语音 (不|无法).{0,18}准|(没|木有)谱|早了|晚了 (不|无法).{0,18}(更新|刷新).{0,18}数据|数据.{0,18}刷新不 天气.{0,18}定位.{0,18}(异常|(无法|不能).{0,18}更新) 天气.{0,18}无.{0,18}.{0,18}用数据 闹钟.{0,18}天气.{0,18}(地点|位置) 天气.{0,18}城市.{0,18}(删除不|(不能|无法|没法).{0,18}删));
$mergeArray[33]=@KeywordsWeatherSecond;
#---------------------------------
#便签
my @KeywordsNotesSecond = qw(云端.{0,18}同步);
$mergeArray[34]=@KeywordsNotesSecond;
#---------------------------------
#计算器
my @KeywordsCalcSecond = qw(乘号.{0,18}((没|木有)|无)|((没|木有)|无).{0,18}乘号 格式.{0,18}假 连.{0,18}(加|减|乘|除)|历史记录|记忆|连续.{0,18}(加|减|乘|除)|无.{0,18}历史记录|(没|木有).{0,18}历史记录|历史记录.{0,18}(没|木有) 悬浮 (无|(没|木有)).{0,18}双行 丑|难看|简陋|不好看);
$mergeArray[35]=@KeywordsCalcSecond;
#---------------------------------
#超超清影院
my @KeywordsCinemaSecond = qw(离线.{0,18}下载.{0,18}(无法|不|(没|木有)|无效)|(无法|不|(没|木有)).{0,18}离线.{0,18}下载 (不|无法).{0,18}全屏  蓝光.{0,18}电影 vip.{0,18}((收费|看不了)|(无法|没法|不能|不可以).{0,18}看) 高清片源.{0,18}(少|不.{0,18}给力|不.{0,18}多));
$mergeArray[36]=@KeywordsCinemaSecond;
#---------------------------------
#电子书
my @KeywordsEbookSecond = qw(打.{0,18}(不开|无法)|(进|用|开).{0,18}(不了|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|看.{0,18}不|(不|无法).{0,18}看|什么时候.{0,18}能.{0,18}看|何时.{0,18}能.{0,18}看 自己.{0,18}息屏 删除数据.{0,18}再.{0,18}使用 打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不|看.{0,18}不|(不|无法).{0,18}看|什么时候.{0,18}能.{0,18}看|何时.{0,18}能.{0,18}看 书签.{0,18}(无效|失败)|不.{0,18}设.{0,18}书签 图标.{0,18}(不|一样).{0,18}主题);
$mergeArray[37]=@KeywordsEbookSecond;
#---------------------------------
#网络信号
my @KeywordsNetSignalSecond = qw(差|烂|((没|木有)|无).{0,18}信号|信号.{0,18}差|连接.{0,18}差|弱|不.{0,18}稳定|不行|烂|搓|有时有.{0,18}有时(没|木有)|不好|不.{0,18}强|不.{0,18}好|收.{0,18}不|有问题|严重|(没|木有).{0,18}网|段.{0,18}信号|找不见.{0,18}网|断.{0,18}信号|收.{0,18}不|问题.{0,18}多|咔|沒.{0,18}信號|(自动|自己).{0,18}开.{0,18}关|(没|木有)了|时好时坏|联网.{0,18}断|信号.{0,18}不.{0,18}稳|不联网|丢.{0,18}信号|不给力|慢|用.{0,18}不|(没|木有)了|网.{0,18}(卡住|卡顿|不动|迟钝|迟缓)|信号.{0,18}(没|木有).{0,18}满|只有.{0,18}信号|联网|老是掉|卡住不动|信號.{0,18}差|超卡|好卡|网络异常|网页.{0,18}打不开|不.{0,18}快|网.{0,18}掉|数据连接不|改善手机信号 (不|无法).{0,18}显示 连接.{0,18}慢|网.{0,18}慢|网.{0,18}漫|连接.{0,18}漫|数据流量.{0,18}慢|GPR.{0,18}S.{0,18}慢 掉线|断线|网.{0,18}断|断.{0,18}网|不稳定|中断|(没|木有)网|突然.{0,18}掉|信号.{0,18}断|掉.{0,18}网|无法下载 无法.{0,18}连接|(不|无法).{0,18}连接|连.{0,18}(不|无法)上|打(不|无法)开|(不|无法).{0,18}上.{0,18}网|上.{0,18}(不|无法).{0,18}网|弱|(连|联).{0,18}不.{0,18}网|不正常|信号.{0,18}无|不.{0,18}用|灵敏度|不.{0,18}强|(连|联).{0,18}不.{0,18}网|(没|木有)网络|网络连接.{0,18}失败|网络错误 (不|无法).{0,18}支持.{0,18}(4G|四G)|要是.{0,18}(4G|四G).{0,18}就|(不|无法).{0,18}用.{0,18}(4G|四G) 电话.{0,18}(不|无法)|电话.{0,18}无法 (4G|四G)网.{0,18}上.{0,18}(不|无法).{0,18}(4G|四G)|(4G|四G)网.{0,18}(不|无法).{0,18}上.{0,18}(4G|四G)|(不|无法).{0,18}上.{0,18}(4G|四G)|((没|木有)|收不).{0,18}(4G|四G) 满格 (无|(没|木有)).{0,18}(2G|两G|二G) 联通.{0,18}(3G|三G) (3G|三G).{0,18}(老是|总是|经常|莫名其妙|自动|自己).{0,18}(切换|变).{0,18}(2G|两G|二G)|(3G|三G).{0,18}(不|无法)|(不|无法).{0,18}(3G|三G)|(3G|三G).{0,18}变.{0,18}(2G|两G|二G) (4G|四G).{0,18}(2G|两G|二G)|(2G|两G|二G).{0,18}(4G|四G)|(4G|四G).{0,18}差|GPRS.{0,18}4G 下载.{0,18}(慢|不) USB.{0,18}电脑.{0,18}网|USB.{0,18}共享.{0,18}网 (3G|三G).{0,18}(差|弱) (4G|四G).{0,18}香港.{0,18}(失败|不|失敗)|香港.{0,18}(不|(没|木有)|无法).{0,18}4G|香港.{0,18}(4G|四G).{0,18}(不|(没|木有)|无法) 打开.{0,18}(无|(没|木有)|不).{0,18}右上.{0,18}显示 不.{0,18}联通.{0,18}4G (能|可以|是否).{0,18}(支持|用).{0,18}4G|(支持|用).{0,18}4G.{0,18}吗|是4G.{0,18}吗|怎么.{0,18}4G 歌.{0,18}下载.{0,18}一半 (大陆.{0,18}香港|香港.{0,18}大陆).{0,18}不 (不能|不可以|无法|(没|木有)|没法).{0,18}(显示|读取).{0,18}sim卡|显示.{0,18}(无|没).{0,18}sim卡|sim卡不可用|sim卡不能用|无SIM|sim卡.{0,18}识别|识别.{0,18}SIM卡 3G.{0,18}(显示|现实|却是).{0,18}2G 联通);
$mergeArray[38]=@KeywordsNetSignalSecond;
#---------------------------------
#wifi
my @KeywordsWifiSecond = qw(差|烂|(((没|木有))|无).{0,18}信号|信号.{0,18}差|连接.{0,18}差|弱|不.{0,18}稳定|不行|烂|搓|有时有.{0,18}有时((没|木有))|不好|不.{0,18}强|不.{0,18}好|收.{0,18}不|有问题|严重|((没|木有)).{0,18}网|段.{0,18}信号|找不见.{0,18}网|断.{0,18}信号|收.{0,18}不|问题.{0,18}多|咔|沒.{0,18}信號|(自动|自己).{0,18}开.{0,18}关|((没|木有))了|时好时坏|联网.{0,18}断|信号.{0,18}不.{0,18}稳|不联网|丢.{0,18}信号|不给力|慢|用.{0,18}不|((没|木有))了|网.{0,18}(卡住|卡顿|不动|迟钝|迟缓)|信号.{0,18}((没|木有)).{0,18}满|只有.{0,18}信号|联网|老是掉|卡住不动|信號.{0,18}差|超卡|好卡|网络异常|网页.{0,18}打不开|不.{0,18}快|连接.{0,18}慢 网络.{0,18}慢|(无|(没|木有)).{0,18}网速 连.{0,18}(不|无法)|搜.{0,18}不.{0,18}热点|用不了|上不了|无法连接 中断.{0,18}掉线|断 打(不|无法)开|进(不|无法)去|无法使用|(不|无法).{0,18}用|(不|无法).{0,18}开 满格 ((加载.{0,18}图片)|(图片.{0,18}加载)).{0,18}(慢|迟钝|卡) ((没|木有)|无).{0,18}5G);
$mergeArray[39]=@KeywordsWifiSecond;
#---------------------------------
#GPS
my @KeywordsGpsSecond = qw(定位.{0,18}慢|搜索.{0,18}慢 (不|无法)准|不好|差|烂|搓|垃圾|不.{0,18}行 (不|无法).{0,18}定位|无法.{0,18}定位|定位.{0,18}(不|无法)了|定位.{0,18}((没|木有))用|定位.{0,18}(失败|不.{0,18}成功)|((没|木有))作用|(不|无法).{0,18}成功|(不|无法).{0,18}接收|用不了|((没|木有)).{0,18}用|((没|木有)).{0,18}反应|定不出 搜.{0,18}星.{0,18}慢 实景导航.{0,18}出.{0,18}错 AR.{0,18}navi.{0,18}(不准|不精确|不行|有问题|不可用|定位不));
$mergeArray[40]=@KeywordsGpsSecond;
#---------------------------------
#蓝牙
my @KeywordsBluetoothSecond = qw(蓝牙耳机.{0,18}(不|无法).{0,18}(连|联)|(连|联).{0,18}不.{0,18}蓝牙耳机 蓝牙鼠标.{0,18}无法.{0,18}配对|蓝牙鼠标.{0,18}(不|无法).{0,18}配对 收.{0,18}不.{0,18}设备|搜.{0,18}不.{0,18}设备 (不|无法).{0,18}(听|放|播).{0,18}(歌|音乐) 车上.{0,18}蓝牙|车载.{0,18}蓝牙 车载系统 连.{0,18}(不|无法).{0,18}上|无法连接|(不|无法).{0,18}连接|不.{0,18}匹配打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 耳机.{0,18}(不|无法).{0,18}搜索|耳机.{0,18}搜索.{0,18}不 (不|无法).{0,18}(听|放|播).{0,18}(歌|音乐) 车.{0,18}导航 蓝牙耳机.{0,18}(无法|不).{0,18}智能声控|(无法|不).{0,18}蓝牙耳.{0,18}智能声控 蓝牙.{0,18}耳机.{0,18}(怎么|如何).{0,18}用|(怎么|如何).{0,18}用.{0,18}蓝牙.{0,18}耳机 (蓝牙.{0,18}(关闭|关了)|(关闭|关了).{0,18}蓝牙).{0,18}(还|仍然|依然|依旧).{0,18}(显示|现实) 蓝牙.{0,18}(哪|找不到) (没有|没了).{0,18}智能声控);
$mergeArray[41]=@KeywordsBluetoothSecond;
#---------------------------------
#指纹
my @KeywordsFingerprintSecond = qw((解锁|识别|指纹).{0,18}(无法|不|次|失败|失效|((没|木有)).{0,18}(作用|效果)|难.{0,18}识别)|优化|吹牛|差|((没|木有)).{0,18}反应|灵敏度|不灵 (不|无法)会用|怎么用|不会弄|(不能|不行|不可以|((没|木有))|没法|无法|((没|木有))办法).{0.12}解锁 能不能用|能用吗|有吗);
$mergeArray[42]=@KeywordsFingerprintSecond;
#---------------------------------
#OTG
my @KeywordsOTGSecond = qw(无法.{0,18}用|(不|无法).{0,18}用 OTG.{0,18}64G.{0,18}USB.{0,18}损坏 鼠标.{0,18}((没|木有)|无|不).{0,18}键盘 OTG.{0,18}(连.{0,18}不|无响应|无反应));
$mergeArray[43]=@KeywordsOTGSecond;
#---------------------------------
#智能体感
my @KeywordsSmartSecond = qw(摇一摇.{0,18}手电 智能窗口.{0,18}接.{0,18}电话 智能接听|智能通话 智能体感 (双击亮屏|双击触屏|双点屏幕).{0,18}(不|无法).{0,18}亮|(双击亮屏|双击触屏|双点屏幕).{0,18}(无效|废了|失灵|失效|((没|木有))效|不太准)|双击.{0,18}唤醒.{0,18}(无效|废了|失灵|失效|((没|木有))效)|双击.{0,18}(无法|不).{0,18}唤醒|双击.{0,18}唤.{0,18}不 智能亮屏 (划|画|滑).{0,18}o (划|画|滑).{0,18}m (划|画|滑).{0,18}w 智能感应 手套模式 喚醒 熄屏手势 智能唤醒 多屏互动 隔空 语音唤醒 上划.{0,18}解屏.{0,18}(不|无法)|上滑.{0,18}解锁.{0,18}(不|无法) 双击.{0,18}亮.{0,18}屏.{0,18}(不好用|不灵敏)|双击.{0,18}屏.{0,18}亮.{0,18}(没|木有).{0,18}反应|双击.{0,18}((不.{0,18}亮)|(亮.{0,18}不)|(开.{0,18}不.{0,18}屏)|(不.{0,18}灵)) Air.{0,18}wake.{0,18}(识别|成功|辨别).{0,18}(低|不高|差|不行)|Air.{0,18}wake.{0,18}(不管用|用不了) 摇一摇.{0,18}(失灵|(没|木有)反应|无反应) (保护盖|保护套|手机套).{0,18}亮屏.{0,18}(失效|不.{0,18}灵) 声控接听.{0,18}(无效|不) 智能暂停.{0,18}不.{0,18}灵 双击亮屏.{0,18}黑框 智能拨号.{0,18}怎么.{0,18}(变回|关) (smart.{0,18}wake|smark.{0,18}wake).{0,18}(程序|应用|不.{0,18}(灵|敏感)|不管用) 语音.{0,18}接听.{0,18}(无效|不|无法|(没|木有).{0,18}用) 语音.{0,18}挂断.{0,18}(无效|不|无法|(没|木有).{0,18}用) (双击.{0,18}唤醒|双击.{0,18}亮屏).{0,18}(挂.{0,18}电话|(打|通).{0,18}完.{0,18}电话)|(挂.{0,18}电话|(打|通).{0,18}完.{0,18}电话).{0,18}(双击.{0,18}唤醒|双击.{0,18}亮屏) 手势拨号.{0,18}(无法|没法|不能).{0,18}用);
$mergeArray[44]=@KeywordsSmartSecond;
#---------------------------------
#流量监控
my @KeywordsFlowrateSecond = qw(每月.{0,18}清零 不准);
$mergeArray[45]=@KeywordsFlowrateSecond;
#---------------------------------
#时间(不|无法)准
my @KeywordsTimeSecond = qw(时钟.{0,8}慢|时钟.{0,18}(不|无法).{0,18}准|时间.{0,8}慢|时间.{0,18}(不|无法).{0,18}准|自动对时.{0,18}(不|无法).{0,18}准|时间.{0,18}(不|无法).{0,18}对|时间.{0,18}错|时问.{0,18}慢|(时间|日期).{0,18}自动修改|日期.{0,18}不相符 开.{0,18}网络.{0,18}(无法|不).{0,18}对时 自动对时.{0,18}(不准|失败));
$mergeArray[46]=@KeywordsTimeSecond;
#---------------------------------
#账号
my @KeywordsAccountSecond = qw((谷歌|google).{0,18}(帐号|账户|帐户|账号) 游戏.{0,18}帐号 账户名.{0,18}显示 密码.{0,18}找.{0,18}回|找.{0,18}回.{0,18}密码|(账户|密码).{0,18}哪.{0,18}找 (账号|账户|帐号|帐户).{0,18}((忘.{0,18}密码)|(密码.{0,18}忘))|不记得|(忘.{0,18}密码)|(密码.{0,18}忘)|密码.{0,18}改.{0,18}不|不.{0,18}知道.{0,18}密码 注册.{0,18}不|不.{0,18}注册);
$mergeArray[47]=@KeywordsAccountSecond;
#---------------------------------
#小屏
my @KeywordsMiniscreenSecond = qw(小屏.{0,18}(没|木有).{0,18}大屏 (不|无法).{0,18}调.{0,18}大.{0,18}小 (关|(设置.{0,18}不)).{0,18}小屏.{0,18}小屏.{0,18}(出|开) 悬浮.{0,18}(无|(没|木有)|不).{0,18}小屏|(无|(没|木有)|不).{0,18}悬浮.{0,18}小屏 悬浮窗.{0,18}调.{0,18}大小 (滑出|划出).{0,18}概率.{0,18}(低|不高)|(((没|木有))|无).{0,18}小屏 (怎么|如何).{0,18}(打开|开启|进入|操作|调开|调出));
$mergeArray[48]=@KeywordsMiniscreenSecond;
#---------------------------------
#游戏
@KeywordsGameSecond = qw(亮.{0,18}暗|暗.{0,18}亮|亮度.{0,18}不.{0,18}平衡|忽明忽暗|忽暗忽明 游戏.{0,18}退.{0,18}屏.{0,18}黑 (不|无法).{0,18}安装 (谷歌|google).{0,18}兼容 使命召唤 神秘之剑 汤姆猫 天天风之旋 火线指令 崩坏学院|崩坏学园 海岛奇兵 小小帝国 暖暖环游世界 刀塔传奇 开心消消乐 狂野飙车 放开那三国 葡萄游戏厅 布丁怪兽 游戏 极品飞车 酷跑 飞机 时空猎人 爱消除 天天 格斗 背刺 全民 地主 神魔 飞车 节奏大师 僵尸 麻将 时空腊人 梦幻西游 红警 侠盗 nba 剑魂之刃 雷霆战机 无尽之剑 部落战争 我的世界 小黄人快跑 小黄人 消灭星星 斗地主 史上最难的游戏 求合体 神将传奇 刀塔世界 国际足球大联盟 准游泳 真实赛车3 三国杀 雷霆 智龙迷城 天天酷跑 电魂统军令 部落冲突 时空猎人 天天风之旅 疯狂猜成语2 迷你帝国 酷酷爱魔兽);
$mergeArray[49]=@KeywordsGameSecond;
#---------------------------------
#第三方
@Keywords3PartySecond = qw(金山快盘 煲汤大全 中华万年历 方正行书 facebook 雅思听力宝 老虎地图 谷歌电子市场|谷歌电子商店 谷歌服务 谷歌键盘 合地图 乐视 导航犬 扣扣 qq 微信 腾讯 陌陌 旺信 微话 影院 迅雷看看 YY语音 土豆 酷狗 快牙 新浪 银行 证券 网易 搜狗 唱吧|IMAC 京东 google.{0,18}play 美拍 阿里通 墨迹 天天动听 中国象棋 ireader 银河玖乐 爱奇艺 PPTV 百度 搜狐 象棋 暴风 DIY主题大师 掌阅 淘宝 优酷 糗事百科 迅雷 微博 滴滴打车 谷歌地球 360相机 美颜相机 美人相机 es文件浏览器 铁友火车票软件 掌上猫扑 UC浏览 别踩白块 91助手 豌豆荚 建行客户端|建行手机支付 酷我音乐 皮皮 小影 支付宝钱包 京东商城 谷歌商店 play商店 炫耀字体 潮百搭 悠悠导航 天气通 cntv wifi万能钥匙|wife万能|wifi万能|wifi万能解锁 百度视频 高德 建设银行 梦森林 芒果tv wifi伴侣 谷歌市场 钱盒商户通 音悦台);
$mergeArray[50]=@Keywords3PartySecond;
#---------------------------------
#云服务
my @KeywordsCloudServiceSecond = qw(密码.{0,18}丢|密码.{0,18}忘|忘.{0,18}密码|丢.{0,18}密码 打.{0,18}(不|无法)|进.{0,18}(不|无法)|(不|无法).{0,18}用|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起|启动报错|用不了|无法启动 云备份.{0,18}(不|无法).{0,18}备份.{0,18}相册 云备份.{0,18}(还原|恢复).{0,18}(失败|故障|不成功) 云备份.{0,18}(失败|不成功|失效));
$mergeArray[51]=@KeywordsCloudServiceSecond;
#---------------------------------
#充电
my @KeywordsChargeSecond = qw((充|冲|).{0,18}(慢|几.{0,18}小时)|(一|1).{0,18}(夜|晚上).{0,18}(充|冲)|充电.{0,18}消失|充.{0,18}電.{0,18}只有|充电.{0,18}%.{0,18}还是% 充.{0,18}不.{0,18}满|无法.{0,18}充满|(没|木有).{0,18}充满|99%|只能.{0,18}充 屏幕.{0,18}(常|一直).{0,18}亮 充电器.{0,18}拔.{0,18}显示 满.{0,18}(没|木有).{0,18}提示|满.{0,18}无.{0,18}提示|满.{0,18}提示.{0,18}(没|木有)|((没|木有)|无).{0,18}满.{0,18}提示|完成.{0,18}((没|木有)|无).{0,18}提示|充满电.{0,18}提示音 (充电.{0,18}拔|拔.{0,18}充电).{0,18}显示 电.{0,18}满.{0,18}在.{0,18}充电|电.{0,18}饱.{0,18}在.{0,18}充电 充电.{0,18}异常 (充|冲).{0,18}(不了|不进|不起|不尽)|(不能|无法|没法)充 漏电 断电|停止|停掉|不.{0,6}充了 (充电.{0,18}满|(没|木有).{0,18}充电).{0,18}指示.{0,18}灯.{0,18}(亮|闪烁) 关机.{0,18}(自动.{0,18}开机|自.{0,18}启) 拔.{0,18}(无|(没|木有)).{0,18}提示.{0,18}(声|音) (无法|不).{0,18}(移动电源|充电宝).{0,18}充电 充.{0,18}满.{0,18}只.{0,18}显示 插.{0,18}数据线.{0,18}漏电 充电.{0,18}进.{0,18}存储模式 充电.{0,18}绿);
$mergeArray[52]=@KeywordsChargeSecond;
#---------------------------------
#截屏
my @KeywordsScreenShotSecond = qw(摇动手机.{0,18}(不|无法).{0,18}截屏|摇动手机.{0,18}无法.{0,18}截屏 ((没|木有)|要是|怎|如何|(没{0,18}法)|无法|能够).{0,18}(截图|截屏|截圖|捕捉屏幕)|(截图|截屏|截圖|捕捉屏幕).{0,18}(方法|办法|怎|如何|是哪个)|(增|加|快弄个).{0,18}(截屏|截图|截圖|捕捉屏幕)|不.{0,18}截|截.{0,18}不|无法.{0,18}用|截屏键是哪个|咋截|(没|木有).{0,18}截图|怎么.{0,18}截|截不了图|有截屏 白屏|白图|空白 (截屏|截图|載屏|載图|截圖).{0,18}画质.{0,18}低 此图已截);
$mergeArray[53]=@KeywordsScreenShotSecond;
#---------------------------------
#闹钟
my @KeywordsAlarmSecond = qw((无|(没|木有)|不).{0,18}(语音|播报)|(语音|播报).{0,18}(不行|不.{0,18}(播|放)|失效|无法|坏|(没|木有)|失灵)|(语音|播报).{0,18}(不|无法).{0,18}播报 无.{0,18}天气数据|(没|木有).{0,18}天气数据|天气预报.{0,18}(不|无法)|不.{0,18}天气 开机.{0,18}(不|无法).{0,18}自.{0,18}启 画.{0,18}(不|无法).{0,18}显示 自选铃声.{0,18}响铃.{0,18}短|(铃声|响铃).{0,18}(短|歌.{0,18}(完|结束))|分钟 正点.{0,18}闹钟.{0,18}(不|无法)会报时 闹钟铃声.{0,18}小 不响|不闹|响.{0,18}响 贪睡.{0,18}怎么.{0,18}(关|弄掉) (怎么|如何|独立|单独|不能|不可以|无法|没法).{0,18}(调|设置).{0,18}(声|音) (铃声|闹铃|响铃).{0,18}(选择|自选|自定义) 语音播报.{0,18}(声|音).{0,18}(不能|不可以|(没|木有)|没法|无法|怎么|怎样|如何).{0,18}调 闹钟.{0,18}(((不|无法).{0,18}用)|(打.{0,18}不开)|(用不了)|(启动不起)|((不|无法).{0,18}启动)|(运行不)|(进不去)|(无法打开)|不能打开|(打.{0,18}(不|无法))|(进.{0,18}不)|禁止运行)|(((不|无法).{0,18}用)|(打.{0,18}不开)|(用不了)|(启动不起)|((不|无法).{0,18}(启动|运行))|(运行不)|(进不去)|(无法打开)|不能打开|(打.{0,18}(不|无法))|(进.{0,18}不)|不能玩|禁止运行).{0,18}闹钟 闹钟.(0,18)(语音|播报).{0,18}开 闹钟.{0,18}自动关闭);
$mergeArray[54]=@KeywordsAlarmSecond;
#---------------------------------
#PHOTO+
my @KeywordsPhotojiaSecond = qw(((不|无法)|删除).{0,18}重新.{0,18}安装|删.{0,18}(下载|安装)|哪.{0,18}下載 像素.{0,18}低 跳.{0,18}加载 无法.{0,18}编辑|(不|无法).{0,18}编辑 (不|无法).{0,18}用摩棒|无法.{0,18}用摩棒 录视频.{0,18}剪切 photo.{0,18}一直.{0,18}数据连接|photo.{0,18}老.{0,18}数据连接 使用不了|打不开|进不去|无法使用|(不|无法).{0,18}用|功能不|用不了|用不起 上传.{0,18}(不|失败)|(不|无法).{0,18}上传 卸载.{0,18}恢复 视频.{0,18}自动.{0,18}删除|自动.{0,18}删除.{0,18}视频 (软件商店|应用商店).{0,18}((没|木有)|无).{0,18}photo\+ 不.{0,18}支持.{0,18}100M.{0,18}视频 photo\+.{0,18}视频.{0,18}(不能|无法|不可以|(没|木有))(保存|存储|储存|存到));
$mergeArray[55]=@KeywordsPhotojiaSecond;
#---------------------------------
#I主题
my @KeywordsiThemeSecond = qw(主题.{0,18}少|更多|不.{0,18}丰富|新.{0,18}主题|增加.{0,18}主题|能.{0,18}多|多.{0,18}点主题 (没|木有).{0,18}分类|无.{0,18}分类 更新.{0,18}慢 丑 图片.{0,18}打开.{0,18}慢 按键.{0,18}(不|无法).{0,18}返回 切换.{0,18}不|(不|无法).{0,18}切换|(不|无法).{0,18}退出|删.{0,18}不|不.{0,18}删|回到|恢复到|换不回|换回来 (汉字|汉子).{0,18}字体.{0,18}(不|无法|只能).{0,18}(汉字|汉子).{0,18}字体 全局主题.{0,18}(不.{0,18}更新|少)|多.{0,18}全局主题|说好的.{0,18}全局主题|在.{0,18}多|再.{0,18}多|只.{0,18}一个.{0,18}全局主题 壁纸.{0,18}加载.{0,18}慢 原.{0,18}(无法|不).{0,18}恢复 (不|无法).{0,18}(同步.{0,18}通话记录|通话记录.{0,18}同步) 简约风.{0,18}(((没|木有))|找不到|消失) (不能|无法|没法|不可以).{0,18}下载.{0,18}.主题|主题.{0,18}(不能|无法|没法|不可以).{0,18}下载 (不能|无法|没法|不可以).{0,18}(连接|链接|联接)在线);
$mergeArray[56]=@KeywordsiThemeSecond;
#---------------------------------
#HIFI
my @KeywordsHIFISecond = qw(((没|木有)).{0,18}hifi|无.{0,18}HIFI (不|无法).{0,18}支持.{0,18}(第三方|播放器));
$mergeArray[57]=@KeywordsHIFISecond;
#---------------------------------
#锁屏 
my @KeywordsLockScreenSecond = qw(锁.{0,18}屏.{0,18}(不|无法).{0,18}灵敏 锁.{0,18}屏.{0,18}(壁纸|墙纸).{0,18}((不|无法)|无法|取消|换) 锁.{0,18}屏.{0,18}(没|木有).{0,18}天气|锁.{0,18}屏.{0,18}音乐.{0,18}天气.{0,18}界面|锁.{0,18}屏.{0,18}动态天气.{0,18}图案|锁.{0,18}屏.{0,18}天气.{0,18}音乐.{0,18}界面|锁.{0,18}屏.{0,18}界面.{0,18}天气预报|锁.{0,18}屏.{0,18}音乐.{0,18}天气.{0,18}挂件|锁.{0,18}屏.{0,18}天气.{0,18}音乐.{0,18}挂件|锁.{0,18}屏.{0,18}天气.{0,18}(没|木有)|左滑.{0,18}天气.{0,18}音乐.{0,18}(不见|消失|找不到|失踪|(没|木有)了) 锁屏.{0,18}(不|无法).{0,18}小屏 自动锁屏.{0,18}(不|无法)|自动锁屏.{0,18}无法|无法.{0,18}自动锁屏|(不|无法).{0,18}自动锁屏 
锁屏.{0,18}样式.{0,18}无法|锁屏.{0,18}样式.{0,18}(不|无法) 无法锁屏 锁屏.{0,18}播放.{0,18}音乐 锁屏.{0,18}音乐.{0,18}停止 竖.{0,18}锁屏 锁屏.{0,18}声音.{0,18}大 锁屏.{0,18}无反应 锁屏.{0,18}头像.{0,18}更换 一键加速.{0,18}自动锁屏 锁屏.{0,18}屏幕.{0,18}自动.{0,18}亮|锁屏.{0,18}亮屏 
横屏.{0,18}锁屏 竖.{0,18}锁屏 锁屏.{0,18}(没|木有)声|锁屏.{0,18}无声 锁屏.{0,18}(不|无法)解锁 锁屏.{0,18}小键盘 锁屏时间.{0,18}(不|无法)准确 锁屏.{0,18}(没|木有).{0,18}唤醒 皮套解锁 密码锁屏.{0,18}问题 锁屏.{0,18}断网|锁屏.{0,18}(没|木有)信号|锁屏.{0,18}(不|无法).{0,18}信号 异常锁屏|无缘无故.{0,18}锁屏 
人脸锁屏.{0,18}黑屏 锁屏.{0,18}信息.{0,18}(不|无法).{0,18}接收|锁屏.{0,18}(不|无法).{0,18}信息 锁屏.{0,18}(不|无法)兼容 上划.{0,18}解.{0,18}(不|无法)|上滑.{0,18}解.{0,18}(不|无法) ((锁屏.{0,18}节日.{0,18}壁纸)|(节日.{0,18}锁屏.{0,18}壁纸)).{0,18}((找.{0,18}(不|无法))|(无法.{0,18}找)) ((锁.{0,18}屏)|(屏.{0,18}锁)).{0,18}失效|(不|无法).{0,18}锁屏 ((锁屏.{0,18}短信)|(短信.{0,18}锁屏)).{0,18}提示 
(合|盖|关).{0,18}套.{0,18}不.{0,18}(锁.{0,18}屏|息屏|熄屏) 下拉.{0,18}((拍照.{0,18}(不|无法))|((不|无法).{0,18}相机)) 壁纸.{0,18}被.{0,18}天气.{0,18}盖 锁.{0,18}屏.{0,18}(不.{0,18}亮|打.{0,18}不.{0,18}开)|开锁键.{0,18}黑屏 锁.{0,18}屏.{0,18}解锁.{0,18}花屏 密码.{0,18}忘记 图案解锁.{0,18}错误.{0,18}(无限|不).{0,18}次 一键锁屏.{0,18}(不|无效|失效|不灵) 下.{0,18}滑.{0,18}(开|进).{0,18}(摄像头|相机) 滑动解锁.{0,18}(不|无法)|划不屏 锁屏.{0,18}自动关机 (昵称|smile).{0,18}(改|换|编辑) 两.{0,18}手机.{0,18}一起.{0,18}解锁 解锁.{0,18}(不|无法|没法).{0,18}(显示|显现|出现));
$mergeArray[58]=@KeywordsLockScreenSecond;
#---------------------------------
#相册
my @KeywordsGallerySecond = qw((加密|隐私|私密空间).{0,18}((不|无法).{0,18}开.{0,18}(照片|相片|图片))|(无法|没法|不能|不可以).{0,18}打开.{0,18}隐私.{0,18}(照片|相片|图片) ((设置.{0,18}壁纸)|(壁纸.{0,18}设置)).{0,18}慢 蓝牙.{0,18}图.{0,18}(找不|不.{0,18}找|无法.{0,18}找) 截图.{0,18}((没|木有)|找.{0,18}不)
微视频.{0,18}显示.{0,18}不|显示.{0,18}不.{0,18}微视频|不.{0,18}显示.{0,18}微视频 (照片|相片|图片|存储).*((没|木有)了|(没|木有)了|消失|失踪|找不到)|存.*不.*(照片|相片|图片)|文件.*丢失 相册.{0,18}(打.{0,18}不开|进.{0,18}(不|无法)|(不|无法).{0,18}启|运行.{0,18}(不|无法)|(不|无法).{0,18}用|启动不起)
隐私空间.{0,18}((不|无法).{0,18}进|进.{0,18}(不|无法)) 加密.{0,18}(找不到|失踪|消失|((没|木有))了|在哪) 微信.{0,18}((图片|照片|相片|相册).{0,18}(保存|存储)|(保存|存储).{0,18}(图片|照片|相片|相册|找不到|消失了|(没|木有)了|(没|木有)了|不见了))|((图片|照片|相片|相册).{0,18}保存|保存.{0,18}(图片|照片|相片|相册)).{0,18}微信 (不能|不行|不可以|(没|木有)).{0,18}gif|gif.{0,18}(不能|不行|不可以|(没|木有)).{0,18}(看|打开) (图片|照片|相片|相册).{0,18}(保存|存储|保到|存不上|存不)|(保存|存储).{0,18}(图片|照片|相片|相册|找不到|消失了|((没|木有))了|((没|木有))了|不见了)|下载.{0,18}(图片|照片|相片).{0,18}(怎么|怎样|如何).{0,18}(放|保存|存储)(相册|手机)|(图库|相册).{0,18}(看不到|找不到|((没|木有))).{0,18}(图片|照片|相片)|(不能|不可以|没法|无法).{0,18}存.{0,18}(图片|照片|相片)|文件.{0,18}(不见了|没了)|(不能|无法|没法|不可以).{0,18}(存储|储存).{0,18}(文件|图片) 裁剪 (图片|照片|相片).{0,18}(没法|无法|不能|不可以).{0,18}(查看|打开)|看不了.{0,18}(图片|照片|相片) 图片.{0,18}加载.{0,18}(慢|卡顿|迟钝) (没有|么有|至少有|至少要有).{0,18}文件夹排序 (隐私空间|隐藏选项|加密).{0,18}(没了|没有了|找不到) 珍藏相册.{0,18}(没了|取消了|找不到|消失) (照片|图片|照片).{0,18}(不能|无法|没法|增加).{0,18}移动);
$mergeArray[59]=@KeywordsGallerySecond;
#---------------------------------
#手电筒
my @KeywordsFlashlightSecond = qw((手电|电筒).{0,18}(自己|自动).{0,18}(灭|关) (不|无法|(没|木有)).{0,18}后台 震动模式.{0,18}短信.{0,18}(自己|自动|).{0,18}(亮|开) 手电.{0,18}(没了|没有了|找不到)|(没了|没有了|找不到).{0,18}手电);
$mergeArray[60]=@KeywordsFlashlightSecond;
#---------------------------------
#FM
my @KeywordsFMSecond = qw(打.{0,18}(不|无法)|(进|用|开).{0,18}(不|无法)|(不|无法).{0,18}(用|启|开)|运行.{0,18}(不|无法)|(不|无法).{0,18}.{0,18}用|启动不起|(不|无法).{0,18}运行|不.{0,18}稳定|运行.{0,18}不 (((没|木有))|无|找不到|要是有|自带).{0,18}(FM|收音机)|(FM|收音机).{0,18}(((没|木有))|无|找不到|在哪)|安装.{0,18}.(FM|收音机).{0,18}就好 (搜|收).{0,18}不);
$mergeArray[61]=@KeywordsFMSecond;
#---------------------------------
#字体
my @KeywordsFontSecond = qw((英文|数字).{0,18}无效 少|不.{0,18}多|再出.{0,18}字体 工美彩刷 ((没|木有)|无).{0,18}字体.{0,18}(分格|分割) 字.{0,18}小 (无|(没|木有)|建议).{0,18}(繁体|繁體)|(繁体|繁體).{0,18}(无|(没|木有)) (怎么|怎样|如何|不能|不可以|(没|木有)|无法).{0,18}换.{0,18}字体|字体.{0,18}换 ((没|木有)|无|要是有|加入).{0,18}正楷);
$mergeArray[62]=@KeywordsFontSecond;
#---------------------------------
#SD卡
my @KeywordsSDSecond = qw((SD|存储|储存|卡|内存|U盘).{0,18}(不|无法|未).{0,18}(读|无效|显示|现实|正常运行|可用|使用)|(不|无法).{0,18}(读|无效|显示|现实).{0,18}(SD|存储|储存|卡|内存|U盘)|(SD|存储|储存|卡|内存|安装的|U盘).{0,18}(未挂载|未挂件|读.{0,18}不出|没了|不见了|找不到|消失了|不存在)|(不能|没法|不可以|无法).{0,18}软件搬家|未插入|程序移.{0,18}不.{0,18}内存|看不到.{0,18}(SD|存储|储存|卡|内存|U盘)|不能安装软件|显示无(SD|存储|储存|卡|内存|U盘)|读不出 
(U盘|SD|存储卡|储存卡|储存设备|内存卡|存储设备).{0,18}(坏|错|不能用) 内存.{0,18}坏 (买|售货|宣传).{0,18}G.{0,18}(((没|木有))|才|只|仅).{0,18}G|(((没|木有))|才|只).{0,18}G.{0,18}(买|售货).{0,18}G|内存.{0,18}g.{0,18}(实际|用起来).{0,18}g (读.{0,18}卡|卡.{0,18}读).{0,18}(慢|迟钝|迟缓) (显示|现实|突然).{0,18}(存储卡|储存卡|内存卡|SD).{0,18}(拔出|移除)|(存储卡|储存卡|内存卡|SD).{0,18}(显示|现实|突然).{0,18}(拔出|移除) 存储状态.{0,18}(不|没法|无法).{0,18}用 (移动|移到).{0,18}(SD|内存卡|存储卡|储存卡) 运.{0,8}存.{0,18}(比以前|变).{0,18}大 手机U盘.{0,18}(应用|程序).{0,18}卸载SD.{0,18}图标.{0,18}(丢失|消失|找不到|没了|没有了));
$mergeArray[63]=@KeywordsSDSecond;
#---------------------------------
#屏幕亮度调节
my @KeywordsScreenBrightSecond = qw(屏幕.{0,18}亮度|手机.{0,18}亮度|忽亮忽暗|时亮时暗|自动亮.{0,18}暗|时.{0,18}(暗|亮).{0,18}时.{0,18}亮|忽明忽暗|时亮.{0,18}时暗|屏幕.{0,18}明.{0,18}暗 滑屏.{0,18}暗一下 屏幕常亮 (夜间|夜晚|晚上).{0,18}屏.{0,18}不.{0,18}亮 (视频|电影|电视|电视剧|美剧).{0,18}(屏幕|亮度).{0,18}暗 自动调节.{0,18}(不.{0,18}(调|动)|失效|无效) 相机.{0,18}相册.{0,18}(亮度.{0,18}调|调.{0,18}亮度));
$mergeArray[64]=@KeywordsScreenBrightSecond;
#---------------------------------
#震动
my @KeywordsVibrationSecond = qw((声|音).{0,18}小 无缘无故|莫名其妙);
$mergeArray[65]=@KeywordsVibrationSecond;
#---------------------------------
#vivo语音助手
my @KeywordsVivoiceSecond = qw((添加|(没|木有)|无).{0,18}武汉话);
$mergeArray[66]=@KeywordsVivoiceSecond;
#---------------------------------
#日历
my @KeywordsCalendarSecond = qw((少|(没|木有)).{0,18}节气|节气.{0,18}(少|(没|木有)) 日程.{0,18}(不能|不可以|(没|木有)|无法|(没|木有)).{0,18}农历|日程.{0,18}农历.{0,18}(无效|(没|木有)效) 农历.{0,18}(无法|不能|不可以|(没|木有)|不行).{0,18}设.(0,12)(提醒|备忘录));
$mergeArray[67]=@KeywordsCalendarSecond;
#---------------------------------
#NFC
my @KeywordsNFCSecond = qw(怎么.{0,18}用);
$mergeArray[68]=@KeywordsNFCSecond;
#---------------------------------
#ROOT
my @KeywordsROOTSecond = qw((不支持|不能|不可以|无法|怎么|怎样|如何|没有).{0,18}root|root.{0,18}权限不.{0,18}获取|root.{0,18}权限|root.{0,18}不知道);
$mergeArray[69]=@KeywordsROOTSecond;
#---------------------------------
#游戏中心
my @KeywordsGameCenterSecond = qw(游戏中心.{0,18}后台.{0,18}运行);
$mergeArray[70]=@KeywordsGameCenterSecond;
#---------------------------------
#访客模式
my @KeywordsVisitorPatternSecond = qw(访客模式.{0,18}(不见|消失|找不到|失踪) smart.{0,18}Wake.{0,18}(失效|无效|不灵) 突然.{0,18}(安全模式|访客模式) 访客模式.{0,18}((不能|无法|没法).{0,18}显示|没有).{0,18}小插件);
$mergeArray[71]=@KeywordsVisitorPatternSecond;
#---------------------------------
#USB
my @KeywordsUSBSecond = qw((怎么|如何|怎样).{0,18}(连|联).{0,18}电脑 (USB.{0,18}(连接|联接|链接)|(连接|联接|链接).{0,18}USB).{0,18}漏电);
$mergeArray[72]=@KeywordsUSBSecond;
#---------------------------------
#vivo社区
my @KeywordsVivoCommunitySecond = qw(不.{0,18}(登录|登陆).{0,18}(可以|能|进|).{0,18}社区 (登陆|登录).{0,18}(开.{0,18}不|不.{0,18}开|进.{0,18}不|).{0,18}网);
$mergeArray[73]=@KeywordsVivoCommunitySecond;
#---------------------------------
#天籁K歌
my @KeywordsKMusicSecond = qw((无|(没|木有)).{0,18}耳返|耳返.{0,18}(无效|不行|失效|(没|木有)效|(没|木有)用) (怎么|怎样|如何|不能|不行|不可以|(没|木有)).{0,18}(连接|链接|联接).{0,18}(麦克风|音响|音箱) (怎么|怎样|如何|不能|不行|不可以|(没|木有)).{0,18}(录.{0,18}(歌|曲)) 插.{0,18}耳机.{0,18}时好时坏 作品.{0,18}(停止运行|进不去|关闭) 删.{0,18}(哪下|下载|回复|恢复) 音效.{0,18}(无效|没用|没效|没有用) (听不到|听不见).{0,18}自己.{0,18}(声|音)|不.{0,18}出(声|音)|没.{0,18}(声|音)|(耳反|耳返)失真 闪退|直接退出|秒退 (不能|不会).{0,18}(唱|K歌)|k不了 (不能|不会|不可以|没法|无法).{0,18}听.{0,18}作品 (声|音).{0,18}小 (没|不像|无法|没法).{0,18}KTV.{0,18}(效果|感觉|音效) 怎么|怎样|如何 歌.{0,18}卡|卡.{0,18}歌 伴奏.{0,18}(低|小) 直播间.{0,18}((无|没)耳(返|反)|(听不到|听不见).{0,18}自己.{0,18}(声|音)|不.{0,18}出(声|音)|没.{0,18}(声|音)));
$mergeArray[74]=@KeywordsKMusicSecond;
#---------------------------------
#录音
my @KeywordsSoundRecordSecond = qw(((没|木有)|(要是|如果).{0,18}有|赶紧加).{0,18}录音);
$mergeArray[75]=@KeywordsSoundRecordSecond;
#---------------------------------
#眼球识别 眼球识别不能锁屏解锁 眼球识别如何使用 眼球识别应用太少 眼球识别信息如何更改 眼球识别失败 眼球识别密码怎么改 眼球识别不能用QQ
#眼球识别
my @KeywordsEyeRecognitionSecond = qw((不能|无法|没法|不可以|不行).{0,18}(解|锁).{0,18}屏 (怎么|怎样|如何).{0,18}(用|设置|眼球) 应用.{0,18}(少|多)|(少|多).{0,18}应用 信息.{0,18}改|重.{0,18}设置|改.{0,18}信息 失败|无效|失效|没用|不灵|准确率|灵敏|不好用 密码.{0,18}(改|换)|(改|换).{0,18}密码 QQ);
$mergeArray[76]=@KeywordsEyeRecognitionSecond;
#---------------------------------
#掉漆
my @KeywordsDiaoqiSecond = qw(边框|边缘|边上|边|四周 充电口 丝印 侧 (一|1)个月 外壳|外观|vivo标志.{0,18}掉 中框 两端 USB|充电插口 耳机 天|月|新.{0,18}买 );
$mergeArray[77]=@KeywordsDiaoqiSecond;
#---------------------------------
my @KeywordsSuggestionSecond = qw();
$mergeArray[78]=@KeywordsSuggestionSecond;
#---------------------------------
my @KeywordsQuestionSecond = qw((怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(显示|查看|现实).{0,18}(手机.{0,18}型号|版本) (怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(设置).{0,18}(时间)|(时间).{0,18}(怎么|怎样|如何|不能|(没|木有)|无法).{0,18}(设置) (恢复|回复).{0,18}出厂设置|出厂设置.{0,18}(恢复|回复) 多屏.{0,18}(怎么|怎样|如何|不会).{0,18}用|(怎么|怎样|如何|不会).{0,18}用.{0,18}多屏 (有|支持|是否|可以).{0,18}联通.{0,18}4G|联通.{0,18}4G.{0,18}(有|支持|是否|可以) 大型游戏.{0,18}(不能|不可以|不行|没法|无法|没办法).{0,18}(玩|用|进)|(不能|不可以|不行|没法|无法|没办法).{0,18}(玩|用|进).{0,18}大型游戏 (是不是|是否|判断).{0,18}旗舰机 photo+.{0,18}(怎么|怎样|如何|不会).{0,18}用 (5|五)模.{0,18}(3|三)模|(3|三)模.{0,18}(5|五)模 出厂.{0,18}(程序|软件|应用).{0,18}下载 怎么把.{0,18}(放到|移到));
$mergeArray[79]=@KeywordsQuestionSecond;
#---------------------------------
my @KeywordsComplainSecond = qw();
$mergeArray[80]=@KeywordsComplainSecond;
#---------------------------------
my @KeywordsSatisfiedSecond = qw();
$mergeArray[81]=@KeywordsSatisfiedSecond;
#---------------------------------


#主程序开始运行
main();

sub main{
	Process();	#过滤处理，处理完后进行版本筛选，筛选策略：先找到版本个数，按照个数拷贝相同的份数，进行删除操作。	
}


sub Process{
	
	foreach (@PHONEMODELS) {

		printf "%s 开始筛选...\n", $_;
	  my ($start_sec, $start_usec) = gettimeofday();	
		$filePath = $dir."\/".$_."Last".".xlsx";	# 表格路径, X5ProDDetailLast 文件
		$workbook = $Excel->Workbooks->Open($filePath); 

		$selectSheet = $workbook->Sheets($pageNum);
		$selectSheet->Activate;
		$Excel->ActiveWindow->{'SplitRow'} = 1;				#冻结第一行
		$Excel->ActiveWindow->{'SplitColumn'} = 0;
		$Excel->ActiveWindow->{'FreezePanes'} = True;
		$selectSheet->Columns("E:N")->{'Hidden'} = True;
		$selectSheet->Columns("D:D")->{'ColumnWidth'} = 60;
		$selectSheet->Range("O1")->{'Value'} = "投诉主模块";
		$selectSheet->Range("P1")->{'Value'} = "投诉细分模块";
		$selectSheet->Columns("O:O")->{'ColumnWidth'} = 20;

		my $row = 2;
	  $rowCount=$selectSheet->usedrange->rows->count;       #最大有效行数

		
		#读出EXCEL数据到数组
		$totolRow=$rowCount;
		$numDRow=AZZ.$totolRow;
		$DataArray = $selectSheet->Range("A1:$numDRow")->{'Value'};
		$DataLength=@$DataArray;

		AddTag($startCol);
		
				
		# modify kongqiao 20150723
    #匹配数据
		for (2..$rowCount) {

			MatchLine($row);
			$row++;
		}
    
    
		$rowSecond=2;
		for (2..$rowCount) {				#按照结果将一级分类关键字合并
		  $ref_array=$$DataArray[$rowSecond-1];
		  
			$mergeCol=$startCol;
			$num=0;
			$CountMerge=0;
			foreach $merge(@mergeArray){
				#执行赋值操作
				$mergeValue=$$ref_array[$mergeCol-1];
				
				if($mergeValue eq 1){
					$tempValue=$$ref_array[9+5];
					if($num>0){
				  	$tempValue .= " ".$TAGSERIES[$mergeCol-$startCol-$CountMerge];
				  	$manager=$mergeCol-$startCol-$CountMerge;
					}
					else{
						$tempValue .= " ".$TAGSERIES[$mergeCol-$startCol];
					}
					$$ref_array[9+5]=$tempValue;
				}
				$mergeCol+=$merge;
				$CountMerge+=$merge;
				$mergeCol++;
				$num++;				
			}
			
			if($$ref_array[9+5] eq ""){
				$$ref_array[9+5]=" 其他";
			}

			$$DataArray[$rowSecond-1]=$ref_array;
			$rowSecond++;
		
	  }
	
	
		for $row(2..$rowCount) {				#按照结果将二级分类关键字合并
		  $ref_array=$$DataArray[$row-1];
			
			for $col($startCol..$startCol+@TAGSERIESSecond-1) {
				   $mergeValue=$$ref_array[$col-1];
					  #printf "%s\n",$mergeValue;
					  #print $row."\n";
				if ($mergeValue eq 1) {
					#$value = $selectSheet->Cells($row, 10)->{'Value'};								
					#$value .= " ".$TAGSERIES[$col-$startCol];
					#$selectSheet->Cells($row, 10)->{'Value'} = $value;	
					$tempValue=$$ref_array[10+5];
					foreach (@TAGSERIES){
						if($tempValue eq $_){
							$tempValue="";
						}
					}
					$count=0;
					foreach (@TAGSERIES){
						if($TAGSERIESSecond[$col-$startCol] eq $_){
							$tempValue .= "";
							last;
						}
						else{
							if($count eq @TAGSERIES-1){
								#print $$ref_array[9+5]."\n";
								if($$ref_array[9+5] =~ /第三方软件/){
									if($$ref_array[9+5] =~ /性能/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."卡";	
									}elsif($$ref_array[9+5] =~ /死机/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."死机";
									}elsif($$ref_array[9+5] =~ /无响应/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."无响应";
									}elsif($$ref_array[9+5] =~ /闪退/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."闪退";
									}elsif($$ref_array[9+5] =~ /停止运行/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."停止运行";
									}else{
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol];	
									}
								}elsif($$ref_array[9+5] =~ /游戏/){
								if($$ref_array[9+5] =~ /性能/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."卡";
									}elsif($$ref_array[9+5] =~ /死机/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."死机";
									}elsif($$ref_array[9+5] =~ /无响应/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."无响应";
									}elsif($$ref_array[9+5] =~ /闪退/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."闪退";
									}elsif($$ref_array[9+5] =~ /停止运行/){
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol]."停止运行";
									}else{
										$tempValue .= " ".$TAGSERIESSecond[$col-$startCol];	
									}
								}else{
									$tempValue .= " ".$TAGSERIESSecond[$col-$startCol];	
								}
							}	
							
						}
						$count++;
					}
					$$ref_array[10+5]=$tempValue;
				}
			}
			
			
			$$DataArray[$row-1]=$ref_array;
		}


	  # modify kongqiao 20150721
		printf "%s 初始行数 \n", $rowCount;
		#删除EXCEL里面相同的行 
		foreach $i (2..$rowCount-1){
			$ref_array = $$DataArray[$i-1];
			$ref_des = $$ref_array[3];  
			$ref_imei = $$ref_array[2]; 
			$ref_value = $$ref_array[14];
			foreach $j (($i+1)..$rowCount){
			   			
				$temp_array = $$DataArray[$j-1];
				$temp_des = $$temp_array[3];
				$temp_imei = $$temp_array[2];
				$temp_value = $$temp_array[14];
				
				if($ref_imei eq $temp_imei){   # 同一个用户
					if($ref_des eq $temp_des){  #描述完全相同
						#获取分类 关键字
						
						if(!($ref_pattern =~ /$filterData$/)){  # 不是 其他|建议|问题
													
					  	$position = $j -1;
					  	splice(@$DataArray,$position,1);
					  
					  }												
					}else{
						#获取分类 关键字
						my @ref_pattern = split /\s+/,$ref_value;
						my @temp_pattern = split /\s+/,$temp_value;
					  $count = 0;  # 相同 模式的个数		
					  				
					  foreach $ref1 (0..$#ref_pattern){
					  	foreach $temp1 (0..$#temp_pattern){
					  		if($ref_pattern[$ref1] eq $temp_pattern[$temp1]){
					  				
					  			$count++;
					  									  			
					  		}					  							  			
					  	}					  		
					  }
					  # 只有当 相同的模式的个数，等于模式数目较小的那个项 的时候，我们认为这个项重复了，应该删除
					  $minNum = @ref_pattern <= @temp_pattern ? @ref_pattern : @temp_pattern;
					  if($count eq $minNum){
					  	if(@ref_pattern < @temp_pattern){
					  		$position = $i -1;
					  		splice(@$DataArray,$position,1);
					  		#next REF;
					  			
					 		}else{
					 			$position = $j -1;
				  			splice(@$DataArray,$position,1);
					  			
				  		}
					  		
				  	}					  																							
						
					}
														
				}		
		  }		
		}

														
		$rowCount = @$DataArray - 1;       #删除相同行后重新获取最大有效行数
		printf "%s 删除相同行后最大行数...\n", $rowCount;
		
		#删除EXCEL里面测试专用的行
		$rowDa=2;
		for (2..$rowCount){
			$ref_array=$$DataArray[$rowDa-1];
			$ref_data=$$ref_array[3];

			if($ref_data =~ /\s测试/){
				$position=$rowDa-1;
				splice(@$DataArray,$position,1);
			}else{
				$rowDa++;
			}				
		}	
		
	  $rowCount=@$DataArray;       #删除测试行后重新获取最大有效行数
		#print "删除测试后最大行数".$rowCount."\n";
		
	
		Calculate(\@$DataArray);
    #将分类完数据写回EXCEL	
		$newSheet = $workbook->Worksheets->Add;
		$workbook->Sheets($pageNum+1)->{name} = "原始数据";
		$getName=$_=~ /(\S+)Detail/ig;
		$docName=$1;
		$name=$docName."投诉";
		$workbook->Sheets($pageNum)->{name} = $name;	
		$DataLenth=@$DataArray;
    $Dataend=AZZ.$DataLenth;
		$workbook->Sheets($pageNum)->Columns("E:N")->{'Hidden'} = True;
		$workbook->Sheets($pageNum)->Columns("D:D")->{'ColumnWidth'} = 60;
		$workbook->Sheets($pageNum)->Columns("O:O")->{'ColumnWidth'} = 20;
		$workbook->Sheets($pageNum)->Columns("K:K")->{'ColumnWidth'} = 40;	
		$workbook->Sheets($pageNum)->Columns("B:B")->{'ColumnWidth'} = 25;
		$workbook->Sheets($pageNum)->Columns("A:A")->{'ColumnWidth'} = 13;
		$workbook->Sheets($pageNum)->Range("A1:$Dataend")->{'value'}=$DataArray;
		
		

		#分类过滤
		CoASZResultbyEdition($workbook, $rowCount);	

		
			
		$workbook->Save();
		$workbook->Close();
		my ($end_sec, $end_usec) = gettimeofday();
		my $timeDelta = ($end_usec - $start_usec) / 1000000 + ($end_sec - $start_sec);
		printf "%s 筛选完成, 共耗时：%s秒\n", $_, $timeDelta ;


	}	
}


sub FilterbyEdition{
	my ($model,$num) = @_;
	#my $rowCount = $selSheet->usedrange->rows->count;       #最大有效行数
	my $row = 2;	#从第二行开始遍历
	for (2..$lastRow){  		
		#my $modelselect = $selSheet->Cells($row, 2);
		 $ref_array=$$filter[$row-1];
		 #$ref_array==${$arrayNum[$num-1]}[$row-1];
		 $value=$$ref_array[1];

		if ($value =~ /$model/) {
			++$row;	#遇到了合适的，下一次就得加一行遍历
		} else {
			$position=$row-1;
			splice(@$filter,$position,1);#删除一行，整个表格会上移	
			#splice(@{$arrayNum[$num-1]},$position,1);
		}	
	}	
}

sub CoASZResultbyEdition{
	my ($workbook,$rowCount) = @_;
	#初始化存放版本的数组
	for $i(0..$arrSize) {
		$editionArray[$i] = 0;			
	}
		
		
	#匹配版本
	for $row(2..$rowCount) {
		
		$ref_array=$$DataArray[$row-1];
		$value=$$ref_array[1];
		if($value =~ m/_(\d+\.\d+\.\d+)$/) {	
			for $i(0..$arrSize) {
				if ($1 eq $editionArray[$i]) {
					last;
				} elsif ($1 ne $editionArray[$i] && $editionArray[$i] eq 0){
					$editionArray[$i] = $1;
					last;
				}
			}				
		}
	}
	
	 $editionNum = 0;
	for $i(0..$arrSize) {
		if ($editionArray[$i] ne 0) {
			$editionNum++;
			printf "%s\n", $editionArray[$i];		
		}			
	}
	
	@$perfermance=@$DataArray;
	@$deleteothers=@$DataArray;
	@$others=@$DataArray;
	
  #在拷贝数据之前先把其他，问题，建议之类的筛选删掉	
	$el=2;
	for (2..$rowCount) {
			$ref_array=$$deleteothers[$el-1];
			$ref_value=$$ref_array[9+5];
			#print $ref_value."\n";

			if($ref_value =~ /$filterOthers/){ #匹配到必有反馈问题的项则(不|无法)管
				++$el;
			}
			else{
				if($ref_value =~ /$filterData$/){ #否则在那些(不|无法)是一定出问题的项有其他，问题，建议之类的筛选删掉
					$position=$el-1;
					splice(@$deleteothers,$position,1);#删除一行，整个表格会上移	
				}
				else{
					++$el;
				}
			}
	}
	$newSheet = $workbook->Worksheets->Add;
	$workbook->Sheets($pageNum)->{name} = "筛选";
	$DataLenth=@$deleteothers;
	$lastRow=$DataLenth;#获取剩余长度
	$Dataend=AZZ.$DataLenth;
	$workbook->Sheets($pageNum)->Columns("E:N")->{'Hidden'} = True;
	$workbook->Sheets($pageNum)->Columns("D:D")->{'ColumnWidth'} = 60;
	$workbook->Sheets($pageNum)->Columns("O:O")->{'ColumnWidth'} = 20;
	$workbook->Sheets($pageNum)->Columns("B:B")->{'ColumnWidth'} = 25;	
	$workbook->Sheets($pageNum)->Columns("A:A")->{'ColumnWidth'} = 13;
	$workbook->Sheets($pageNum)->Columns("K:K")->{'ColumnWidth'} = 40;
  $workbook->Sheets($pageNum)->Range("A1:$Dataend")->{'value'}=\@$deleteothers;	
 
 
  #生成其他建议提问表
	$el=2;
	for (2..$rowCount) {
			$ref_array=$$others[$el-1];
			$ref_value=$$ref_array[9+5];
			#print $ref_value."\n";

			if($ref_value =~ /$filterOthers/){ 
					$position=$el-1;
					splice(@$others,$position,1);#删除一行，整个表格会上移	
			}
			else{
				if($ref_value =~ /$filterData$/){ 
					++$el;	
				}
				else{
					$position=$el-1;
					splice(@$others,$position,1);#删除一行，整个表格会上移	
				}
			}
	}
	$newSheet = $workbook->Worksheets->Add;
	$workbook->Sheets($pageNum)->{name} = "建议提问";
	$DataLenth=@$others;
	$Dataend=AYZ.$DataLenth;
	$workbook->Sheets($pageNum)->Columns("E:N")->{'Hidden'} = True;
	$workbook->Sheets($pageNum)->Columns("D:D")->{'ColumnWidth'} = 60;
	$workbook->Sheets($pageNum)->Columns("O:O")->{'ColumnWidth'} = 20;
	$workbook->Sheets($pageNum)->Columns("B:B")->{'ColumnWidth'} = 25;	
	$workbook->Sheets($pageNum)->Columns("A:A")->{'ColumnWidth'} = 13;
  $workbook->Sheets($pageNum)->Range("A1:$Dataend")->{'value'}=\@$others;

	for $i(1..$editionNum){

		#$arrayNum[$i-1] = $workbook->Sheets($pageNum)->Range("A1:$numDRow")->{'Value'};

		$filter=Fil.$i;
		@$filter=@$deleteothers;
		
		FilterbyEdition( $editionArray[$i-1],$i);
		#$calLastRow=@$filter;#获取剩余长度
		#print "剩余长度为:".$calLastRow."\n";
		Calculate(\@$filter);		#计算总和

		#创建每页sheet，把数组写回EXCEL
		$newSheet = $workbook->Worksheets->Add;
		$workbook->Sheets($pageNum)->{name} = $editionArray[$i-1];
    $DataLenth=@$filter;
    #print "最后剩余长度为:".$DataLenth."\n";
    #$haha=@$filter-3;
    #print "对比数据\n";
    #print $haha."\n";
    #print $DataLenth."\n";
		#$temptemp=$$filter[$DataLenth-1];
		#$hello=$$temptemp[$startCol-1];
		#print "还原后得到的值为：";
		#print $hello."\n";
		$DataLenth=$DataLenth;
    $Dataend=AZZ.$DataLenth;
		$workbook->Sheets($pageNum)->Columns("E:N")->{'Hidden'} = True;
		$workbook->Sheets($pageNum)->Columns("D:D")->{'ColumnWidth'} = 60;
		$workbook->Sheets($pageNum)->Columns("O:O")->{'ColumnWidth'} = 20;
		$workbook->Sheets($pageNum)->Columns("K:K")->{'ColumnWidth'} = 40;
		$workbook->Sheets($pageNum)->Columns("B:B")->{'ColumnWidth'} = 25;	
		$workbook->Sheets($pageNum)->Columns("A:A")->{'ColumnWidth'} = 13;
    $workbook->Sheets($pageNum)->Range("A1:$Dataend")->{'value'}=\@$filter;	#传递的是数组引用
    #$sureFilter=$$filter[$DataLenth-1];
    #$sureNum=$DataLenth+3;
    #$sureRow=A.$sureNum;
    #$sureCol=AZZ.$sureNum;
    #$workbook->Sheets($pageNum)->Range("$sureRow:$sureCol")->{'value'}=\@$sureFilter;

	}

}

sub Calculate{
	my ($datafilter) = @_;
	my $tempVal = 0;
	my $tempTotal = 0;
	$calLastRow=@$datafilter;#获取剩余长度
	$totolcol=@TAGSERIESSecond;
	#my $rowCount = $sheet->usedrange->rows->count;       #最大有效行数
	for $col($startCol..$startCol+$totolcol-1) {	
		$tempVal = 0;	
		for $row(2..$calLastRow) {
			#$tempVal += $sheet->Cells($row, $col)->{'value'};
			$ref_array=$$datafilter[$row-1];
			#$ref_array=${$arrayNum[$num-1]}[$row-1];
			$value=$$ref_array[$col-1];
			$tempVal+=$value;
			#print $tempVal."\n";
		}
		#$sheet->Cells($rowCount+1, $col)->{'value'} = $tempVal;	
	  $Maxref_array=$$datafilter[$calLastRow];
	  #$Maxref_array=${$arrayNum[$num-1]}[$rowCount];
	  $$Maxref_array[$col-1]=$tempVal;
		$$datafilter[$calLastRow]=$Maxref_array;
		#print "当前行加和为：\n";
		#print $$Maxref_array[$col-1]."\n";
		#$temptemp=$$datafilter[$calLastRow];
		#$hello=$$temptemp[$col-1];
		#print "还原后得到的值为：";
		#print $hello."\n";
		#${$arrayNum[$num-1]}[$rowCount]=$Maxref_array;
	}
	#$sheet->Cells($rowCount+2, $startCol-1)->{'value'} = $tempTotal;
}


sub MatchLine{
	my ($row) = @_;
	my $col = $startCol;
	MatchType(\@KeywordsBattery, \@KeywordsBatterySecond,\@KeywordsBatteryExcl, $row, $col++);		#1
	$col+=@KeywordsBatterySecond;
	MatchType(\@KeywordsHeat, \@KeywordsHeatSecond,\@KeywordsHeatExcl, $row, $col++);
	$col+=@KeywordsHeatSecond;
	MatchType(\@KeywordsPerf, \@KeywordsPerfSecond,\@KeywordsPerfExcl, $row, $col++);
	$col+=@KeywordsPerfSecond;
	MatchType(\@KeywordsDie, \@KeywordsDieSecond,\@KeywordsDieExcl, $row, $col++);
	$col+=@KeywordsDieSecond;
	MatchType(\@KeywordASZestart, \@KeywordASZestartSecond,\@KeywordASZestartExcl, $row, $col++);
	$col+=@KeywordASZestartSecond;
	MatchType(\@KeywordsPoweroff, \@KeywordsPoweroffSecond,\@KeywordsPoweroffExcl, $row, $col++);
	$col+=@KeywordsPoweroffSecond;
	MatchType(\@KeywordsTouchPanel, \@KeywordsTouchPanelSecond,\@KeywordsTouchPanelExcl, $row, $col++);
	$col+=@KeywordsTouchPanelSecond;
	MatchType(\@KeywordsLauncher, \@KeywordsLauncherSecond,\@KeywordsLauncherExcl, $row, $col++);
	$col+=@KeywordsLauncherSecond;
	MatchType(\@KeywordsblackScreen, \@KeywordsblackScreenSecond,\@KeywordsblackScreenExcl, $row, $col++);
	$col+=@KeywordsblackScreenSecond;
	MatchType(\@KeywordsupGrade, \@KeywordsupGradeSecond,\@KeywordsupGradeExcl, $row, $col++);
	$col+=@KeywordsupGradeSecond;
	MatchType(\@KeywordsvivoSpace, \@KeywordsvivoSpaceSecond,\@KeywordsvivoSpaceExcl, $row, $col++);
	$col+=@KeywordsvivoSpaceSecond;
	MatchType(\@KeywordASZellowScreen, \@KeywordASZellowScreenSecond,\@KeywordASZellowScreenExcl, $row, $col++);
	$col+=@KeywordASZellowScreenSecond;
	MatchType(\@KeywordsflickerScrren, \@KeywordsflickerScrrenSecond,\@KeywordsflickerScrrenExcl, $row, $col++);
	$col+=@KeywordsflickerScrrenSecond;
	MatchType(\@KeywordsScene, \@KeywordsSceneSecond,\@KeywordsSceneExcl, $row, $col++);
	$col+=@KeywordsSceneSecond;
	MatchType(\@KeywordsWidget, \@KeywordsWidgetSecond,\@KeywordsWidgetExcl, $row, $col++);
	$col+=@KeywordsWidgetSecond;
	MatchType(\@KeywordsCamera, \@KeywordsCameraSecond,\@KeywordsCameraExcl, $row, $col++); #11
	$col+=@KeywordsCameraSecond;
	MatchType(\@KeywordsPhone, \@KeywordsPhoneSecond,\@KeywordsPhoneExcl, $row, $col++);
	$col+=@KeywordsPhoneSecond;
	MatchType(\@KeywordsANR, \@KeywordsANRSecond,\@KeywordsANRExcl, $row, $col++);
	$col+=@KeywordsANRSecond;
	MatchType(\@KeywordsStopRunning, \@KeywordsStopRunningSecond,\@KeywordsStopRunningExcl, $row, $col++);
	$col+=@KeywordsStopRunningSecond;
	MatchType(\@KeywordsExceptionQuit, \@KeywordsExceptionQuitSecond,\@KeywordsExceptionQuitExcl, $row, $col++);
	$col+=@KeywordsExceptionQuitSecond;	
	MatchType(\@KeywordsCompatible, \@KeywordsCompatibleSecond,\@KeywordsCompatibleExcl, $row, $col++);
	$col+=@KeywordsCompatibleSecond;
	MatchType(\@KeywordsiMusic, \@KeywordsiMusicSecond,\@KeywordsiMusicExcl, $row, $col++);
	$col+=@KeywordsiMusicSecond;
	MatchType(\@KeywordsiVideo, \@KeywordsiVideoSecond,\@KeywordsiVideoExcl, $row, $col++);
	$col+=@KeywordsiVideoSecond;
	MatchType(\@KeywordsAudio, \@KeywordsAudioSecond,\@KeywordsAudioExcl, $row, $col++);
	$col+=@KeywordsAudioSecond;
	MatchType(\@KeywordsiGuard, \@KeywordsiGuardSecond,\@KeywordsiGuardExcl, $row, $col++);
	$col+=@KeywordsiGuardSecond;
	MatchType(\@KeywordsBrowser, \@KeywordsBrowserSecond,\@KeywordsBrowserExcl, $row, $col++);	#21
	$col+=@KeywordsBrowserSecond;
	MatchType(\@KeywordsAppStore, \@KeywordsAppStoreSecond,\@KeywordsAppStoreExcl, $row, $col++);
	$col+=@KeywordsAppStoreSecond;
	MatchType(\@KeywordsStatusBar, \@KeywordsStatusBarSecond,\@KeywordsStatusBarExcl, $row, $col++);	
	$col+=@KeywordsStatusBarSecond;
	MatchType(\@KeywordsContact, \@KeywordsContactSecond,\@KeywordsContactExcl, $row, $col++);	
	$col+=@KeywordsContactSecond;
	MatchType(\@KeywordsMMS, \@KeywordsMMSSecond,\@KeywordsMMSExcl, $row, $col++);
	$col+=@KeywordsMMSSecond;
	MatchType(\@KeywordsEmail, \@KeywordsEmailSecond,\@KeywordsEmailExcl, $row, $col++);
	$col+=@KeywordsEmailSecond;
	MatchType(\@KeywordsFileManager, \@KeywordsFileManagerSecond,\@KeywordsFileManagerExcl, $row, $col++);
	$col+=@KeywordsFileManagerSecond;
	MatchType(\@KeywordsIME, \@KeywordsIMESecond,\@KeywordsIMEExcl, $row, $col++);
	$col+=@KeywordsIMESecond;
	MatchType(\@KeywordsWeather, \@KeywordsWeatherSecond,\@KeywordsWeatherExcl, $row, $col++);
	$col+=@KeywordsWeatherSecond;
	MatchType(\@KeywordsNotes, \@KeywordsNotesSecond,\@KeywordsNotesExcl, $row, $col++);
	$col+=@KeywordsNotesSecond;
	MatchType(\@KeywordsCalc, \@KeywordsCalcSecond,\@KeywordsCalcExcl, $row, $col++);	#31
	$col+=@KeywordsCalcSecond;
	MatchType(\@KeywordsCinema, \@KeywordsCinemaSecond,\@KeywordsCinemaExcl, $row, $col++);
	$col+=@KeywordsCinemaSecond;
	MatchType(\@KeywordsEbook, \@KeywordsEbookSecond,\@KeywordsEbookExcl, $row, $col++);
	$col+=@KeywordsEbookSecond;
	MatchType(\@KeywordsNetSignal, \@KeywordsNetSignalSecond,\@KeywordsNetSignalExcl, $row, $col++);
	$col+=@KeywordsNetSignalSecond;
	MatchType(\@KeywordsWifi, \@KeywordsWifiSecond,\@KeywordsWifiExcl, $row, $col++);	
	$col+=@KeywordsWifiSecond;
	MatchType(\@KeywordsGps, \@KeywordsGpsSecond,\@KeywordsGpsExcl, $row, $col++);	
	$col+=@KeywordsGpsSecond;
	MatchType(\@KeywordsBluetooth, \@KeywordsBluetoothSecond,\@KeywordsBluetoothExcl, $row, $col++);
	$col+=@KeywordsBluetoothSecond;
	MatchType(\@KeywordsFingerprint, \@KeywordsFingerprintSecond,\@KeywordsFingerprintExcl, $row, $col++);	
	$col+=@KeywordsFingerprintSecond;
	MatchType(\@KeywordsOTG, \@KeywordsOTGSecond,\@KeywordsOTGExcl, $row, $col++);	
	$col+=@KeywordsOTGSecond;
	MatchType(\@KeywordsSmart, \@KeywordsSmartSecond,\@KeywordsSmartExcl, $row, $col++);
	$col+=@KeywordsSmartSecond;
	#MatchType(\@KeywordsLightTuning, \@KeywordsLightTuningSecond,\@KeywordsLightTuningExcl, $row, $col++);	#41(不|无法)准确匹配所以暂时去掉
	#$col+=@KeywordsLightTuningSecond;
	MatchType(\@KeywordsFlowrate, \@KeywordsFlowrateSecond,\@KeywordsFlowrateExcl, $row, $col++);  
	$col+=@KeywordsFlowrateSecond;
	MatchType(\@KeywordsTime, \@KeywordsTimeSecond,\@KeywordsTimeExcl, $row, $col++);	
	$col+=@KeywordsTimeSecond;
	MatchType(\@KeywordsAccount, \@KeywordsAccountSecond,\@KeywordsAccountExcl, $row, $col++);	
	$col+=@KeywordsAccountSecond;
	MatchType(\@KeywordsMiniscreen, \@KeywordsMiniscreenSecond,\@KeywordsMiniscreenExcl, $row, $col++);	
	$col+=@KeywordsMiniscreenSecond;
	MatchType(\@KeywordsGame, \@KeywordsGameSecond,\@KeywordsGameExcl, $row, $col++);	
	$col+=@KeywordsGameSecond;
	MatchType(\@Keywords3Party, \@Keywords3PartySecond,\@Keywords3PartyExcl, $row, $col++);
	$col+=@Keywords3PartySecond;
	MatchType(\@KeywordsCloudService, \@KeywordsCloudServiceSecond,\@KeywordsCloudServiceExcl, $row, $col++);
	$col+=@KeywordsCloudServiceSecond;
	MatchType(\@KeywordsCharge, \@KeywordsChargeSecond,\@KeywordsChargeExcl, $row, $col++);
	$col+=@KeywordsChargeSecond;
	MatchType(\@KeywordsScreenShot, \@KeywordsScreenShotSecond,\@KeywordsScreenShotExcl, $row, $col++);
	$col+=@KeywordsScreenShotSecond;
	MatchType(\@KeywordsAlarm, \@KeywordsAlarmSecond,\@KeywordsAlarmExcl, $row, $col++);
	$col+=@KeywordsAlarmSecond;
	MatchType(\@KeywordsPhotojia, \@KeywordsPhotojiaSecond,\@KeywordsPhotojiaExcl, $row, $col++);
	$col+=@KeywordsPhotojiaSecond;
	MatchType(\@KeywordsiTheme, \@KeywordsiThemeSecond,\@KeywordsiThemeExcl, $row, $col++);
	$col+=@KeywordsiThemeSecond;
	MatchType(\@KeywordsHIFI, \@KeywordsHIFISecond,\@KeywordsHIFIExcl, $row, $col++);
	$col+=@KeywordsHIFISecond;
	MatchType(\@KeywordsLockScreen, \@KeywordsLockScreenSecond,\@KeywordsLockScreenExcl, $row, $col++);
	$col+=@KeywordsLockScreenSecond;
	MatchType(\@KeywordsGallery, \@KeywordsGallerySecond,\@KeywordsGalleryExcl, $row, $col++);	
	$col+=@KeywordsGallerySecond;
	MatchType(\@KeywordsFlashlight, \@KeywordsFlashlightSecond,\@KeywordsFlashlightExcl, $row, $col++);	
	$col+=@KeywordsFlashlightSecond;
	MatchType(\@KeywordsFM, \@KeywordsFMSecond,\@KeywordsFMExcl, $row, $col++);	
	$col+=@KeywordsFMSecond;
	MatchType(\@KeywordsFont, \@KeywordsFontSecond,\@KeywordsFontExcl, $row, $col++);	
	$col+=@KeywordsFontSecond;
	MatchType(\@KeywordsSD, \@KeywordsSDSecond,\@KeywordsSDExcl, $row, $col++);	
	$col+=@KeywordsSDSecond;
	MatchType(\@KeywordsScreenBright, \@KeywordsScreenBrightSecond,\@KeywordsScreenBrightExcl, $row, $col++);	
	$col+=@KeywordsScreenBrightSecond;
	MatchType(\@KeywordsVibration, \@KeywordsVibrationSecond,\@KeywordsVibrationExcl, $row, $col++);	
	$col+=@KeywordsVibrationSecond;
	MatchType(\@KeywordsVivoice, \@KeywordsVivoiceSecond,\@KeywordsVivoiceExcl, $row, $col++);	
	$col+=@KeywordsVivoiceSecond;
	MatchType(\@KeywordsCalendar, \@KeywordsCalendarSecond,\@KeywordsCalendarExcl, $row, $col++);	
	$col+=@KeywordsCalendarSecond;
	MatchType(\@KeywordsNFC, \@KeywordsNFCSecond,\@KeywordsNFCExcl, $row, $col++);	
	$col+=@KeywordsNFCSecond;
	MatchType(\@KeywordsROOT, \@KeywordsROOTSecond,\@KeywordsROOTExcl, $row, $col++);	
	$col+=@KeywordsROOTSecond;
	MatchType(\@KeywordsGameCenter, \@KeywordsGameCenterSecond,\@KeywordsGameCenterExcl, $row, $col++);	
	$col+=@KeywordsGameCenterSecond;
	MatchType(\@KeywordsVisitorPattern, \@KeywordsVisitorPatternSecond,\@KeywordsVisitorPatternExcl, $row, $col++);	
	$col+=@KeywordsVisitorPatternSecond;
	MatchType(\@KeywordsUSB, \@KeywordsUSBSecond,\@KeywordsUSBExcl, $row, $col++);	
	$col+=@KeywordsUSBSecond;
	MatchType(\@KeywordsVivoCommunity, \@KeywordsVivoCommunitySecond,\@KeywordsVivoCommunityExcl, $row, $col++);	
	$col+=@KeywordsVivoCommunitySecond;		
	MatchType(\@KeywordsKMusic, \@KeywordsKMusicSecond,\@KeywordsKMusicExcl, $row, $col++);	
	$col+=@KeywordsKMusicSecond;
	MatchType(\@KeywordsSoundRecord, \@KeywordsSoundRecordSecond,\@KeywordsSoundRecordExcl, $row, $col++);	
	$col+=@KeywordsSoundRecordSecond;	
	MatchType(\@KeywordsEyeRecognition, \@KeywordsEyeRecognitionSecond,\@KeywordsEyeRecognitionExcl, $row, $col++);	
	$col+=@KeywordsEyeRecognitionSecond;	
	MatchType(\@KeywordsDiaoqi, \@KeywordsDiaoqiSecond,\@KeywordsDiaoqiExcl, $row, $col++);	
	$col+=@KeywordsDiaoqiSecond;
	MatchType(\@KeywordsSuggestion,\@KeywordsSuggestionSecond, \@KeywordsSuggestionExcl, $row, $col++);	
	$col+=@KeywordsSuggestionSecond;
	MatchType(\@KeywordsQuestion, \@KeywordsQuestionSecond,\@KeywordsQuestionExcl, $row, $col++);	
	$col+=@KeywordsQuestionSecond;
	MatchType(\@KeywordsComplain, \@KeywordsComplainSecond,\@KeywordsComplainExcl, $row, $col++);	#51
	$col+=@KeywordsComplainSecond;
	MatchType(\@KeywordsSatisfied, \@KeywordsSatisfiedSecond,\@KeywordsSatisfiedExcl, $row, $col++);	
	$col+=@KeywordsSatisfiedSecond;
}

sub MatchType{
		my ($keyword, $keywordSecond,$keywordExclude, $row, $colNum) = @_;
		my $keywordfind = 0;
		my $keywordexcluefind = 0;

		$ref_array=$$DataArray[$row-1];
		$value=$$ref_array[3];#对应EXCEL的第D列数据
		$find=0;
		$isget=0;
 		#调分词
		#@valueFirst=$value=~ /([^\\n]+)/g;
		#$valueFirstNum=@valueFirst;
		
		#foreach $value(@valueFirst){
			
					foreach(@$keyword) {			# 按关键字过滤
						my $calcount = 0;
						my $lenkey=@$keyword;
				
						if($value =~ /$_/i) {		# i (不|无法)区分大小写
							$keywordfind = 1;
							#$sheet->Cells($row, $colNum)->{'value'} = 1;
							$$ref_array[$colNum-1]=1;
							$find=$_;
							last;
						} else {
							if($_ eq $$keyword[$lenkey-1]){		
								#$sheet->Cells($row, $colNum)->{'value'} = 0;
								$$ref_array[$colNum-1]=0;
							}
						}	
						$calcount++;	
					}
				
				
					if ($keywordfind eq 1){		    
						foreach(@$keywordExclude) {		
							if ($value =~ /$_/i) {
								if($_ eq "sim卡"){
									#print "当前识别出了sim卡\n";
									$isget=1;
								}
								#printf "%s\n", $value;		# 打印排除列表
								$keywordexcluefind = 1;
								last;
							}
						}
						if ($keywordexcluefind eq 1) {
							#$sheet->Cells($row, $colNum)->{'value'} = 0;	
							$$ref_array[$colNum-1]=0;		
						} else {
							#$sheet->Cells($row, 4)->{Font}->{ColorIndex} = 5;	# 这里表示找到了有效数据，置为蓝色		#注释掉因为数组(不|无法)带属性	
						}
					}
					
					#进行二级分类，当匹配到了的时候将当前值置为1
					if (($keywordfind eq 1) && ($keywordexcluefind eq 0)){	
					
						$calcount = 1;
					
						foreach(@$keywordSecond) {			# 按关键字过滤
														if($value eq "指纹解锁跟访客模式一样"){
									#print $isget."\n";
									#print $value."\n";
									#print $_."\n";
									#print "当前的大性能组里面的是\n";
									#print $find."\n";
								}
							if($value =~ /$_/i) {		# i (不|无法)区分大小写
								if($value eq "指纹解锁跟访客模式一样"){
									#print $isget."\n";
									print $value."\n";
									print $_."\n";
									print "当前的大性能组里面的是\n";
									print $find."\n";
								}
				
								$$ref_array[$colNum-1+$calcount]=1;
				
							} else {
				
								$$ref_array[$colNum-1+$calcount]=0;
							}
							$calcount++;
						}	
					
					}
					else{
						$calcount = 1;
					
						foreach(@$keywordSecond) {			# 按关键字过滤
							$$ref_array[$colNum-1+$calcount]=0;
							$calcount++;
						}	
					}
		#}

		

		

	$$DataArray[$row-1]=$ref_array;
}


sub AddTag{
	my ($colNum) = @_;
	foreach $tag (@TAGSERIESSecond) {
		#$sheet->Cells(1, $colNum)->{'value'} = $tag;
		$ref_array=$$DataArray[0];
		$$ref_array[$colNum-1]=$tag;		
		$colNum++;
	}
	$$DataArray[0]=$ref_array;
}


